[
    {
        "title": "Cura Contemporary Open Call 2025 - Temporary, Artist Calls",
        "organization": "Cura Contemporary",
        "location": "California",
        "deadline": "09/16/2025",
        "url": "https://arts.ca.gov/collective/cura-contemporary-231-4-cura-contemporary-open-call-2025/",
        "description": "Cura Contemporary is thrilled to announce our 2025 Open Call! Were looking for Bay Area artists to submit work for a group show. The application opens Friday, August 15th and closes Monday, September 15th, 2025. Entry fee is $15. Artists must be 18+ and live in the following Bay Area counties: Alameda, Contra Costa, Marin, Napa, San Mateo, Santa Clara, Solano, Sonoma, San Francisco, Santa Cruz, San Benito, or Monterey. 2D and 3D work accepted, accepted work must be DROP OFF ONLY, we will not be accepting any mailed in work.",
        "topics_EN": [
            "Any"
        ],
        "fees": "$15",
        "requirement": "Artists must be 18+ and reside in one of these Bay Area counties: Alameda, Contra Costa, Marin, Napa, San Mateo, Santa Clara, Solano, Sonoma, San Francisco, Santa Cruz, San Benito, or Monterey. 2D and 3D work accepted. Accepted work must be drop-off only; mailed submissions will not be accepted."
    },
    {
        "title": "Patterns Art Contest - Temporary, Artist Calls",
        "organization": "Grey Cube Gallery",
        "location": "International",
        "deadline": "09/19/2025",
        "url": "https://arts.ca.gov/collective/grey-cube-gallery-235-4-patterns-art-contest-3/",
        "description": "Grey Cube Gallery proudly presents the fifth Patterns online art contest for the month of September 2025. Contest is open to all artists worldwide over 18 years of age. The Patterns theme may include any work related to the Patterns theme (shapes, lines, textures). All visual art mediums (except video and sound) are allowed. Best of Show artwork will be on the poster of the show. Winning artists (Merit Award & Honorable Mention) will receive a digital award certificate. The deadline to submit entries is the September 18, 2025.",
        "topics_EN": [
            "Patterns",
            "Shapes",
            "Lines",
            "Textures",
            "Repetition"
        ],
        "fees": "$0",
        "requirement": "Open to artists worldwide aged 18 or older. Works must relate to the 'Patterns' theme (shapes, lines, textures). All visual media accepted except video and sound. No size limits stated. Originality requirement not specified. Entries due September 18, 2025."
    },
    {
        "title": "Portrait Art Competition - Temporary, Artist Calls",
        "organization": "Artist Space Gallery",
        "location": "International",
        "deadline": "09/17/2025",
        "url": "https://arts.ca.gov/collective/artist-space-gallery-235-4-portrait-art-competition/",
        "description": "We are pleased to announce our fourth Portrait online Art Competition for the month of September 2025. You may submit artwork depicting individuals, groups, or self-portraits. Artists are encouraged to explore and interpret the concept of portrait in any style or medium. In addition to the selected artists, the jury will select award winners in the following art categories: painting, photography, sculpture. All selected artists will receive a digital award certificate. An article about each artist will be displayed alongside the best of show and three winners. The best of show will be displayed on the poster of the exhibition. Judging the artwork will be based on the following criteria: creativity, originality and quality of art, overall design, demonstration of artistic ability, and usage of medium. The jury will not consider artworks with pornographic or satanic content. Entry fees are $20 for two pieces of artwork. You may submit more than two images; there is no limit to the number of images an artist may submit. The application deadline is September 17, 2025.",
        "topics_EN": [
            "Portraiture",
            "Self-Portrait",
            "Group Portraits",
            "Identity",
            "Artistic Interpretation of Portrait"
        ],
        "fees": "$20 for two pieces",
        "requirement": "Open to artists (no location restriction). Submit portraits (individuals, groups, or self-portraits) as online entries in any style or medium. Entry fee $20 for two artworks; unlimited additional images may be submitted. Works with pornographic or satanic content will not be considered. Deadline: September 17, 2025."
    },
    {
        "title": "Teatri Riflessi 11  International Short Performance Competition - Temporary, Artist Calls",
        "organization": "IterCulture",
        "location": "International",
        "deadline": "11/01/2025",
        "url": "https://arts.ca.gov/collective/iterculture-235-4-teatri-riflessi-11-international-short-performance-competition/",
        "description": "Teatri Riflessi has opened its 2026 call for short performances: live works no longer than 15 minutes of contemporary dance, theatre, circus or multidisciplinary performance.\\nWhere:\\nZafferana Etnea, Sicily, Italy\\nWhen:\\n16-19 July 2026\\nDeadline for applications:\\n1 November 2025 (22:00 CET)\\nFree application\\nSelected works will receive a cachet ranging from 500 to 1,100 (based on the number of performers on stage) and partial support for travel expenses, compete in front of numerous Italian and international professionals (theatre and festival directors, dance networks coordinators, programmers, residency centres, critics and scholars) for several monetary prizes and the possibility of receiving touring and artist residency opportunities.\\nHave a look at the Open Call and fill out the form by the 1st of November 2025.\\nwww.iterculture.eu/en/teatri-riflessi/teatri-riflessi-2026-en/tr11/",
        "topics_EN": [
            "Any"
        ],
        "fees": "$0",
        "requirement": "Open international call for live short performances (contemporary dance, theatre, circus, or multidisciplinary) no longer than 15 minutes; to be presented in Zafferana Etnea, Sicily, Italy, 16–19 July 2026. Free application. Deadline 1 November 2025 (22:00 CET)."
    },
    {
        "title": "San Diego Pastoral  From the Desert through the Mountains to the Sea - Part Time, Artist Calls",
        "organization": "The Courthouse Gallery",
        "location": "San Diego",
        "deadline": "09/03/2025",
        "url": "https://arts.ca.gov/collective/the-courthouse-gallery-244-3-san-diego-pastoral-from-the-desert-through-the-mountains-to-the-sea/",
        "description": "THEME:\\nSubmit your original artwork to San Diego Pastoral  From the Desert through the Mountains to the Sea, a juried exhibition showcasing the natural beauty and biodiversity of the Southern District of California, which covers San Diego and Imperial Counties.\\nWHERE:\\nThe Courthouse Gallery of the United States District Court for the Southern District of California. Artwork will be displayed in a large window on the north side of the Edward J. Schwartz Courthouse. The window faces Broadway and is near the intersection of Broadway and Front Street.\\nELIGIBILITY:\\nOpen to all emerging and established artists 18 and older residing in San Diego and Imperial Counties.\\nFEES:\\nNo fees to apply. We regret that we do not have a budget for shipping cost reimbursement. Artists that are selected for the show must drop off art for this exhibition.\\nArtists may submit up to 3 pieces, two-dimensional, original painting and mixed media only. All art must be hang-ready with D rings, no cable please. AI generated art will not be accepted.",
        "topics_EN": [
            "Natural beauty of Southern California",
            "Biodiversity and regional ecology",
            "Desert-to-mountains-to-sea landscapes",
            "San Diego and Imperial County environments",
            "Native habitats and wildlife"
        ],
        "fees": "$0",
        "requirement": "Open to emerging and established artists 18+ residing in San Diego or Imperial Counties. Submit up to 3 original, two-dimensional works (painting and mixed media only). No AI-generated work. Artwork must be hang-ready with D-rings (no cable). Selected artists must drop off work; no shipping reimbursement."
    },
    {
        "title": "Day of the Dead: Memoirs of loss and renewal - Temporary, Artist Calls",
        "organization": "Barnsdall Junior Arts Center Gallery",
        "location": "Los Angeles",
        "deadline": "09/05/2025",
        "url": "https://arts.ca.gov/collective/barnsdall-junior-arts-center-gallery-236-4-day-of-the-dead-memoirs-of-loss-and-renewal/",
        "description": "Call for Submissions:\\nExperiencing loss is a universal part of the human experience. Through family, friendships, relationships, and circumstances, we are bound by the common threads of life and death. As we remember those who have passed, how their stories have shaped us, we also celebrate the new beginnings that emerge from endings.\\nWe invite you to join us by creating an art installation or altar to honor an individual,  a group of people, a time in history, or a current collective reality that acknowledges loss and renewal.\\nABOUT BJAC\\nThe Barnsdall Junior Arts Center Gallery fosters a vibrant creative community by welcoming all to experience the arts, creativity, and culture. Established in 1967, it was the first gallery in Los Angeles dedicated to hosting artworks by children. Today, the BJAC Gallery generates innovative arts exhibitions that have expanded to include adults from the BAC program as well as artists within the surrounding community and greater Los Angeles.\\nThe gallery is open Thursdays to Saturdays, from 11:00 a.m.  5:00 p.m.",
        "topics_EN": [
            "Loss and Grief",
            "Remembrance and Memory",
            "Honoring Individuals and Communities",
            "Historical and Collective Loss",
            "Renewal and Rebirth",
            "Commemoration"
        ],
        "fees": "$0",
        "requirement": "Call seeks art installations or altars honoring an individual, group, historical moment, or collective experience of loss and renewal. Hosted by BJAC (serving the surrounding community and greater Los Angeles). No application fee, size limits, or originality rules are specified in the provided text."
    },
    {
        "title": "The Small Works Exhibit 2025 - Temporary, Artist Calls",
        "organization": "Art Works Downtown",
        "location": "SF Bay Area",
        "deadline": "10/16/2025",
        "url": "https://arts.ca.gov/collective/art-works-downtown-245-4-the-small-works-exhibit-2025/",
        "description": "Call for Entries:  The Small Works Exhibit\\nNovember 21, 2025January 24, 2026\\nApply by:\\nOctober 16, 2025 \\nCall For Entries.org\\nTheme:\\nArt Works Downtown\\ninvites artists to share their gift of creativity in The Small Works Exhibit, an annual offering of quality fine art to holiday shoppers and the art-loving public. This dynamic showcase will feature over 80 unique artworks in the award-winning Gallery 1337.\\nJuror:\\nTara Esperanza and Andrea Guskin, Artist Curators,\\nMercury 20 Gallery\\nArtwork Requirements (abbreviated):\\n You must live in the SF Bay Area, within 100 miles of San Rafael, California.\\n Size limit: artwork must be smaller than 18x18x18; including frame and all materials.\\n Open to all visual arts media. Video must be silent and include all necessary equipment within the size limit. Projections are prohibited.\\n Original artwork only. No gicles or reproductions. Editions are acceptable if they are originals.\\n Submissions must not have previously exhibited in Gallery 1337.\\n Artwork must be for sale.\\n Apply only if you can arrange delivery and retrieval during the specified dates.\\n Apply through\\nCall For Entries.org\\n. AWD will not accept hardcopy, email, or disk submissions.\\nApplication fee:\\n$40 for up to 3 entries. Discount provided to AWD Artist Members.\\nJoin today!\\nExhibit Schedule (abbreviated):\\n October 16:\\nentries due via CallForEntry.org\\n October 2324:\\nnotification by email\\n November 1516:\\n10am4pm: deliver artwork\\n December 12 and January 9, 58pm:\\nreception\\n January 2931, 125:30 pm:\\nretrieve artwork",
        "topics_EN": [
            "Any"
        ],
        "fees": "$40 for up to 3 entries",
        "requirement": "Artists must live in the SF Bay Area (within 100 miles of San Rafael, CA). Artwork must be original (no giclées or reproductions; editions acceptable if originals). Size limit: under 18 x 18 x 18 inches including frame and all materials. Open to all visual media; video must be silent and include all necessary equipment within the size limit; projections prohibited. Submissions must not have been previously exhibited in Gallery 1337. Artwork must be for sale and artists must arrange delivery and retrieval during specified dates. Apply via CallForEntries.org."
    },
    {
        "title": "Call for Art- IN THE PINK - Temporary, Artist Calls",
        "organization": "Art Fluent",
        "location": "International",
        "deadline": "12/12/2025",
        "url": "https://arts.ca.gov/collective/art-fluent-235-4-call-for-art-in-the-pink/",
        "description": "Art Fluent invites artists worldwide to submit artwork to our online exhibit, IN THE PINK.\\nTHEME\\nWere looking to celebrate everything pink can be. From soft and sweet to bold and in charge, pink does it all. We invite you to explore the many moods of pink. Show us your pink as the main character for IN THE PINK.\\nCALENDAR\\nJPEGs due by Friday, December 12, 2025 at midnight MST.\\nNotification of acceptance and online gallery opening by Friday, January 9, 2026.\\nAWARDS\\nAll accepted pieces will be displayed in our online gallery at www.art-fluent.com\\nBest of Show: $750\\nTwo Directors Choice awards: $250 each\\nENTRY FEE\\n$25 for first entry/$10 for each additional entry. You may enter up to 20 total. Payment is non-refundable and does not guarantee acceptance. For 3D work, there is no need to pay for additional entries for detail shots. Once your first entry is made, you may send additional views by email to hello@art-fluent.com.\\nELIGIBILITY\\nThis call is open to artists worldwide, both amateur and professional. Work that has been selected for previous exhibits with Art Fluent will not be considered.\\nRULES\\nWork that is copied or done under the guidance of an instructor is not eligible. Open to ALL fine art mediums (oil, acrylic, watermedia, pastel, drawing, printmaking, mixed media, photography, sculpture, fiber, wood, ceramics, film/video, digital art). AI will not be accepted. Diptychs and triptychs should be uploaded as a single image.\\nSELECTION PROCESS\\nDirectors choice. Each show is curated and juried by Creative Director, Amy Matteson Neill along with an anonymous committee of jurors. Please note, there is no personal feedback given by jurors.\\nENTRY PROCEDURE\\nEntry is done through CaF, a web-based service that allows artists to upload images and organize their artwork for submissions to galleries. To apply for a call, you must leave our website and go to the CaF website at www.callforentry.org where you can create a FREE artist account. You will add your details and upload your images to CaF and then you can submit work to IN THE PINK. If you have any questions, please contact us at hello@art-fluent.com we are happy to walk you through the process.\\nMEDIA PREPARATION\\nPlease only submit properly cropped images of your work that are in focus. We have a free resource for artists for tips on how to get high quality images of your work. Visit www.art-fluent.com/resources for a free download. CaF also offers tips on their blog which you can find here www.callforentry.org/photographing-artwork/.\\nAll images must be in JPEG/JPG format using CaF guidelines. The image size must be 1,200 pixels or greater on the longest side. Maximum file size is 5 mb.\\nAccepted video formats include MOV, MP4, WMV. Aspect ratio 4:3 or 16:9, resolution minimum 640480, maximum 1920 x1080, bit rate recommended above 240 kbps, recommended frame rate 30 fps. File size must be under 100 MB. If your video work has been selected for the exhibit, we kindly request that you provide us with the file link via Vimeo. Please ensure the linked video is set to be shared publicly. Your video will not play if it is set to private.\\nNOTIFICATION\\nNotification will be done by email, everyone who submits will be notified of the jurors selections. If for any reason you do not hear from us by the notification date, please check the filters in your email account. Notification emails are sent to the email on file with CaF.\\nSALES\\nAll sales inquiries will be directed to the artists website and/or contact information. For any artwork that is sold, the artists receive 100% of the sale.\\nGIVING BACK\\nA portion of the proceeds from the entry fees is donated to organizations committed to the arts and supporting artists.\\nREQUIRED FORMS\\nCash awards over $600 are subject to federal income tax withholding within the United States. A W-9 form must be filled out by the winner and submitted to Art Fluent, Inc.\\nREGULATIONS\\nBy entering our calls for art through CaF you are agreeing to be added to Art Fluents email list for forthcoming artist opportunities. By submitting images, you agree that the images are your own work, nothing copied, you own all rights to the images, and you take full responsibility for the content of all images, including the likeness of recognizable individuals. The actual artwork will remain the property of the artist, our mission is to promote artists and their work. Should your work be accepted, you grant Art Fluent the right to reproduce your image on our website, on social media, and where appropriate to help promote further online opportunities. Art Fluent will always credit you and your copyright wherever feasible. We will not use your image for any other purpose without the artists permission.",
        "topics_EN": [
            "Celebration of Pink",
            "Pink as the Main Subject",
            "Color as Conceptual Focus",
            "Exploration of Mood and Emotion through Color",
            "Aesthetic/Stylistic Variations of Pink"
        ],
        "fees": "$25 first entry / $10 each additional (up to 20 entries)",
        "requirement": "Open to artists worldwide (amateur and professional). Artwork must be original, not previously selected by Art Fluent, not copied or produced under instructor guidance, and AI-generated work is not accepted. All fine art mediums accepted. Up to 20 total entries; payment non-refundable. Image files: JPEG/JPG ≥1200 px on longest side, ≤5 MB; video: MOV/MP4/WMV, 640x480–1920x1080, <100 MB. Diptychs/triptychs uploaded as a single image."
    },
    {
        "title": "Seeking Residency & Workshop Teaching Artists for under-resourced teens and young adults (Hip Hop and Latin Dance Artists) - Freelance, Artist Calls / Jobs",
        "organization": "Segerstrom Center for the Arts",
        "location": "Orange",
        "deadline": "10/20/2025",
        "url": "https://arts.ca.gov/collective/segerstrom-center-for-the-arts-241-5-seeking-residency-workshop-teaching-artists-for-under-resourced-teens-and-young-adults-hip-hop-and-latin-dance-artists/",
        "description": "Seeking Residency & Workshop Teaching Artists for under-resourced teens and young adults\\nSegerstrom Center for the Arts is seeking teaching artists specifically in the following disciplines:\\nLatin dance\\nHip hop dance\\nTeaching artists will lead workshops and residencies targeting historically under-resourced teens and young adults as part of a program called The Cassin Promise. Teaching artists must be passionate about working with youth and believe in the power of the arts to affect social change.\\nThe purpose of this program is to partner with local organizations focused on under-resourced teens and young adults to provide access to arts opportunities for their constituents. Segerstrom Center believes that participating in the creative process is essential for all humans and builds critical life skills such as social and emotional development, problem-solving, teamwork and collaboration, self-confidence, public speaking, reduction of stress and anxiety, and promoting physical and mental well-being, to name a few. This programming will be offered free of charge to support these organizations and the youth they serve reach their goals. Current partner organizations include the Orange County Department of Educations ACCESS (Alternative and Correctional Community Educational Schools and Services) division, Big Brothers Big Sisters of Orange County, Casa Youth Shelter, OC Rescue Mission, Orangewood Family and Children Center, Orangewood Foundation, South Coast Community Services, Waymakers, and various youth shelters and nonprofits throughout the county serving high risk teens and young adults.\\nFor the workshops and residencies below, teaching artists will receive the following:\\nTeaching artists will be engaged as part-time independent contractors on an as needed basis for residencies and workshops as outlined below. There is no regular guarantee of work as it is dependent on the requests of outside organizations.\\nTeaching artists will have access to paid professional development in working with diverse, underserved youth populations.\\nTeaching artists will be paired with one other teaching artist for each workshop and residency.\\nWorkshops, residencies and responsibilities are as follows:\\nDANCE WORKSHOP OR RESIDENCY\\nPlan and implement program content in collaboration with Segerstrom Center staff, outside organization staff and partner teaching artist. Curriculum may be provided for this program or teaching artists may be asked to create curriculum as needed, depending on experience and expertise level.\\nTeaching artists visit local organizations and instruct teens and young adults in their dance style, teaching them not only routines/dance numbers, but the building blocks of dance so that they may choreograph their own piece.\\nTeaching artist should be able to cater their work to the interest and skill level of the participants.\\nResidencies last a minimum of four, 12-hour sessions and may include a culminating presentation for peers, family, friends, and organization stakeholders.\\nQualifications:\\nDemonstrate in-depth knowledge, expertise, and passion for their art discipline\\nExperience working as a Teaching Artist or Classroom Teacher, or teaching in a comparable environment (preferred)\\nExperience working with diverse populations, including high need and high-risk youth and young adults (preferred)\\nStrong classroom management skills while working with diverse students of varying degrees of experience levels and adaptable to a wide range of teaching conditions and learning styles.\\nExhibit a strong passion for teaching and a warm, respectful, and trustworthy rapport with students and other stakeholders.\\nAbility to develop and maintain professional relationships with external partners and stakeholders and represent Segerstrom Center in a professional manner.\\nExcellent collaborative and communication skills; willing and able to team-teach with fellow Teaching Artists\\nMust have own transportation to travel to and from organizations throughout Orange County\\nExperience working with English language learners and ability to speak Spanish or other coming spoken language in our community is a plus\\nMust pass a federal-level background check via live scan fingerprinting\\nMust have ongoing availability on multiple weekdays\\nCompensation:\\n$175/$200/$225/$250 per 45-minute/60-minute/90-minute/120-minute residency visit and culminating event\\n$25 per hour for virtual professional development; $30 per hour for in person professional development\\nTO APPLY:\\nInterested candidates should email their teaching artist/artist resume and a short letter of interest to cassinpromise@scfta.org. In your letter, please indicate which of the following workshops/residencies you are interested in teaching:\\nLatin dance\\nHip hop dance\\nPlease note that we are currently not seeking teaching artists for this program in any other disciplines.\\nAll candidates\\nMUST\\nbe available for a teaching audition and professional development day\\non Thursday, November 6th.",
        "topics_EN": [
            "Youth Arts Access",
            "Dance Education (Latin and Hip Hop)",
            "Serving Under-resourced Teens and Young Adults",
            "Community Engagement",
            "Social and Emotional Development",
            "Arts for Social Change",
            "Skill-building and Empowerment"
        ],
        "fees": "$0",
        "requirement": "Seeking teaching artists in Latin dance or hip hop able to work with historically under-resourced teens and young adults in Orange County. Must be available on multiple weekdays, have own transportation to travel throughout Orange County, and be available for a mandatory teaching audition and professional development day on Thursday, November 6. Candidates must pass a federal-level live-scan background check, be able to team-teach and deliver workshops/residencies (residencies minimum of four 12-hour sessions), and work as part-time independent contractors; teaching experience with diverse/high-risk youth, strong classroom management, and bilingual Spanish are preferred."
    },
    {
        "title": "CALL TO ARTISTS: Arch Enemy Arts is in search of new artists for the 2026 Spotlight Showcase, a juried group exhibition slated for January 2026 - Temporary, Artist Calls",
        "organization": "Arch Enemy Arts",
        "location": "National",
        "deadline": "11/14/2025",
        "url": "https://arts.ca.gov/collective/arch-enemy-arts-238-4-call-to-artists-arch-enemy-arts-is-in-search-of-new-artists-for-the-2026-spotlight-showcase-a-juried-group-exhibition-slated-for-january-2026/",
        "description": "Arch Enemy Arts is an exhibition space for established and emerging artists from all over the world working in the vast and imaginative movement of new-contemporary art. Founded in 2013, AEA is located in the heart of Philadelphias historic Old City district and is dedicated to showcasing the striking and unconventional, highly technical, and utterly bizarre.\\nThe gallery is currently open for submissions to our annual juried Spotlight Showcase exhibition programmed for January 2026. This show features new and emerging talent, as chosen and curated by Arch Enemy Arts, with no themes or direction in subject matter allowing applicants to focus on their best personal work.\\nCuration at Arch Enemy Arts focuses on representational drawing, painting, and sculpture with emphasis in lowbrow/pop-surrealism, dark surrealism, magical realism, post-graffiti and illustrative genres. Artists are encouraged to visit our website at www.archenemyarts.com to get a sense of our curatorial vision and consider if their work is a good fit for the gallery.\\nELIGIBILITY: The 2026 Open Call is open to all artists aged 18+, regardless of location. International submissions are welcome!\\nACCEPTED MEDIUMS: painting, drawing, mixed media, sculpture, ceramics, and collage. We do NOT accept submissions created with Midjourney, Dall-E, or any other AI generating software.\\nIMPORTANT DEADLINE DATES:\\n Submission Deadline: the application window will close promptly at 11:59pm EST on Friday, November 14th, 2025\\n Notifications (for both accepted and rejected works) will be sent by end of day on Tuesday, November 25th, 2025\\nTO SUBMIT YOUR WORK TO THE 2026 OPEN CALL go to www.archenemyarts.com/opencall2026. At the link, you will find the online application and more information including submission instructions, requirements, and a summary for consignment if your work is accepted. Unfortunately, we cannot provide feedback on work that is not accepted; however, we encourage artists to reapply again to future open calls. Good luck, and we look forward to reviewing your work.",
        "topics_EN": [
            "Lowbrow / Pop-Surrealism",
            "Dark Surrealism",
            "Magical Realism",
            "Post-Graffiti",
            "Illustrative Art",
            "Representational Drawing, Painting, Sculpture",
            "New-Contemporary / Unconventional Bizarre Work"
        ],
        "fees": "$0",
        "requirement": "Open to artists aged 18+ worldwide (international submissions welcome). Accepted media: painting, drawing, mixed media, sculpture, ceramics, and collage. No AI-generated works accepted (e.g., Midjourney, DALL·E). No specific size limits or thematic requirement listed, but work should be a fit for the gallery’s curatorial focus (representational/lowbrow/pop-surrealism/dark surrealism/magical realism/post-graffiti/illustrative). Submit via the online application by 11:59pm EST on Nov 14, 2025."
    },
    {
        "title": "In Person Exhibition  Over $450,000 In Awards Available  Art Comes Alive 2025 - Temporary, Artist Calls",
        "organization": "ADC Fine Art",
        "location": "National",
        "deadline": "10/03/2025",
        "url": "https://arts.ca.gov/collective/adc-fine-art-238-4-in-person-exhibition-over-450000-in-awards-available-art-comes-alive-2025/",
        "description": "For over 30 years, its been ADCs mission to support living artists, and ACA (Art Comes Alive) does just that. Now entering its 16th year, ACA has earned its reputation as the Academy Awards for Art, and its only getting bigger\\nHeld inside our stunning 13,000 sq. ft. gallery in Cincinnatis vibrant Over-the-Rhine district, an artistic hub bursting with creativity, ACA is a career-making opportunity for contemporary artists.\\nThis one-of-a-kind event connects artists with the people who can elevate their careers: interior designers, gallery owners, private collectors, corporate art buyers, and more. Each year, ACA grows in size, prestige, and and influence  and this year promises to be the biggest yet, featuring:\\n Over $450,000 in awards,\\n New jurors,\\n More exposure, opportunities, and ways to get your work seen and sold\\nIf youre ready to take your art career to the next level, ACA 2025 is your moment!",
        "topics_EN": [
            "Any"
        ],
        "fees": "$0",
        "requirement": "Open to contemporary artists (no residency or location restriction stated). Event held in Cincinnati’s Over-the-Rhine district. The call does not specify size limits, originality requirements, or other submission rules; selection is juried with awards and sales opportunities. No application fee listed."
    },
    {
        "title": "31st Solo Art Series  An Opportunity to Shine - Temporary, Artist Calls",
        "organization": "Light Space & Time Online Art Gallery",
        "location": "International",
        "deadline": "09/05/2025",
        "url": "https://arts.ca.gov/collective/light-space-time-online-art-gallery-235-4-31st-solo-art-series-an-opportunity-to-shine/",
        "description": "Light Space & Time Online Art Gallery announces its 31st Solo Art Series Online Art Competition. 4 Solo Exhibitions & 8 Artist Showcases will be awarded.\\nThere is no theme for this solo art competition so any subject matter and any media are acceptable for consideration. Both 2D & 3D artists (including photography & digital arts) are invited to submit their best representational and/or abstract art.\\nExtensive worldwide publicity & promotion, hundreds of press releases for winning artists.\\nEntry Fee: $26.00\\nDeadline to enter is September 5, 2025.\\nFor further information and to apply online to this solo art opportunity here:\\nhttps://lightspacetime.art/31st-solo-art-series-2025/\\nAbout Light Space & Time Online Art Gallery\\nLight Space & Time Online Art Gallery conducts monthly themed online art competitions and art exhibitions for new and emerging artists on a worldwide basis.  It is the gallerys intention to help todays artists to successfully market their art to a worldwide audience.",
        "topics_EN": [
            "Any"
        ],
        "fees": "$26.00",
        "requirement": "Open to artists worldwide. Any subject matter and any media accepted (2D, 3D, photography, digital); representational or abstract work allowed. No size limits specified. Originality requirement not stated. Deadline to enter: September 5, 2025."
    },
    {
        "title": "$4,500 Grants for Artists - Temporary, Artist Calls / Grants",
        "organization": "The Hopper Prize",
        "location": "International",
        "deadline": "11/12/2025",
        "url": "https://arts.ca.gov/collective/the-hopper-prize-235-4-4500-grants-for-artists/",
        "description": "The Hopper Prize\\nis now accepting entries for our Fall 2025 artist grants.\\nFor this open call, we have increased grant amounts to $4,500.\\nWe are offering $4,500 and $1,000 grants to artists and photographers around the world.\\nThe Hopper Prize was established in order to increase the recognition of artwork created by artists and photographers. Our aim is to advance artists careers by providing them with unrestricted financial support that is coupled with a platform for increased visibility. We accept submissions twice a year via an open call.\\nWe are currently accepting submissions for the Fall 2025 grant cycle.\\nProgram Highlights\\nTotal Awards: $13,000.00 USD for visual artists\\n$4,500.00  2 artists will each receive a $4,500 (USD) grant\\n$1,000.00  4 artists will each receive a $1,000 (USD) grant\\n30 artists will have their work archived at hopperprize.org\\nA selection from the submissions will be featured on our Instagram feed @hopperprize\\nAdditional exposure will be available to winners through our Journal: Insights into Contemporary Art\\nExpand Your Network\\nOur open call provides you with a direct path to get your work in front of an international community of curators, artists, gallerists, and arts administrators. Grant winners and finalists will join an international roster of past recipients who have gone on to exhibit their work at major galleries, museums, arts fairs, and biennials.\\n6 artists from our open call will each receive an unrestricted cash grant.\\n2 artists will win $4,500 and 4 artists will win $1,000.\\n30 artists will have their work archived at hopperprize.org.\\nGrant awards are unrestricted and may be used any way the recipients choose.\\nWhen submitting your work, you will have the option to opt-in to be considered for possible Instagram features on our feed @hopperprize, where we currently reach an audience of over 150k. Our editors will be featuring select submissions on a rolling basis prior to the application deadline.\\nIn addition to grant awards, our shortlist, and Instagram reach, we will be providing an additional platform for exposure via our online Journal Insights Into Contemporary Art. We launched this digital publication to give artists a new channel to amplify their voice while providing an in-depth look at their work, practice, and background. Grant recipients and shortlisted artists will all receive the opportunity to publish an interview to include any work of their choosing as a means of providing continued support beyond the open call.\\nEligibility\\nThe Hopper Prize is open to all artists age 18 and older working in any media. There are no restrictions on genre, subject matter, or media. We welcome entries in all media.\\nWe are committed to supporting artists from diverse cultural backgrounds at all stages of their professional careers. All artists are encouraged to apply.\\nRecent Winners\\nWe support artists working in all media, from diverse backgrounds, in wide-ranging geographic locations. Recent grant winners include:\\nJ. Carino, Riverside, California\\nMolly Blumberg, Chicago, Illinois\\nDadu Shin, Brooklyn, New York\\nHayden Williams, Frederick, Maryland\\nJillian Freyer, Boston, Massachusetts\\nMargaret R. Thompson, Santa Fe, New Mexico\\nAlex Bex, Berlin, Germany\\nSuzanne Clements, London, United Kingdom\\nLiam Fallon, London, United Kingdom\\nLiza Jo Eilers, Chicago, Illinois\\nNicole Economides, Athens, Greece\\nParee Rohera, Providence, Rhode Island\\nHai-Wen Lin, Chicago, Illinois\\nAntonio Scott Nichols, Philadelphia, Pennsylvania\\nAriana Gomez, Austin, Texas\\nDerek Franklin, Portland, Oregon\\nIngmar Bjrn Nolting, Leipzig, Germany\\nAbdulhamid Kircher, Los Angeles, California\\nAllison L. Wade, Chicago, Illinois\\nAndreia Santana, Lisbon, Portugal & New York, New York\\nAnna Perach, London, United Kingdom\\nJimena Chvez Delion, Lima, Peru\\nKrystle Lemonias, Phillipsburg, New Jersey\\nVille Kansanen, California\\nEmily Kraus, London, United Kingdom\\nMhammed Kilito, Casablanca, Morocco\\nEmily Weiner, Nashville, Tennessee\\nJudd Schiffman, Providence, Rhode Island\\nMar Figueroa, New York, New York\\nEli Durst, Austin, Texas\\nBritt Ransom, New Orleans, Louisiana\\nAzadeh Gholizadeh, Chicago, Illinois\\nBrittany Miller, Bronx, New York\\nGalina Kurlat, Brooklyn, New York\\nIn June Park, Brooklyn, New York\\nRafael Perez Evans, London, United Kingdom\\nJazmine Harris, Chicago, Illinois\\nAnya Roberts-Toney, Portland, Oregon\\nCathy Hsiao, Chicago, Illinois\\nJulia Gutman, Sydney, Australia\\nSagarika Sundaram, New York, New York\\nAbi Salami, Dallas, Texas\\nAbigail Lucien, Baltimore, Maryland\\nHasani Sahlehe, Atlanta, Georgia\\nLaura Berger, Chicago, Illinois\\nJennifer Sirey, Brooklyn, New York\\nCielo Felix-Hernandez, Richmond, Virginia\\nAkihiro Boujoh, Utrecht, Netherlands\\nJoey Solomon, Brooklyn, New York\\nLynnea Holland-Weiss, Cleveland, Ohio\\nSusan Chen, Hartford, Connecticut\\nYannick Lowery, Philadelphia, Pennsylvania\\nAndrea Ferrero, Mexico City, Mexico\\nChristopher Desanges, Boston, Massachusetts\\nDominic Hawgood, London, United Kingdom\\nKira Dominguez Hultgren, San Francisco, California\\nVikesh Kapoor, Sunset Pines\\nAdrian Coleman, London, United Kingdom\\nTrish Tillman, New York, New York\\nNicholas Moenich, Brooklyn, New York\\nElena Bajo, Los Angeles, California\\nVanessa da Silva, London, United Kingdom\\nMark Baugh-Sasaki, San Francisco, California\\nGenevieve Cohn, Bloomington, Indiana\\nSydney Cook, Baltimore, Maryland\\nJinyong Park, London, United Kingdom\\nIsabel Yellin, Los Angeles, California\\nAlex Callender, Northampton, Massachusetts\\nAlicia Eggert, Denton, Texas\\nDaniel McCarthy Clifford, Minneapolis, Minnesota\\nJuan Giraldo, New York, New York\\nMaja Ruznic, Los Angeles, California\\nLetitia Huckaby, Benbrook, Texas\\nTracy Kerdman, Saugerties, New York\\nLebohang Kganye, Johannesburg, South Africa\\nChristopher Meerdo, Chicago, Illinois\\nErik Parra, San Francisco, California\\nDeadline\\nNovember 11, 2025\\nSimple Application\\nWe made our grant application simple to reduce the stress of submitting your work and save you time. The application is short and can be completed in under 20 minutes.\\nTo apply for a grant, you only need to submit this information:\\nName & Email\\nInstagram Username (optional)\\nUp to 10 Image or Video attachments\\nArtwork captions\\nArtist Statement & Biography (optional)\\n$40 submission fee\\nApply Now\\nShow us your work at https://hopperprize.org",
        "topics_EN": [
            "Any"
        ],
        "fees": "$40",
        "requirement": "Open to artists worldwide, age 18 and older. Any media and subject matter accepted; no size limits specified. Submit up to 10 image or video attachments with artwork captions; application includes name/email (Instagram, artist statement & bio optional). $40 submission fee."
    },
    {
        "title": "Call for Artists: CICA Contemporary Art Solo Show Series Spring 2026 - Temporary, Artist Calls",
        "organization": "CICA Museum",
        "location": "International",
        "deadline": "09/05/2025",
        "url": "https://arts.ca.gov/collective/cica-museum-235-4-call-for-artists-cica-contemporary-art-solo-show-series-spring-2026-2/",
        "description": "CICA Museum invites artists worldwide to participate in the Contemporary Art Solo Show Series and the publication. Each selected artist will have a solo exhibition for a week (Wednesday  Sunday) in the gallery space (around 44m2). The artists will be also featured in the the e-book, CICA Art Now 2026, which will be available via Amazon Kindle. The printed version will be available by order.\\n*The categories include:\\n Painting\\n Photography\\n Sculpture and Installation Art\\n Performance\\n Video & New Media Art\\n*Timeline:\\nSeptember 5, 2025: Close submissions\\nSeptember 10  30, 2025: Approvals: Selected artists will be notified by email.\\nBetween January and June 2026: Contemporary Art Solo Show Series\\nAugust 1, 2026: Expected publication date of CICA Art Now 2026\\n*How to submit your work: Please visit our website for more information.\\nhttps://cicamuseum.com/call-for-artists-contemporary-art-solo-show-series/",
        "topics_EN": [
            "Any"
        ],
        "fees": "$0",
        "requirement": "Open to artists worldwide. Selected artists receive a one-week solo exhibition (Wednesday–Sunday) in a gallery of approximately 44 m². Accepted categories: Painting, Photography, Sculpture & Installation, Performance, Video & New Media. No application fee or specific size/originality restrictions are stated in the call; applicants should check the website for full submission requirements. Submission deadline: September 5, 2025."
    },
    {
        "title": "Ocean IV Virtual Artist Residency - Part Time, Artist Calls",
        "organization": "Moku Art Studio",
        "location": "Other",
        "deadline": "09/22/2025",
        "url": "https://arts.ca.gov/collective/moku-art-studio-242-3-ocean-iv-virtual-artist-residency/",
        "description": "Open Call: Oceans IV  Virtual Artist Residency!\\nDive into a transformative creative experience from October to November 2025. This residency offers a unique opportunity to develop your artistic projects, connect with a global community of artists, and share your work with an international audience.\\nWhats in store:\\nVirtual Mentorship: Participate in five virtual sessions with experienced mentors from Moku Art Studio and Mango Residencia.\\nTheme Exploration: Develop your projects inspired by the theme of the Ocean, exploring a wide range of approachestechnical, conceptual, reflective, and experiential.\\nCreative Development: Receive insightful feedback and guidance to refine your ideas, techniques, and creative vision.\\nGlobal Exposure: Showcase your work at a Virtual Open Studio and Exhibition Inauguration, connecting with art enthusiasts and fellow creators from around the world.\\nWe invite you to explore the boundless possibilities of the ocean and make waves with your art! Learn more\\nhere\\n.",
        "topics_EN": [
            "Ocean",
            "Marine Ecology",
            "Human–Ocean Relationship",
            "Ocean Conservation",
            "Seascapes and Maritime Culture",
            "Reflective and Experiential Encounters with the Sea"
        ],
        "fees": "$0",
        "requirement": "Virtual residency open to artists globally (October–November 2025). Participants join five virtual mentorship sessions and a virtual open studio/exhibition. Projects must be inspired by the Ocean. No location, size limits, or originality requirements are specified in the call."
    },
    {
        "title": "Women Artists 2025 Art Competition - Temporary, Artist Calls",
        "organization": "Fusion Art",
        "location": "International",
        "deadline": "09/05/2025",
        "url": "https://arts.ca.gov/collective/fusion-art-235-4-women-artists-2025-art-competition/",
        "description": "Fusion Art announces the Women Artists 2025 Art Competition.\\nFor this open theme online art competition, any subject matter and any media are acceptable for consideration. All 2D & 3D women artists only, worldwide, are invited to submit their best representational and/or abstract art and photography.\\nChoice of a cash prize or complimentary one-year membership to Fusion Arts Members Gallery for Best in Show winners. Winners and finalists are provided with extensive worldwide publicity and promotion.\\nEntry Fees: $25 for 1-2 images / $40 for up to 5 images\\nThe deadline to enter is September 5, 2025.\\nPlease visit\\nhttps://www.fusionartps.com/calls-for-artists/\\nfor full competition guidelines and to submit.\\nAbout Fusion Art\\nFounded by Award winning artist, Chris and Valerie Hoffman, Fusion Art was envisioned and formed out of a passion for art and the artists who create it. The website promotes and connects new, emerging and established artists with collectors and art enthusiasts, while offering the opportunity to participate in art competitions, exhibitions and experiences.",
        "topics_EN": [
            "Any"
        ],
        "fees": "$25 for 1-2 images; $40 for up to 5 images",
        "requirement": "Open to women artists worldwide (2D & 3D). Any media, representational or abstract art and photography accepted; open-theme online competition. No size limits or originality requirement specified in the call. Deadline: September 5, 2025."
    },
    {
        "title": "Landscapes 2025 Art Competition - Temporary, Artist Calls",
        "organization": "Fusion Art",
        "location": "International",
        "deadline": "09/01/2025",
        "url": "https://arts.ca.gov/collective/fusion-art-235-4-landscapes-2025-art-competition/",
        "description": "Fusion Art announces the Landscapes 2025 Art Competition.\\nFor this competition, both 2D & 3D artists, worldwide, are invited to submit their best representational and/or abstract art and photography depicting landforms such as mountains, hills, valleys, deserts, farmland, trees, rivers, lakes, ponds, forests, wilderness, polar regions, rainforests, islands and tropical landscapes.\\nChoice of a cash prize or complimentary one-year membership to Fusion Arts Members Gallery for Best in Show winners. Winners and finalists are provided with extensive worldwide publicity and promotion.\\nEntry Fees: $25 for 1-2 images / $40 for up to 5 images\\nThe deadline to enter is September 1, 2025.\\nPlease visit\\nhttps://www.fusionartps.com/calls-for-artists/\\nfor full competition guidelines and to submit.\\nAbout Fusion Art\\nFounded by Award winning artist, Chris and Valerie Hoffman, Fusion Art was envisioned and formed out of a passion for art and the artists who create it. The website promotes and connects new, emerging and established artists with collectors and art enthusiasts, while offering the opportunity to participate in art competitions, exhibitions and experiences.",
        "topics_EN": [
            "Landscapes",
            "Mountains and Hills",
            "Valleys",
            "Deserts",
            "Farmland and Agricultural Landscapes",
            "Trees and Woodlands",
            "Rivers, Lakes and Ponds",
            "Forests and Rainforests",
            "Wilderness and Untamed Nature",
            "Polar and Arctic Landscapes",
            "Islands and Tropical Landscapes",
            "Abstract Interpretations of Landscape",
            "Representational Landscape Photography"
        ],
        "fees": "$25 for 1-2 images; $40 for up to 5 images",
        "requirement": "Open to artists worldwide (2D, 3D, and photographers). Submissions must depict landscapes/landforms (see list in call); both representational and abstract work accepted. Entry fee $25 (1–2 images) or $40 (up to 5 images). Deadline September 1, 2025. No size limits or explicit originality requirement specified in the call—refer to full guidelines for detailed rules."
    },
    {
        "title": "Call for Artists  Alchemist Public Market - Freelance, Artist Calls",
        "organization": "Alchemist CDC",
        "location": "California",
        "deadline": "10/03/2025",
        "url": "https://arts.ca.gov/collective/alchemist-cdc-231-5-call-for-artists-alchemist-public-market/",
        "description": "The River District in Sacramento boasts a rich history shaped by its strategic position at the confluence of the Sacramento and American Rivers. Our latest initiative, Alchemist Public Market is designed to serve as a central gathering space for the community including a full-service cafe, corner store, and food courtyard as well as special events like farmers markets, outdoor movie nights, and more! Alchemist Public Market will be a place where residents can connect, engage, and build lasting relationships with their neighbors. Originally an isolated area, the River District emerged as a vital distribution hub for agricultural products, leveraging both river and rail transportation to support regional commerce. Over time, the district evolved into an industrial center. Today, it is undergoing a significant transformation through revitalization efforts aimed at rebranding the area into a dynamic, mixed-use urban community. For additional information on this project, please feel free to visit our website: https://alchemistpublicmarket.com/\\nAlchemist Public Market offers four opportunities for site-specific public art installations by local Sacramento artists. Each piece is intended to reflect and honor the historical significance of the area while aligning with the mission and vision of the space.\\nFor detailed information for each opportunity available, please scan the attached QR code.\\n1.    Interior mural\\n2.    Exterior Mural\\n3.    Exterior Sculpture\\n4.    Seating Sculpture",
        "topics_EN": [
            "River District Local History",
            "River and Rail Transportation Heritage",
            "Agricultural Heritage and Distribution",
            "Industrial Past",
            "Community Gathering and Connection",
            "Revitalization and Urban Transformation",
            "Neighborhood Identity and Place-making"
        ],
        "fees": "$0",
        "requirement": "Open to local Sacramento artists for site-specific public artworks at Alchemist Public Market (River District). Opportunities: interior mural, exterior mural, exterior sculpture, seating sculpture. Artwork must reflect and honor the area's historical significance and align with the market's mission/vision. No application fee noted; size limits and other technical requirements are not specified in the call."
    },
    {
        "title": "Homo Technologicus - Temporary, Artist Calls",
        "organization": "LoosenArt",
        "location": "International",
        "deadline": "01/22/2026",
        "url": "https://arts.ca.gov/collective/loosenart-235-4-homo-technologicus/",
        "description": "HOMO TECHNOLOGICUS\\nFree entryCall for Exhibition\\nPhotographers are invited to submit 1 up to 3 photos addressing the theme.\\nGroup Exhibition in Rome. April 2026\\n\\nLoosenArt is launching a call for photographerfor the selection of works to be included in the exhibition Homo Technologicus.\\nThe exhibition aims to explore the relationship between human beings and technology, investigating the social, environmental, physical, cognitive, and emotional transformations brought about by technological and digital innovation.\\nPhotos that interpret the theme either directly or metaphorically, with full freedom of language and experimentation, are welcome.\\n\\nSubmissions  http://bit.ly/loosenartcalls\\nDeadline January 22nd, 2026",
        "topics_EN": [
            "Human–Technology Relationship",
            "Social Impacts of Technology",
            "Environmental Effects of Technology",
            "Physical, Cognitive and Emotional Transformation",
            "Digital Innovation and Its Consequences"
        ],
        "fees": "$0",
        "requirement": "Open to photographers; free entry. Submit 1–3 photos interpreting the theme (directly or metaphorically). Group exhibition in Rome (April 2026). Deadline January 22, 2026; submission via provided link."
    },
    {
        "title": "Unexpurgated: Freedom in Form and Color - Temporary, Artist Calls",
        "organization": "Limner Gallery",
        "location": "Other",
        "deadline": "11/08/2025",
        "url": "https://arts.ca.gov/collective/limner-gallery-242-4-unexpurgated-freedom-in-form-and-color/",
        "description": "Unexpurgated: Freedom in Form and Color: This call is for art as a form of speech and expression, focusing on themes of personal truth, social commentary, identity, resistance and the uninhibited creative voice. Entry is open to all artists working in any media. The exhibition will be held at the Limner Gallery from March 5  28, 2026.",
        "topics_EN": [
            "Personal Truth",
            "Social Commentary",
            "Identity",
            "Resistance",
            "Freedom of Expression",
            "Uninhibited Creative Voice",
            "Art as Speech"
        ],
        "fees": "$0",
        "requirement": "Open to all artists (no location restriction stated). Any media accepted. Artwork should address themes of personal truth, social commentary, identity, resistance, or uninhibited creative voice. Size limits, originality requirements, and submission fees are not specified."
    },
    {
        "title": "Abstract | Juried Online Exhibition - Freelance, Artist Calls",
        "organization": "UPWARD gallery",
        "location": "International",
        "deadline": "09/05/2025",
        "url": "https://arts.ca.gov/collective/upward-gallery-235-5-abstract-juried-online-exhibition/",
        "description": "UPWARD Gallery invites artists to submit artwork for our juried online exhibition, Abstract.\\nAll media is welcome, including: painting, drawing, digital painting, sculpture, printmaking, photography, textiles, mixed media, etc.\\nAwards: Interview and other publications in our print edition of UPWARDs magazine and on the website, digital certificate, personal artist page on the gallery website. The exhibition will be promoted online on the our website and social media channels. All artists retain 100% of sales with inquiries directed to them.\\nFee: $15 for entry, $12 (2-4 entries), $10 (5 or more entries).\\nDeadline: September 5, 2025\\nVisit\\nhttps://upwardgallery.com/ad/competitions/113/abstract\\nfor a full information.\\nThe UPWARD Gallery was founded in 2021. Our online platform is designed to share art with new audiences using modern technologies. We help emerging artists to become known and established artists to expand their influence.",
        "topics_EN": [
            "Abstract Art",
            "Non-representational Art",
            "Formal and Conceptual Exploration"
        ],
        "fees": "$15 (single entry); $12 (2-4 entries); $10 (5 or more entries)",
        "requirement": "Open to all artists (no geographic restriction stated). Juried online exhibition accepting all media (painting, drawing, digital, sculpture, printmaking, photography, textiles, mixed media, etc.) — work should be abstract/non-representational. No size limits or explicit originality requirement specified. Entry fee applies as listed."
    },
    {
        "title": "CALL TO ARTISTS Big Orange Monster: An Emergency Collage Exhibition - Freelance, Artist Calls",
        "organization": "Kolaj Institute",
        "location": "International",
        "deadline": "09/04/2025",
        "url": "https://arts.ca.gov/collective/kolaj-institute-235-5-call-to-artists-big-orange-monster-an-emergency-collage-exhibition/",
        "description": "CALL TO ARTISTS\\nBig Orange Monster: An Emergency Collage Exhibition\\nat Kolaj Institute Gallery in New Orleans, Louisiana, USA\\n10 September-25 October 2025\\nDeadline to receive work: Thursday, 4 September 2025\\nYou mix fear (yellow) and anger (red) and you get a Big Orange Monster. Whats the emergency? There are a lot of Big Orange Monsters on the loose. Monsters only have power if you are afraid of them. So lets create a space where we can slay our fear of Big Orange Monsters. Art helps us exorcise our demons. Monsters can be glorious and wonderful or horrible and evil. Lets not cast aside the good Big Orange Monsters because some other Big Orange Monsters are wellunpleasant.\\nThe world is run by monsters and you have to deal with them. Some of them run countries, some of them run banks, some of them run news corporations. Ken Livingstone (source)\\nCALL TO ARTISTS\\nKolaj Institute invites collage artists to make a big orange monster collage for an exhibition at Kolaj Institute Gallery in New Orleans that will take place in September and October 2025. A selection will be featured in a small publication. The exhibition is being curated by Ric Kasini Kadour.\\nTo participate, the collage must meet the following specifications:\\nNo larger than 16x20\\nUnframed; shipped flat or in a tube\\nLimit one collage per artist\\nArrive no later than 4 September 2025\\nEnvelope must say, Big Orange Monster inside\\nArtist must complete online submission form.\\nIf you want the artwork returned and the artwork is larger than 10x8, the packaging must be reusable.\\nThis is an open exhibition and those artworks that meet the specifications and arrive by the deadline will be exhibited. Analog collage is preferred. Digital collage with an inherent material sense will be accepted. Prints and reproductions will not be accepted. The curator reserves the right to exercise their discretion.",
        "topics_EN": [
            "Fear and Anger",
            "Confronting Powerful 'Monsters' (political, corporate, media)",
            "Personal/Collective Exorcism of Demons",
            "Satire and Irony about Leadership/Authority",
            "Empowerment and Resistance"
        ],
        "fees": "$0",
        "requirement": "Open to collage artists (exhibition at Kolaj Institute Gallery, New Orleans). One entry per artist; analog collage preferred (digital collage allowed if it has an inherent material sense); prints/reproductions not accepted. Artwork must be unframed, no larger than 16x20 inches, shipped flat or in a tube, arrive by 4 Sept 2025; envelope must be labeled \"Big Orange Monster inside\"; artists must complete an online submission form. If return is requested and work is larger than 10x8, packaging must be reusable. Curator reserves discretion."
    },
    {
        "title": "2026 ArtTreasury Collectors Annual Call For Artists  Deadline October 31, 2025 - Temporary, Artist Calls",
        "organization": "ArtAscent",
        "location": "International",
        "deadline": "11/01/2025",
        "url": "https://arts.ca.gov/collective/artascent-235-4-2026-arttreasury-collectors-annual-call-for-artists-deadline-october-31-2025/",
        "description": "The artists call for the ArtTreasury Collectors Annual 2026 issue is open.\\nArtTreasury is an annual time capsule of global creativity, a treasure box of artwork by diverse artists. This magazine provides a special feature on each artist, complete with their art, artist statement and contact information. Book your space in this special catalogue of talented of artists from around the world. Your work will be published or your fee will be refunded.\\nArtTreasury showcases artists from around the world practising a broad range of skills, including painting, illustration, photography, mixed media, ceramics, sculpture, textile, jewelry, printmaking, digital graphics, fashion, film, video, installation and performance.\\nThe selected artists will be published in our print and digital magazine and the two-year online exhibition, as well as receive a free digital copy of the magazine. All benefit from professional portfolio presentation to art lovers and engage our readers through our social media, website, and print and digital issues. ArtAscent provides the opportunity for the voices and visions of writers and artists to be shared in a professional and accessible platform.\\nArtTreasury presents high-level designed pages printed on premium-quality paper, with no outside commercial ads.\\nEntries may include all art mediums that can be represented in 2D. Submissions must be the original work of the applicant(s). Creatives featured in the past can apply again with other works not previously published in ArtTreasury. HOW TO APPLY: Apply using the online application form on our website. Application fees help cover costs such as design, writing, administration and artist promotion. NOTIFICATION: Notification is made by email to subscribers of the ArtAscent newsletter.",
        "topics_EN": [
            "Any"
        ],
        "fees": "$0",
        "requirement": "Open to artists worldwide. Submissions must be original work and representable in 2D (images of painting, illustration, photography, print, digital, textile, jewelry, etc.). Past ArtTreasury contributors may reapply only with works not previously published. Apply via the online application form. Selected artists will be published in the print and digital magazine (or the application fee will be refunded)."
    },
    {
        "title": "Plein air | Juried Online Exhibition - Freelance, Artist Calls",
        "organization": "UPWARD gallery",
        "location": "International",
        "deadline": "09/12/2025",
        "url": "https://arts.ca.gov/collective/upward-gallery-235-5-plein-air-juried-online-exhibition/",
        "description": "UPWARD Gallery invites artists to submit artwork for our juried online exhibition, Plein air.\\nAll media is welcome, including: painting, drawing, digital painting, sculpture, printmaking, photography, textiles, mixed media, etc.\\nAwards: Interview and other publications in our print edition of UPWARDs magazine and on the website, digital certificate, personal artist page on the gallery website. The exhibition will be promoted online on the our website and social media channels. All artists retain 100% of sales with inquiries directed to them.\\nFee: $15 for entry, $12 (2-4 entries), $10 (5 or more entries).\\nDeadline: September 12, 2025\\nVisit\\nhttps://upwardgallery.com/ad/competitions/114/plein-air\\nfor a full information.\\nThe UPWARD Gallery was founded in 2021. Our online platform is designed to share art with new audiences using modern technologies. We help emerging artists to become known and established artists to expand their influence.",
        "topics_EN": [
            "Plein air",
            "Outdoor Scenes",
            "Landscape",
            "Nature",
            "Light and Atmosphere"
        ],
        "fees": "$15; $12 (2-4 entries); $10 (5 or more entries)",
        "requirement": "Open to artists (no location restriction stated). All media accepted. Artwork should address the 'Plein air' theme (outdoor/landscape scenes). No size limits or explicit originality requirement specified in the call. Entry fees apply as listed."
    },
    {
        "title": "Call For Photography: Pharmacopoeia - Temporary, Artist Calls",
        "organization": "TCG Gallery",
        "location": "Other",
        "deadline": "09/16/2025",
        "url": "https://arts.ca.gov/collective/tcg-gallery-242-4-call-for-photography-pharmacopoeia/",
        "description": "Pharmacopeia: noun. What does this term bring to your minds eye? Do you find yourself assembling an archive of substances, reflecting on memories of addiction, recovery, or relapse? Is your mind a panopticon of disorder, a chaotic realm of fear and loathing from which you yearn to break through? Did you habitually utilize recreational substances in your practice, or were you just intoxicated when you created something?\\nPharmacopoeia is an international open call for photographers ages 18 and older. All forms of two-dimensional images, traditional and non-conventional media, and conventional or alternative photographic processes with a subjective analog or digital photographic base are welcome for submission.\\nSubmission Deadline: September 15th, 2025\\nJuror Notifications: September 27th, 2025\\nFormat: Online Exhibition\\nExhibition: October 1st, 2025  November 1st, 2025",
        "topics_EN": [
            "Substance Archives",
            "Addiction and Recovery",
            "Relapse and Sobriety",
            "Intoxication and Creativity",
            "Altered States of Consciousness",
            "Mental Health and Disorder",
            "Memory and Trauma",
            "Pharmacological/Chemical Imagery"
        ],
        "fees": "$0",
        "requirement": "Open to photographers worldwide aged 18 and older. Accepts two-dimensional photographic works (analog or digital base), including traditional, alternative, and non-conventional processes. No size limits or fees specified; originality not explicitly stated."
    },
    {
        "title": "Open Call - Freelance, Artist Calls",
        "organization": "Sunspot Literary Journal",
        "location": "International",
        "deadline": "09/01/2025",
        "url": "https://arts.ca.gov/collective/sunspot-literary-journal-235-5-open-call/",
        "description": "Sunspot Lits\\nopen calls for very longform fiction, CNF, poetry and graphic novels close this month. Accepting all genres and categories; seeking exceptional craft from every voice. Guidelines and deadlines here:\\nhttps://sunspotlit.submittable.com/submit\\n.",
        "topics_EN": [
            "Any"
        ],
        "fees": "$0",
        "requirement": "Open to all writers; accepting very longform fiction, creative nonfiction (CNF), poetry, and graphic novels in any genre. Submissions must follow Sunspot Lit's guidelines and deadlines (see link). No location, size, originality, or fee requirements specified in the call."
    },
    {
        "title": "She Carries the Sky: A Showcase of Contemporary Women Artists - Temporary, Artist Calls",
        "organization": "Visionary Art Collective",
        "location": "Other",
        "deadline": "09/01/2025",
        "url": "https://arts.ca.gov/collective/visionary-art-collective-242-4-she-carries-the-sky-a-showcase-of-contemporary-women-artists/",
        "description": "She Carries the Sky is a virtual exhibition and print catalog dedicated to highlighting the dynamic talents of contemporary women artists from around the world. Juried by a distinguished juried panel of art world professionals including Ekaterina Popova, Alicia Puig, Marina Press Granger, and Liza Zhurkovskaya, we aim to create a vibrant and inclusive show that honors and amplifies the voices of women artists.\\nEligibility: Women artists of all backgrounds, disciplines, and experience levels are invited to submit their work for consideration. Must be 18+ to submit.\\nWe accept all 2D & 3D mediums, including painting, drawing, photography, digital, prints, fiber art, collage, mixed media, sculpture, ceramics, and installation art. We do not accept film or video at this time.\\nMeet Our Juried Panel \\nEkaterina Popova is the founder of Create! Magazine, The Art Queens Society, host of the Art & Cocktails Podcast and co-author of The Complete Smartist Guide and The Creative Business Handbook. Popova is an artist who believes that our entire life is a canvas and we have the power to create anything we desire. Her mission is to empower artists and give them the tools to take responsibility for their own career and find validation and success from within. Popova spent the past decade growing her painting practice and focusing on depicting the interior in a series of lush and colorful paintings. These works helped her explore and heal her relationship with the idea of home, which carries a wide array of emotions for humans, especially immigrants. The works have been recognized, exhibited, and published internationally.\\nAlicia Puig is the curator & co-founder of PxP Contemporary, Director of Business Operations for Create! Magazine, an arts writer, frequent guest host of The Create! Podcast, and co-author of The Complete Smartist Guide and The Creative Business Handbook. She has worked in the arts industry for galleries, museums, art fairs, private collectors, art publications, and an auction house for over ten years both in the US and abroad. You can find Alicias writing featured in magazines and on blogs including Create! Magazine, Beautiful Bizarre Magazine, All She Makes, CandyFloss Magazine, Art She Says, and Artspiel, among others. Additionally, Alicia has served as a guest curator for Hastings College, All She Makes, Create! Magazine, Rise Art, and SHOWFIELDS.\\nMarina Press Granger is the founder of The Artist Advisory, a New York City consulting firm that offers career guidance to visual artists, galleries, and art-minded businesses. Granger worked in the NYC galleries and museums for nearly 15 years before starting her company. She curated numerous gallery exhibitions and art fair booths during that time. In addition to using analytical business acumen acquired through years of experience and a BA & MA in Art History, Granger also uses the Principles of Classical Chinese Feng Shui to enhance the success of the artists and businesses she works with. You may read about Marina Granger and The Artist Advisory in Forbes, The Art Gorgeous, The Art Zealous, Time Out New York, and more. Granger was born in Kyiv, Ukraine, and has lived in New York since 1991.\\nLiza Zhurkovskaya, aka Curator on the Go, is a Toronto-based curator & art advisor. For more than eight years, Liza worked directly with artists helping them make a living through their creative work. In 2020, Liza founded Kefi Art Gallery to support her artists and assist her corporate and private clients with acquiring original art and curating their collections. Liza is known as a community leader who has brought hundreds of artworks to the public eye. Her goal is to support artists while reminding everyone that art is part of a healthy community  and a healthy mind, body and soul.\\nPRIZES \\nIn addition to selecting a wide range of artists to be featured in our virtual exhibition, our team will award special prizes to a select number of artists.\\nArtist interview courtesy of Ekaterina Popova\\nExclusive feature on the Create! Magazine blog courtesy of Alicia Puig\\nSocial media highlight courtesy of Marina Press Granger\\nInstagram review & feedback courtesy of Liza Zhurkovskaya\\nAdditional info:\\nYou may submit 1-2 images of your work for $25, 3-4 images for $30, or 5-6 images for $35.\\nYou do not need to include the dates of artwork that you submit.\\nWork does not have to be for sale to be included in this exhibit. We include work that is for sale, along with work that is not available.\\nRequirements:\\nPlease be sure to include high-quality images of your work, 72 DPI, minimum 800 pixels wide\\nAll images must be cropped to show only the artwork (with the exception of 3D work)\\nBio, 300 words max\\nArtist Statement, 300 words max\\nFiles no larger than 10 MB\\nOur virtual exhibitions are presented to our website visionaryartcollective.com\\nAll communication regarding this exhibition will take place via Submittable. Artists will be notified within 4-6 weeks after the deadline.\\nThis exhibition will be presented in October 2025.\\nVisionary Art Collectives mission is to connect contemporary art with education. The submission fees we receive go towards funding our platform, and enable us to continue providing opportunities and free educational resources to artists and educators around the world.",
        "topics_EN": [
            "Women Artists' Voices",
            "Contemporary Women's Art",
            "Gender and Identity",
            "Global/International Perspectives",
            "Creative Empowerment and Recognition"
        ],
        "fees": "1-2 images: $25; 3-4 images: $30; 5-6 images: $35",
        "requirement": "Open to women artists worldwide, 18+. Accepts 2D and 3D works (no film/video). Submit 1–6 images (fee tier applies). Image specs: 72 DPI minimum, at least 800 px wide, cropped to show artwork (except 3D), files ≤10 MB. Provide bio (≤300 words) and artist statement (≤300 words). Submissions via Submittable; virtual exhibition presented October 2025."
    },
    {
        "title": "CALL TO ARTISTS: Abstract Intentions - Temporary, Artist Calls",
        "organization": "SACRAMENTO FINE ARTS CENTER",
        "location": "California",
        "deadline": "10/01/2025",
        "url": "https://arts.ca.gov/collective/sacramento-fine-arts-center-231-4-call-to-artists-abstract-intentions/",
        "description": "About this exhibit: Abstract art uses shape, form, color and line to create a composition which may exist with degrees of independence from visual references in the world. We welcome all media to join this exciting exhibition.",
        "topics_EN": [
            "Abstract Art",
            "Non-Representational Composition",
            "Color and Form",
            "Shape and Line",
            "Formal Elements and Composition"
        ],
        "fees": "$0",
        "requirement": "Open to all artists; all media accepted. Works should be abstract/non-representational, emphasizing shape, form, color, and line. No location, size limits, originality, or other submission rules specified in the call."
    },
    {
        "title": "2727 Artist Co-Op Membership Opportunity 2025 - Freelance, Artist Calls",
        "organization": "Gallery 2727",
        "location": "SF Bay Area",
        "deadline": "09/01/2025",
        "url": "https://arts.ca.gov/collective/gallery-2727-245-5-2727-artist-co-op-membership-opportunity-2025/",
        "description": "The 2727 Artist Co-op is now accepting applications from innovative Bay-Area artists with diverse perspectives, styles, and mediums. We value the power of art to drive positive change in our local communities and cant wait to see how youll contribute to our vibrant cohort! Artists of all experience levels are welcome to apply.\\nApplications are open until September 1, 2025.\\nTake the first step towards amplifying your artistic voice  find the application and more info on our website at\\n2727.today/gallery2727\\n.\\nAbout the 2727 Artist Co-op:\\nWere a collective hub where emerging artists and under-represented voices come together to exhibit, grow, and inspire at 2727 California St. Member artists collaborate show work, develop their art profession, and engage their communities with art-making.",
        "topics_EN": [
            "Community Engagement",
            "Positive Social Impact",
            "Diversity and Inclusion",
            "Underrepresented Voices",
            "Emerging Artist Development"
        ],
        "fees": "$0",
        "requirement": "Open to Bay‑Area artists (location unspecified beyond 'Bay-Area'). Artists of all experience levels and all media/styles are welcome; applicants should present innovative work and diverse perspectives. Application deadline: September 1, 2025. No application fee mentioned."
    },
    {
        "title": " SUMMER * $1,800.00 Innovate Grants for Art + Photo - Temporary, Artist Calls / Grants",
        "organization": "Innovate Grant",
        "location": "International",
        "deadline": "09/11/2025",
        "url": "https://arts.ca.gov/collective/innovate-grant-235-4-%e2%98%80%ef%b8%8f-summer-1800-00-innovate-grants-for-art-photo/",
        "description": "SUMMER 2025 OPEN FOR SUBMISSIONS  Innovate Grant is thrilled to introduce our newly increased award amounts of $1,800.00.\\nInnovate Grant awards (2) $1,800.00 grants each quarter, to one Visual Artist and one Photographer. In addition, (12) honorable mentions (6 in art and 6 in photo), will be featured on our website and join a growing community of vibrant and talented artists. Innovate Grants commitment extends beyond the grant cycle by promoting the work of selected winners and honorable mentions into the future. For more information and to apply visit https://innovateartistgrants.org\\nInnovate Grant supports artists and photographers through quarterly grants. Weve simplified the grant process, so that artists and photographers can focus on making their innovative work. The work should speak for itself and our application reflects that.\\nInnovate Grant awards:\\n+ 1 x $1,800.00 Grant to a Visual Artist\\n+ 1 x $1,800.00 Grant to a Photographer\\n+ 12 x Honorable Mentions\\nExplore the work of ALL Past Innovate Grant recipients and read their interviews at https://innovateartistgrants.org\\nHow to Apply: Visual Artists and Photographers 18 years and older, from all around the world, are eligible to apply. All media and genres are accepted. All applicants retain the right to the work they submit. Apply today at https://innovateartistgrants.org\\nCategory: Multiple disciplines and genres accepted\\nDeadline:  Wednesday, September 10, 2025  Submit by 11:59PM Pacific Standard Time\\nRegion: US & International\\nAwards: 2 x $1,800.00 USD Grants // 12 x Honorable Mentions\\nApply Online Today\\nhttps://innovateartistgrants.org",
        "topics_EN": [
            "Any"
        ],
        "fees": "$0",
        "requirement": "Open to visual artists and photographers worldwide, ages 18+. All media and genres accepted; no size limits specified. Applicants retain rights to submitted work. Originality requirement not specified. Deadline: Sept 10, 2025 (11:59 PM PST)."
    },
    {
        "title": "Faces Art Contest - Temporary, Artist Calls",
        "organization": "Grey Cube Gallery",
        "location": "International",
        "deadline": "09/05/2025",
        "url": "https://arts.ca.gov/collective/grey-cube-gallery-235-4-faces-art-contest-3/",
        "description": "Grey Cube Gallery proudly presents the fifth Floral online art contest for the month of September 2025. Artists from around the world are welcome to submit. The gallery invites artists and photographers to share their artistic vision using any work with interpretation of botanical and floral art (flowers, herbs, fruit, leaves, plants and related floral subcjects). All visual art mediums (except video and sound) are allowed. Winning artwork (Best of Show) will be on the poster of the show. All winning artists will receive a digital award certificate. The deadline to submit entries is the September 04, 2025.",
        "topics_EN": [
            "Botanical and Floral Art",
            "Flowers",
            "Herbs",
            "Fruit",
            "Leaves",
            "Plants",
            "Botanical Interpretation"
        ],
        "fees": "$0",
        "requirement": "Open to artists and photographers worldwide; online submissions. Artwork must interpret botanical/floral subjects (flowers, herbs, fruit, leaves, plants). All visual media accepted except video and sound. No size limits specified. Originality requirement not stated. Deadline: Sept 04, 2025. Winning work may be used on the show poster; winners receive digital certificates."
    },
    {
        "title": "2025 Juried Fine Art - Temporary, Artist Calls",
        "organization": "City of Laguna Beach",
        "location": "Orange",
        "deadline": "09/01/2025",
        "url": "https://arts.ca.gov/collective/city-of-laguna-beach-241-4-2025-juried-fine-art/",
        "description": "City of Laguna Beach  2025 Juried Fine Art\\nCLICK HERE\\nfor complete program guidelines.\\nHonorarium:\\n1st Place $1,200; 2nd Place $600; and 3rd Place $300\\nEligibility:\\nOpen to all Orange County artists 18 years of age or older. Work must be original and executed within the past two (2) years. Work must not have been previously exhibited at City Hall. Entry in this exhibit establishes an agreement on the part of the artist to all conditions listed in the prospectus. City employees, including those compensated for City Council, Board or Commission positions, are not eligible to apply.\\nMedia:\\nTwo-dimensional art works measuring no more than 48(h) x 36(w) framed.\\nEntry Fee:\\nA non-refundable entry fee of $25 allows for up to three (3) entries.\\nImportant Dates:\\nMon., September 1, 2025-            11:59 p.m. deadline to submit images to\\nhttps://lagunabeachcity.slideroom.com\\nWed., September 10, 2025-          Notification e-mailed to all entrants.\\nSun., September 21, 2025-            Deliver selected artwork to City Hall between 9:00 and 10:30 a.m.\\nThurs., November 6, 2025-           Reception and Awards Announcement between 6:00 and 7:00 p.m.\\nFri., November 14, 2025-              Artwork pick-up between 9:00 and 11:00 a.m.\\nExhibition Dates: September 21  November 14, 2025\\nJuror:\\nTBA\\nEntry Procedures:\\nSubmit up to three (3) pieces by registering and uploading images at\\nhttps://lagunabeachcity.slideroom.com\\n. Payments made on a secure server with any major credit card.\\nCondition of Entries:\\nAll work must be completely dry, framed, wired and ready for hanging, or otherwise suitably prepared for exhibition. Sawtooth hangers will not be accepted (see hanging guidelines on pg. 2). The City of Laguna Beach Cultural Arts Department, Arts Commission and appointed exhibition juror(s) retain the right to reject any submissions that do not fit the guidelines and/or the spirit of the exhibition or that may be deemed inappropriate.\\nContact:\\nMichael McGregor, Arts Program Coordinator, (949) 497-0743 or\\nmmcgregor@lagunabeachcity.net\\nThis program is funded by the lodging establishments and City of Laguna Beach.",
        "topics_EN": [
            "Any"
        ],
        "fees": "$25",
        "requirement": "Open to Orange County artists 18 years or older. Artwork must be original, executed within the past two years, and not previously exhibited at Laguna Beach City Hall. Two-dimensional framed works no larger than 48 inches high x 36 inches wide. Work must be completely dry, framed, wired and ready for hanging (no sawtooth hangers). City employees are ineligible. Non-refundable entry fee $25 allows up to three entries."
    },
    {
        "title": "Yellow Online Juried Art Competition - Temporary, Artist Calls",
        "organization": "Ten Moir Gallery",
        "location": "International",
        "deadline": "10/01/2025",
        "url": "https://arts.ca.gov/collective/ten-moir-gallery-235-4-yellow-online-juried-art-competition/",
        "description": "Open Worldwide: All mediums, styles, and backgrounds accepted. Must be 18yrs or older\\nFees: $24 for 3 images or $45 for 6 images\\nDeadline: October 1st, 2025\\nApply using the online form.\\nhttps://tenmoirgallery.com/yellow-online-art-competition-and-exhibition\\nAre you ready to capture the essence of Yellow? We invite talented artists and photographers to participate in our Yellow Online Art Competition. This is your chance to explore the myriad shades and meanings of yellow, from the warmth of the sun to the vibrancy of blooming flowers, and present your unique interpretation.\\nDeadline: October 1st, 2025\\nWith a potential to win $700 in cash prizes, this is an opportunity not to be missed! The Best in Show award offers a $150 cash prize, a solo exhibition, and extensive promotion. Plus, entry automatically qualifies you for the Blu Sky Artist Award, with a chance to win $500!",
        "topics_EN": [
            "Yellow (color and its meanings)",
            "Color symbolism",
            "Light and warmth (sun)",
            "Nature — flowers and growth",
            "Vibrancy, energy, and mood",
            "Chromatic/color study"
        ],
        "fees": "$24 for 3 images or $45 for 6 images",
        "requirement": "Open to artists worldwide, 18 years or older. All mediums, styles, and backgrounds accepted. Entry fees: $24 for 3 images or $45 for 6 images. Submit via the online form by October 1, 2025. No size limits or explicit originality requirement specified in the call."
    },
    {
        "title": "Call for Art-GIVE ME FIVE - Temporary, Artist Calls",
        "organization": "Art Fluent",
        "location": "International",
        "deadline": "10/31/2025",
        "url": "https://arts.ca.gov/collective/art-fluent-235-4-call-for-art-give-me-five/",
        "description": "Art Fluent invites artists worldwide to submit a series of artwork to our online exhibit, GIVE ME FIVE.\\nTHEME\\nAF is turning 5, and we want your five! Five pieces. One vision. Were curating a lineup of mini collections, and yours could be one of them. Five pieces that reflect an intentional, cohesive series that showcases your unique style. Think of it as a mini solo show within a group celebration. Show us GIVE ME FIVE from your perspective.\\nCALENDAR\\nJPEGs due by Friday, October 31, 2025 at midnight MST.\\nNotification of acceptance and online gallery opening by Friday, November 28, 2025.\\nAWARDS\\nAll accepted artists will have their series displayed in our online gallery at www.art-fluent.com and will receive a cash prize of $250 each.\\nENTRY FEE\\n$35. Payment is non-refundable and does not guarantee acceptance.\\nELIGIBILITY\\nThis call is open to artists worldwide, both amateur and professional.\\nRULES\\nYoull be asked to submit exactly five pieces as a cohesive body of work, along with an artist statement. This call is intended to highlight a concise, curated selection that reflects your distinct artistic voice. Please note:\\n        Submissions must include five works. Applications with fewer than five pieces will not be considered.\\n        Applications are reviewed based on a body of work. Your work will be judged as a whole, not individually, all media are submitted into one application.\\n        Work that is copied or done under the guidance of an instructor is not eligible.\\nOpen to ALL fine art mediums (oil, acrylic, watermedia, pastel, drawing, printmaking, mixed media, photography, sculpture, fiber, wood, ceramics, film/video, digital art). AI will not be accepted. Diptychs and triptychs should be uploaded as a single image.\\nSELECTION PROCESS\\nDirectors choice. Each show is curated and juried by Creative Director, Amy Matteson Neill along with an anonymous committee of jurors. Please note, there is no personal feedback given by jurors.\\nENTRY PROCEDURE\\nEntry is done through CaF, a web-based service that allows artists to upload images and organize their artwork for submissions to galleries. To apply for a call, you must leave our website and go to the CaF website at www.callforentry.org where you can create a FREE artist account. You will add your details and upload your images to CaF and then you can submit work to GIVE ME FIVE. If you have any questions, please contact us at hello@art-fluent.com we are happy to walk you through the process.\\nMEDIA PREPARATION\\nPlease only submit properly cropped images of your work that are in focus. We have a free resource for artists for tips on how to get high quality images of your work. Visit www.art-fluent.com/resources for a free download. CaF also offers tips on their blog which you can find here www.callforentry.org/photographing-artwork/.\\nAll images must be in JPEG/JPG format using CaF guidelines. The image size must be 1,200 pixels or greater on the longest side. Maximum file size is 5 mb.\\nAccepted video formats include MOV, MP4, WMV. Aspect ratio 4:3 or 16:9, resolution minimum 640480, maximum 1920 x1080, bit rate recommended above 240 kbps, recommended frame rate 30 fps. File size must be under 100 MB. If your video work has been selected for the exhibit, we kindly request that you provide us with the file link via Vimeo. Please ensure the linked video is set to be shared publicly. Your video will not play if it is set to private.\\nNOTIFICATION\\nNotification will be done by email, everyone who submits will be notified of the jurors selections. If for any reason you do not hear from us by the notification date, please check the filters in your email account. Notification emails are sent to the email on file with CaF.\\nSALES\\nAll sales inquiries will be directed to the artists website and/or contact information. For any artwork that is sold, the artists receive 100% of the sale.\\nGIVING BACK\\nA portion of the proceeds from the entry fees is donated to organizations committed to the arts and supporting artists.\\nREGULATIONS\\nBy entering our calls for art through CaF you are agreeing to be added to Art Fluents email list for forthcoming artist opportunities. By submitting images, you agree that the images are your own work, nothing copied, you own all rights to the images, and you take full responsibility for the content of all images, including the likeness of recognizable individuals. The actual artwork will remain the property of the artist, our mission is to promote artists and their work. Should your work be accepted, you grant Art Fluent the right to reproduce your image on our website, on social media, and where appropriate to help promote further online opportunities. Art Fluent will always credit you and your copyright wherever feasible. We will not use your image for any other purpose without the artists permission.",
        "topics_EN": [
            "Five-piece cohesive series",
            "Artist's unique perspective / voice",
            "Mini solo-show (concise curated selection)",
            "5th anniversary / celebration"
        ],
        "fees": "$35",
        "requirement": "Open to artists worldwide (amateur and professional). Must submit exactly five original works presented as a cohesive body; copied or instructor-guided work and AI-generated work are ineligible. All fine-art media accepted. Submit via CaF with JPEG/JPG images (minimum 1200 px on longest side, max 5 MB); video entries must meet stated format/resolution/size limits. $35 non-refundable entry fee."
    },
    {
        "title": "Let Me Eat Cake, Please! - Temporary, Artist Calls",
        "organization": "Shoebox Arts",
        "location": "National",
        "deadline": "09/12/2025",
        "url": "https://arts.ca.gov/collective/shoebox-arts-238-4-let-me-eat-cake-please/",
        "description": "Shoebox Arts invites you to submit work for this national open call exhibition at Shoebox at the Brewery, our alternative art space in the Brewery Arts Complex.\\nWere Coming Back for Thirds!\\nAfter successful exhibitions at PST Gallery and Blue Roof Studios, Let Me Eat Cake, Please! returns for its third deliciously subversive iteration.\\nWe will transform the gallery into a feast for the eyes  walls covered floor to ceiling with food art that celebrates sweetness, indulgence, and culinary pleasure. This immersive environment tells stories about hunger, satisfaction, comfort, and joy through the lens of desserts, treats, and culinary delights. Picture Think Baroque abundance meets contemporary food art!\\nThis exhibition will coincide with the Brewerys October 2025 artwalk. The Brewery Lofts are home to over 500 working artists, drawing over 10K visitors to each artwalk.  The gallery will be open to the public during artwalk hours and by appointment.\\nFor details and to apply at CaFE:\\nhttps://artist.callforentry.org/festivals_unique_info.php?ID=15790",
        "topics_EN": [
            "Desserts and Culinary Delight",
            "Sweetness and Indulgence",
            "Hunger and Satisfaction",
            "Comfort and Joy",
            "Abundance and Excess",
            "Food as Storytelling",
            "Contemporary Food Art"
        ],
        "fees": "$0",
        "requirement": "National open call (artists nationwide). Artwork should respond to desserts/food/culinary themes and be suitable for an immersive, wall-to-wall gallery installation at Shoebox at the Brewery (Brewery Arts Complex) during the Brewery October 2025 artwalk. No size limits or originality requirements are specified in the posted text; applicants apply via CaFÉ."
    },
    {
        "title": "GEOGRAPHIES: An Exploration Between Places, Environments and Cultures - Temporary, Artist Calls",
        "organization": "LoosenArt",
        "location": "International",
        "deadline": "12/19/2025",
        "url": "https://arts.ca.gov/collective/loosenart-235-4-geographies-an-exploration-between-places-environments-and-cultures/",
        "description": "GEOGRAPHIES: An Exploration Between Places, Environments and Cultures\\nFree entryCall for Exhibition\\nPhotographers are invited to submit 1 up to 3 photos addressing the theme.\\nGroup Exhibition in Rome. March 2026\\n\\nLoosenArt is inviting photographers to take part in the collective exhibition Geographies: an exploration between places, environments and cultures, an exhibition project that seeks to question and narrate the many forms of contemporary geography: physical and symbolic, human and environmental, local and global.\\nThe aim is to explore borders  geographical, cultural, political, and emotional  and their transformations through the creative gaze of participants.\\n\\nSubmissions  http://bit.ly/loosenartcalls\\nDeadline: December 19th, 2025",
        "topics_EN": [
            "Places and Environments",
            "Cultural Exchange",
            "Physical and Symbolic Geography",
            "Borders (geographical, cultural, political)",
            "Emotional Boundaries",
            "Human–Environment Relationships",
            "Local vs Global Perspectives"
        ],
        "fees": "$0",
        "requirement": "Open to photographers (no residency restriction specified). Submit 1–3 photographs addressing the theme of 'Geographies'; selected works will be included in a group exhibition in Rome (March 2026). Free entry; deadline Dec 19, 2025. No size, format, or originality rules are specified in the call."
    },
    {
        "title": "Call for Submissions: Two-Dimensional Temporary Public Art Installation - Freelance, Artist Calls",
        "organization": "Rochester Contemporary Art Center",
        "location": "Other",
        "deadline": "09/15/2025",
        "url": "https://arts.ca.gov/collective/rochester-contemporary-art-center-242-5-call-for-submissions-two-dimensional-temporary-public-art-installation/",
        "description": "Rochester Contemporary Art Center invites artists to propose three images for a temporary public art installation on site outside RoCo. Through this call for art we aim to offer a simple submission process for incisive, surprising, and unique imagery that will enliven the East Avenue neighborhood. Of particular interest are projects that connect visitors to the location, community and/or history of the neighborhood, challenge visitors and passersby, and address important social and political issues. RoCo welcomes visual artists of all genres, and also invites visual artists to collaborate with literary artists as we have previously shown in this location.\\nThe selected series of three images will be exhibited to the public 24/7 for 4-6 months. The duration will be determined with RoCo staff based on the season and concept of the project. The images will be printed on a weather-safe material at about 9 h x 6 w. Selected projects will require the following resolution: 12,000 px (h) x 8,000 px (w). The artist will receive a $400 stipend & use fee for exhibiting preexisting images. If an artist is interested in creating new works for this submission, please contact us. All production and installation costs are covered by RoCo.",
        "topics_EN": [
            "Connection to Location and Neighborhood",
            "Community and Neighborhood History",
            "Public Engagement and Interaction",
            "Social and Political Issues",
            "Challenging or Provocative Imagery",
            "Artist and Literary Collaboration",
            "Site-Specific Public Art"
        ],
        "fees": "$0",
        "requirement": "Open to visual artists of all genres (no location restriction stated). Submit a series of three images for an outdoor public installation; images will be printed at approximately 9\"h x 6\"w and must meet the resolution requirement of 12,000 px (h) x 8,000 px (w). Selected work will be exhibited 24/7 for 4–6 months; RoCo covers production and installation. $400 stipend/use fee for exhibiting preexisting images. Artists may collaborate with literary artists; contact RoCo if proposing newly created works."
    },
    {
        "title": "Wonderful World International Art Competition - Temporary, Artist Calls",
        "organization": "Blue Koi Gallery",
        "location": "International",
        "deadline": "10/01/2025",
        "url": "https://arts.ca.gov/collective/blue-koi-gallery-235-4-wonderful-world-international-art-competition/",
        "description": "The Wonderful World theme invites artists to explore the magic, mystery, and marvels of the world. From the quiet strength of wildlife and the colors of blooming ecosystems to the vastness of planets and the rhythms of Earth itself.  This theme calls for artwork that honors our connection with nature. All mediums accepted, traditional art, mixed media, digital art, sculpture and photography.\\nWin $500 worth of prizes and Cash Award | Social Media Promotion | Email to Galleries, Art Admirers & Collectors | Certificate. All Winners: Featured in the Blue Koi Online Art Exhibition alongside the worlds best contemporary artists. Honorable Mentions & Finalists: Certificates and recognition.\\nGroup: Exhibition.\\nSubmission Deadline: September 30, 2025\\nEntry Fee: $20 for 4 images\\nSubmit your work here: https://koisartistaward.com/wonderful-world-art-competition/",
        "topics_EN": [
            "Connection with Nature",
            "Wildlife",
            "Blooming Ecosystems / Plant Life",
            "Planetary Vistas / Vastness of Planets",
            "Earth's Rhythms and Landscapes",
            "Magic, Mystery, and Wonder of the World"
        ],
        "fees": "$20 for 4 images",
        "requirement": "Open to artists (no location restriction stated). All mediums accepted (traditional, mixed media, digital, sculpture, photography). Submit up to 4 images for a $20 fee by Sept 30, 2025. Artwork should explore/celebrate the natural world and our connection to it. No size limits, originality, or other technical restrictions specified in the call."
    },
    {
        "title": "Nests - Freelance, Artist Calls",
        "organization": "S.C.R.A.P. Gallery",
        "location": "Western States",
        "deadline": "10/19/2025",
        "url": "https://arts.ca.gov/collective/s-c-r-a-p-gallery-248-5-nests/",
        "description": "Not limited to just birds, nests are structures that provide shelter for a wide range of animals, including insects, fish, amphibians, mammals, turtles, lizards, snakes, and other reptiles. Nests are structures for shelter. Artists are invited to create 2D or 3D works that are inspired by the concept or nature of nests.\\nArtists should consider a variety of natural, recycled, or repurposed materials for the artwork. This exhibit will be on view through January 2026 at the S.C.R.A.P. Gallery E-Box in Cathedral City, California.\\nThe E-Box is an environmental experience in an unlikely space, a reclaimed 20 shipping container. The E-Box is curated by S.C.R.A.P. Gallery (Student Creative Recycle Art Program) and CVAP (Coachella Valley Art Projects).",
        "topics_EN": [
            "Nests and Shelter",
            "Animal Habitats",
            "Biodiversity / Multiple Species",
            "Environmental / Ecological Themes",
            "Recycled and Repurposed Materials",
            "Structure, Construction, and Home"
        ],
        "fees": "$0",
        "requirement": "Open to all artists. Accepting 2D or 3D works inspired by the concept or nature of nests; artists encouraged to use natural, recycled, or repurposed materials. Exhibit is in Cathedral City, California at the S.C.R.A.P. Gallery E-Box (a reclaimed 20' shipping container) and will be on view through January 2026. No application fee stated. No explicit size limits or originality requirement provided—works must be suitable to fit the E-Box gallery space."
    },
    {
        "title": "Open Theme Art competition - Temporary, Artist Calls",
        "organization": "Blue Koi Gallery",
        "location": "International",
        "deadline": "10/01/2025",
        "url": "https://arts.ca.gov/collective/blue-koi-gallery-235-4-open-theme-art-competition/",
        "description": "Let your creativity run wild with the Open Theme competition! There are no limits to your imagination, whether you work in traditional art, mixed media, digital art, sculpture, or photography, this competition is an opportunity to showcase your unique vision in any style or subject matter. Take the stage and share your finest work with the world!\\nWin $500 worth of prizes and Cash Award | Social Media Promotion | Email to Galleries, Art Admirers & Collectors | Certificate\\nAll Winners: Featured in the Blue Koi Online Art Exhibition alongside the worlds best contemporary artists.\\nHonorable Mentions & Finalists: Certificates and recognition for exceptional talent.\\nAll Participants: Group Exhibition.\\nSubmission Deadline: September 30, 2025\\nEntry Fee: $20 for 4 images, $35 for 6 images.\\nSubmit your work here: https://koisartistaward.com/open-theme/",
        "topics_EN": [
            "Any"
        ],
        "fees": "$20 for 4 images, $35 for 6 images",
        "requirement": "Open to all artists; any medium, style, or subject (open theme). No location, size limits, or originality rules are specified in the call. Entry fee: $20 for 4 images or $35 for 6 images. Submission deadline: September 30, 2025."
    },
    {
        "title": "Revelations - Temporary, Artist Calls",
        "organization": "LoosenArt",
        "location": "International",
        "deadline": "11/17/2025",
        "url": "https://arts.ca.gov/collective/loosenart-235-4-revelations/",
        "description": "REVELATIONS\\nFree entryCall for Exhibition\\nPhotographers are invited to submit 1 up to 3 photos addressing the theme.\\nGroup Exhibition in Rome. February 2026\\n\\nEvery work of art is a revelation: of itself, of the world, of others.\\nWhat does it mean, nowadays, to reveal? What emerges when you look more deeply, listen better, pierce the veil of appearances?\\nThe collective exhibition Revelations will investigate the concept of revelation as a moment of truth, insight or unveiling. At a time when appearance often subdues substance, to reveal means to go beyond, to bare, to bring light into shadow.\\nThe call is open to photographers who want to confront this theme through works that explore revelation as a visual, narrative, symbolic or emotional act, capable of suggesting, denouncing, moving, or simply provoking thought.\\n\\nSubmissions  http://bit.ly/loosenartcalls\\nDeadline: November 16th, 2025",
        "topics_EN": [
            "Revelation",
            "Truth and Insight",
            "Unveiling/Exposure",
            "Seeing Beyond Appearances",
            "Light and Shadow",
            "Emotional and Symbolic Revelation"
        ],
        "fees": "$0",
        "requirement": "Open to photographers (no residency restriction specified). Submit 1–3 photographs addressing the theme of revelation (visual, narrative, symbolic or emotional). Group exhibition in Rome (Feb 2026). No size limits or originality requirements specified; free entry."
    },
    {
        "title": "The Elements Art Competition & Exhibition\n - Temporary, Artist Calls",
        "organization": "Ten Moir Gallery",
        "location": "International",
        "deadline": "10/01/2025",
        "url": "https://arts.ca.gov/collective/ten-moir-gallery-235-4-the-elements-art-competition-exhibition/",
        "description": "Earth. Water. Fire. Air. These ancient forces shape our world and stir the imagination. The Elements invites artists to explore these primal energies in all their forms: physical, symbolic, and emotional. Whether you focus on one element or the harmony between them, this theme invites a return to the foundation of life through your creative voice.\\nEligibility:\\nOpen to artists 18 and older worldwide\\nAll visual mediums accepted: painting, photography, sculpture, digital art, textile, mixed media, etc.\\nOpen to both emerging and established artists\\nAwards and Recognition\\nBest in Show: $150 cash prize, cover feature, newsletter spotlight, social media promotion + free entry to the $500 Blu Sky Artist Award\\n1st Place: $50 cash prize + free Blu Sky Award entry + features\\n2nd & 3rd Place: Free Blu Sky Award entry + social features\\nHonorable Mentions & Finalists: Selected for the curated online exhibition and promoted across Ten Moir Gallery platforms\\nEntry Fee: $24 for up to 3 images / $45 for up to 6 images\\nDeadline\\n: September 30, 2025\\nApply Here:\\nhttps://tenmoirgallery.com/the-elements-2025-online-art-competition/",
        "topics_EN": [
            "Earth",
            "Water",
            "Fire",
            "Air",
            "Elemental Forces",
            "Nature and the Natural World",
            "Symbolism and Mythic Meaning",
            "Emotional and Spiritual Responses",
            "Harmony/Interaction of Elements",
            "Foundations of Life"
        ],
        "fees": "$24 (up to 3 images) / $45 (up to 6 images)",
        "requirement": "Open to artists 18 and older worldwide. All visual media accepted (painting, photography, sculpture, digital art, textile, mixed media, etc.). Open to emerging and established artists. No size limits stated. Entry fee: $24 for up to 3 images or $45 for up to 6 images. Deadline: September 30, 2025."
    },
    {
        "title": "Pieces For Peace 2025 - Temporary, Artist Calls",
        "organization": "S.C.R.A.P. Gallery",
        "location": "Western States",
        "deadline": "09/16/2025",
        "url": "https://arts.ca.gov/collective/s-c-r-a-p-gallery-248-4-pieces-for-peace-2025/",
        "description": "THEME: ACT NOW FOR PEACE\\nS.C.R.A.P. Gallery is partnering with the Cathedral City Peace Initiative to host Pieces For Peace, an exhibition observing the United Nations International Day of Peace. The exhibition will be held at the Cathedral City Senior Center on September 21, 2025.\\nELIGIBILITY\\nThis call is open to all artists and students, encouraging them to consider their role and contribution to cultivating peace. Accepted media and materials include painting, prints, sculpture, photography, and mixed media. Recycled and repurposed materials are enthusiastically encouraged.",
        "topics_EN": [
            "Peacebuilding / Cultivating Peace",
            "International Day of Peace",
            "Act Now / Call to Action for Peace",
            "Community Healing and Engagement",
            "Sustainability and Reuse (recycled/repurposed materials)"
        ],
        "fees": "$0",
        "requirement": "Open to all artists and students. Works accepted: painting, prints, sculpture, photography, mixed media; recycled/repurposed materials encouraged. Exhibition takes place at the Cathedral City Senior Center on Sept 21, 2025 (Cathedral City, CA). No size limits or explicit originality requirement specified in the call."
    },
    {
        "title": "Opulent Mobility 2025 call for art - Temporary, Artist Calls",
        "organization": "Opulent Mobility",
        "location": "Los Angeles",
        "deadline": "09/01/2025",
        "url": "https://arts.ca.gov/collective/opulent-mobility-236-4-opulent-mobility-2025-call-for-art/",
        "description": "Opulent Mobility\\nchallenges you to imagine a world where disability, mobility, and access are not merely functional, but opulent. Share your art that re-imagines disability as opulent and powerful!\\nThese international exhibits are curated by Anthony Tusler and A. Laura Brody, and we look forward to celebrating our official tenth anniversary with you. We accept 2-D and sculptural work, music files, and performances on digital media. Early deadline to submit work is July 31, final deadline August 31, and artists will be notified mid September. The show will run December 4-28 at the\\nLos Angeles Makery\\nand online at opulentmobility.com.\\nA flat $20 fee covers administrative costs, and artists may share up to 10 works each. Please contact the founder A. Laura Brody if the fee causes hardship.\\nAccessibility features: art descriptions in text and in audio files, ASL interpreters at the online artist talk, artists may submit digital files instead of shipping artworks, and submissions may be sent either through the online form or directly to the founder. Use the contact page on the website for more assistance.\\nThank you for re-imagining disability with us!",
        "topics_EN": [
            "Disability",
            "Mobility",
            "Access",
            "Opulence",
            "Disability Empowerment",
            "Accessible Design"
        ],
        "fees": "$20",
        "requirement": "Open to international artists. Accepts 2-D and sculptural work, music files, and performances on digital media. Artists may submit up to 10 works. $20 flat application fee (contact founder for hardship). Digital submissions accepted instead of shipping; submit via the online form or directly to the founder. No size limits or originality requirements specified."
    },
    {
        "title": "Women United ART PRIZE 2025 - Freelance, Artist Calls",
        "organization": "Women United ART MOVEMENT",
        "location": "International",
        "deadline": "09/16/2025",
        "url": "https://arts.ca.gov/collective/women-united-art-movement-235-5-women-united-art-prize-2025/",
        "description": "Women United ART PRIZE is a renowned international award designed to celebrate, empower, and elevate the artistic contributions of women-identifying artists from across the globe. Now in its milestone 5th year, this award stands as a powerful platform for visibility, recognition, and career transformation  honoring the creativity, passion, and innovation that women bring to the arts.\\nOpen to women artists worldwide, the prize recognizes 30 exceptional creatives working in:\\nPAINTING & DRAWING\\nPHOTOGRAPHY & PRINTMAKING\\nCOLLAGE & FIBER ART\\nPRIZES\\nOver EUR 27,000 in combined value including cash awards, professional services, publication features, coaching, subscriptions, and visibility opportunities\\nJURORS\\nAshara Shapiro  multidisciplinary artist, educator, and founder of ArtWRKD, a vibrant gallery and studio hub supporting emerging talent in Pennsylvania, US\\nLiz Lidgett  galleries, art advisor, founder of Liz Lidgett Gallery & Design, known for her accessible and inclusive approach to contemporary art collecting\\nMarryam Moma  award-winning collage artist of Tanzanian-Nigerian heritage whose work explores identity, memory, and empowerment through hand-cut mixed media\\nMona Lerch  visual artist, artist coach, editorial designer, and founder of Women United ART MOVEMENT, dedicated to raising the visibility of women artists\\nPARTNERS\\nThe Stackhouse  a fine art print studio dedicated to museum-quality prints and artist-first service\\nSmartist App  the top-rated art visualization app designed by artists, for artists\\nELIGIBILITY\\nOpen to all women-identifying artists from across the globe \\nat ANY career stage, with ANY education, and from ANY country.\\nSUBMISSION GUIDELINES\\nSubmit 2  5 artworks\\nFile format: JPG, PNG, or JPEG (min. 1000px wide; min. 72 DPI)\\nInclude your artist bio, statement, location, website, social media handles, and email address\\nIMPORTANT DATES\\nEarly Bird Deadline: 30 June 2025\\nRegular Entries Deadline: 31 August 2025\\nLast Minute Entries Deadline: 15 September 2025\\nFinal results announced: 30 November 2025\\nENTRY FEES\\nEarly Bird: EUR 8 per artwork (min. 2 artworks)\\nRegular Entries: EUR 9 per artwork (min. 2 artworks)\\nLast Minute Entries: EUR 10 per artwork (min. 2 artworks)\\nArtists interested in entering Women United ART PRIZE 2025 should submit their work through the following link: https://womenunitedartmovement.com/artprize2025",
        "topics_EN": [
            "Any"
        ],
        "fees": "Early Bird: EUR 8 per artwork (min. 2); Regular: EUR 9 per artwork (min. 2); Last Minute: EUR 10 per artwork (min. 2)",
        "requirement": "Open to women-identifying artists worldwide at any career stage. Submit 2–5 artworks (minimum 2 required). Image files JPG/PNG/JPEG, minimum 1000 px wide and 72 DPI. Include artist bio, statement, location, website, social media handles, and email. Entry fees charged per artwork as listed."
    },
    {
        "title": "Circle of Life Art Competition 2025 - Temporary, Artist Calls",
        "organization": "Ten Moir Gallery",
        "location": "International",
        "deadline": "09/01/2025",
        "url": "https://arts.ca.gov/collective/ten-moir-gallery-235-4-circle-of-life-art-competition-2025/",
        "description": "Circle of Life Art Competition 2025\\nOpen Worldwide: All mediums, styles, and backgrounds accepted.\\nFees: $24 for 3 images / $45 for 6 images\\nDeadline: August 30th, 2025\\nApply using the online form.\\nhttps://tenmoirgallery.com/circle-of-life-online-art-competition/\\nAre you ready to capture the essence of lifes journey? We invite talented artists and photographers to explore the profound rhythms of birth, life, decay, and rebirth through the theme Circle of Life. Interpretations can reflect the natural world, spirituality, human experience, and beyond. This is your chance to explore the myriad stages of life, from birth to growth, decay, and renewal, and present your unique interpretation.\\nBest in Show: $150 cash prize, cover feature, newsletter spotlight, social media promotion + free entry to the $500 Blu Sky Artist Award\\n1st Place: $50 cash prize + free Blu Sky Award entry + features\\n2nd & 3rd Place: Free Blu Sky Award entry + social features\\nHonorable Mentions & Finalists: Selected for the curated online exhibition and promoted across Ten Moir Gallery platforms\\nExhibition\\nAll selected works will be featured in our online gallery with artist name, artwork title, and medium. Winners announced after the deadline.\\nCopyright info: Your images will be used only for marketing, promotional, and display purposes for any show organized by Ten Moir Gallery. The artist shall retain all copyrights of any image they submit to Ten Moir Gallery.",
        "topics_EN": [
            "Circle of Life",
            "Birth and Beginnings",
            "Growth and Maturation",
            "Decay and Death",
            "Rebirth and Renewal",
            "Natural Cycles",
            "Spirituality",
            "Human Experience"
        ],
        "fees": "$24 for 3 images / $45 for 6 images",
        "requirement": "Open worldwide to artists and photographers; all media, styles, and backgrounds accepted. Submit digital images via the online form. No size limits or explicit originality requirement stated. Artists retain copyright but grant Ten Moir Gallery rights to use images for marketing, promotional, and display purposes."
    },
    {
        "title": "Call for Entry 2025 INTERSTATE National Juried Exhibition - Temporary, Artist Calls",
        "organization": "Central Washington University, Department of Art + Design",
        "location": "Western States",
        "deadline": "09/01/2025",
        "url": "https://arts.ca.gov/collective/central-washington-university-department-of-art-design-248-4-call-for-entry-2025-interstate-national-juried-exhibition/",
        "description": "The Sarah Spurgeon Gallery at Central Washington University, located in Ellensburg, Washington, will host the biennial INTERSTATE national juried exhibit. The exhibition is open to all media and subject matter; the artwork does not need to follow a particular theme. Proceeds from this national exhibition support student scholarships in the CWU Department of Art + Design. The juror for the 2025 INTERSTATE exhibition is Alexis L. Silva, Curatorial Assistant at the Frye Art Museum in Seattle, Washington.\\nThe exhibit is open to artists over the age of 18 working in 2-dimensional, 3-dimensional, and video formats. The entry fee is $35.00 for up to five artworks, and the deadline for entries is August 31, 2025. The awards include: First place, $700; second place, $500; third place, $300; and three honorable mentions.\\nTo read the complete prospectus and submit an entry please visit the CaFE website at this link:\\nhttps://artist.callforentry.org/festivals_unique_info.php?ID=15518",
        "topics_EN": [
            "Any"
        ],
        "fees": "$35.00",
        "requirement": "Open to artists aged 18 or older (national juried exhibition). Accepting 2D, 3D, and video works; no specific theme required. Entry fee $35 for up to five artworks. Deadline August 31, 2025. No size limits or originality requirement specified in the prospectus."
    },
    {
        "title": "Joshua Tree National Park Art Expo - Temporary, Artist Calls",
        "organization": "JTNP Council for the Arts",
        "location": "California",
        "deadline": "09/15/2025",
        "url": "https://arts.ca.gov/collective/jtnp-council-for-the-arts-231-4-joshua-tree-national-park-art-expo/",
        "description": "Call for Artists: The 13th annual JTNP Art Expo juried exhibition seeks artwork depicting or inspired by Joshua Tree National Park or its cultural history. Three art categories: 2-Dimensional, 3-Dimensional, Photography. Entry fee $35 for 3 artworks. Cash awards up to $4,000, publication in exhibition catalog, print and online, and exhibition at the historic 29 Palms Art Gallery for the month of November. Deadline for submitting entries is September 15, 2025.",
        "topics_EN": [
            "Joshua Tree National Park",
            "Desert Landscape and Ecology",
            "Cultural History of Joshua Tree",
            "Park-inspired/Nature Conservation"
        ],
        "fees": "$35",
        "requirement": "Open to artists (no residency restriction stated). Artwork must depict or be inspired by Joshua Tree National Park or its cultural history. Accepted categories: 2‑Dimensional, 3‑Dimensional, and Photography. Entry fee $35 covers up to three artworks. Deadline: September 15, 2025. No size limits or originality rules specified in the call."
    },
    {
        "title": "The Color Green Online Art Competition 2025 - Freelance, Artist Calls",
        "organization": "Ten Moir Gallery",
        "location": "International",
        "deadline": "09/02/2025",
        "url": "https://arts.ca.gov/collective/ten-moir-gallery-235-5-the-color-green-online-art-competition-2025/",
        "description": "The Color Green Online Art Competition 2025\\nOpen Worldwide: All mediums, styles, and backgrounds accepted.\\nFees: $24 for 3 images\\nDeadline: September 1st, 2025.\\nApply using the online form.\\nGreen Online Art Competition and Exhibition\\nFrom vibrant green landscapes to quiet forests, lush patterns to symbolic tones of growth, rebirth, envy, or peace; green can speak volumes. Whether it represents nature, emotion, culture, or something entirely personal, we want to see how you explore this powerful color.\\nSubmit your best artwork featuring green as a central color or concept. All mediums are welcome: painting, photography, sculpture, digital, fiber, mixed media, and beyond. This is an opportunity to showcase your unique interpretation of green in all its richness and depth.\\nBest in Show: $150 cash prize, cover feature, newsletter spotlight, social media promotion + free entry to the $500 Blu Sky Artist Award\\n1st Place: $50 cash prize + free Blu Sky Award entry + features\\n2nd & 3rd Place: Free Blu Sky Award entry + social features\\nHonorable Mentions & Finalists: Selected for the curated online exhibition and promoted across Ten Moir Gallery platforms\\nEntry Details\\nFee: $24 for 3 images\\nEligibility: Open to artists worldwide, 18+\\nExhibition\\nAll selected works will be featured in our online gallery with artist name, artwork title, and medium. Winners announced after the deadline.\\nCopyright info: Your images will be used only for marketing, promotional, and display purposes for any show organized by Ten Moir Gallery. The artist shall retain all copyrights of any image they submit to Ten Moir Gallery.",
        "topics_EN": [
            "Green as Central Color/Concept",
            "Nature (landscapes, forests, flora)",
            "Growth and Rebirth",
            "Envy and Jealousy",
            "Peace and Calm",
            "Cultural or Symbolic Meanings of Green",
            "Personal/Conceptual Interpretations of Color"
        ],
        "fees": "$24 for 3 images",
        "requirement": "Open worldwide to artists 18+. All mediums and styles accepted. Artwork must feature green as a central color or concept. No size limits specified. Originality is not stated in the call. Apply via online form; submitted images may be used for Ten Moir Gallery marketing while artists retain copyright."
    },
    {
        "title": "Call for Art- WIDE OPEN - Temporary, Artist Calls",
        "organization": "Art Fluent",
        "location": "International",
        "deadline": "09/19/2025",
        "url": "https://arts.ca.gov/collective/art-fluent-235-4-call-for-art-wide-open/",
        "description": "Art Fluent invites artists worldwide to submit artwork to our online exhibit, WIDE OPEN.\\nTHEME\\nAlways a favorite!! Open theme, anything goes!! Show us your best of the best for WIDE OPEN.\\nCALENDAR\\nJPEGs due by Friday, September 19, 2025 at midnight MST.\\nNotification of acceptance and online gallery opening by Friday, October 17, 2025.\\nAWARDS\\nAll accepted pieces will be displayed in our online gallery at www.art-fluent.com\\nBest of Show: $750\\nTwo Directors Choice awards: $250 each\\nENTRY FEE\\n$25 for first entry/$10 for each additional entry. You may enter up to 20 total. Payment is non-refundable and does not guarantee acceptance. For 3D work, there is no need to pay for additional entries for detail shots. Once your first entry is made, you may send additional views by email to hello@art-fluent.com.\\nELIGIBILITY\\nThis call is open to artists worldwide, both amateur and professional. Work that has been selected for previous exhibits with Art Fluent will not be considered.\\nRULES\\nWork that is copied or done under the guidance of an instructor is not eligible. Open to ALL fine art mediums (oil, acrylic, watermedia, pastel, drawing, printmaking, mixed media, photography, sculpture, fiber, wood, ceramics, film/video, digital art). AI will not be accepted. Diptychs and triptychs should be uploaded as a single image.\\nSELECTION PROCESS\\nDirectors choice. Each show is curated and juried by Creative Director, Amy Matteson Neill along with an anonymous committee of jurors. Please note, there is no personal feedback given by jurors.\\nENTRY PROCEDURE\\nEntry is done through CaF, a web-based service that allows artists to upload images and organize their artwork for submissions to galleries. To apply for a call, you must leave our website and go to the CaF website at www.callforentry.org where you can create a FREE artist account. You will add your details and upload your images to CaF and then you can submit work to WIDE OPEN. If you have any questions, please contact us at hello@art-fluent.com we are happy to walk you through the process.\\nMEDIA PREPARATION\\nPlease only submit properly cropped images of your work that are in focus. We have a free resource for artists for tips on how to get high quality images of your work. Visit www.art-fluent.com/resources for a free download. CaF also offers tips on their blog which you can find here www.callforentry.org/photographing-artwork/.\\nAll images must be in JPEG/JPG format using CaF guidelines. The image size must be 1,200 pixels or greater on the longest side. Maximum file size is 5 mb.\\nAccepted video formats include MOV, MP4, WMV. Aspect ratio 4:3 or 16:9, resolution minimum 640480, maximum 1920 x1080, bit rate recommended above 240 kbps, recommended frame rate 30 fps. File size must be under 100 MB. If your video work has been selected for the exhibit, we kindly request that you provide us with the file link via Vimeo. Please ensure the linked video is set to be shared publicly. Your video will not play if it is set to private.\\nNOTIFICATION\\nNotification will be done by email, everyone who submits will be notified of the jurors selections. If for any reason you do not hear from us by the notification date, please check the filters in your email account. Notification emails are sent to the email on file with CaF.\\nSALES\\nAll sales inquiries will be directed to the artists website and/or contact information. For any artwork that is sold, the artists receive 100% of the sale.\\nGIVING BACK\\nA portion of the proceeds from the entry fees is donated to organizations committed to the arts and supporting artists.\\nREQUIRED FORMS\\nCash awards over $600 are subject to federal income tax withholding within the United States. A W-9 form must be filled out by the winner and submitted to Art Fluent, Inc.\\nREGULATIONS\\nBy entering our calls for art through CaF you are agreeing to be added to Art Fluents email list for forthcoming artist opportunities. By submitting images, you agree that the images are your own work, nothing copied, you own all rights to the images, and you take full responsibility for the content of all images, including the likeness of recognizable individuals. The actual artwork will remain the property of the artist, our mission is to promote artists and their work. Should your work be accepted, you grant Art Fluent the right to reproduce your image on our website, on social media, and where appropriate to help promote further online opportunities. Art Fluent will always credit you and your copyright wherever feasible. We will not use your image for any other purpose without the artists permission.",
        "topics_EN": [
            "Any"
        ],
        "fees": "$25 for first entry; $10 for each additional entry (up to 20 total)",
        "requirement": "Open to artists worldwide (amateur and professional). Artwork must be original, not copied or made under instructor guidance, not previously selected by Art Fluent; AI-generated work is prohibited. No physical size limits specified — submit digital images (JPEG/JPG, ≥1200 px on longest side, ≤5 MB) or video (MOV/MP4/WMV, 640x480–1920x1080, <100 MB). Entry via CaF; fees are non-refundable; up to 20 entries allowed; diptychs/triptychs uploaded as a single image. Winners of cash awards > $600 must submit a W-9."
    },
    {
        "title": "Anthology Cover Art Competition 2025 - Temporary, Artist Calls",
        "organization": "Anthology Magazine",
        "location": "International",
        "deadline": "10/31/2025",
        "url": "https://arts.ca.gov/collective/anthology-magazine-235-4-anthology-cover-art-competition-2025/",
        "description": "Submissions are now invited for the Anthology Cover Art Award.  Established to foster and support both established and emerging visual artists and provide a platform for publication, the competition is open to multiple genres including painting, printmaking, mixed media, photography and digital media.\\nWorks entered must not have appeared on the cover of another publication and not entered simultaneously in any other contest or competition. Works previously exhibited or published on the artists website on the interior pages of a book or magazine are accepted.\\nEntries are invited from artists of all nationalities, living anywhere in the world. There is no limit to entries per person.\\nThe winner will receive 500 and publication on the cover of  and editorial coverage in  a future issue of Anthology.",
        "topics_EN": [
            "Any"
        ],
        "fees": "$0",
        "requirement": "Open to artists worldwide (all nationalities), unlimited entries per person. Accepts painting, printmaking, mixed media, photography and digital media. Artwork must be original, must not have appeared on the cover of another publication, and must not be entered in any other contest/competition simultaneously; works previously exhibited or published on artists' websites or on interior pages of books/magazines are acceptable. No size limits specified."
    },
    {
        "title": "Word Play National Juried Exhibition - Freelance, Artist Calls",
        "organization": "Arc Studios & Gallery",
        "location": "SF Bay Area",
        "deadline": "09/09/2025",
        "url": "https://arts.ca.gov/collective/arc-studios-gallery-245-5-word-play-national-juried-exhibition/",
        "description": "In Word Play, we are looking for artworks that creatively engage with text, whether through words, letters, phrases, or entire narratives. The text can serve as a message, a visual texture, a conceptual element, or even as the main subject. We encourage submissions that explore the interaction between words and image, spanning themes such as language, identity, culture, politics, and beyond.",
        "topics_EN": [
            "Text-based Art",
            "Typography / Letterforms",
            "Language",
            "Narrative / Storytelling",
            "Identity",
            "Culture",
            "Politics",
            "Words as Visual Texture"
        ],
        "fees": "$0",
        "requirement": "Open to all artists; artworks must creatively engage with text (words, letters, phrases, or narratives) and explore interaction between words and image. No specific location, size limits, or originality requirements are specified in the call."
    },
    {
        "title": "2025 Call for Artists - Temporary, Artist Calls",
        "organization": "NOW Art",
        "location": "Other",
        "deadline": "01/01/2026",
        "url": "https://arts.ca.gov/collective/now-art-242-4-2025-call-for-artists/",
        "description": "This nationwide community mural program is a celebration of communities across America and an important part of a new or newly transformed facility. Every mural is a unique, original artwork. NOW Art is a public art agency and we work with our clients to curate artworks and engage artists across the country. Today, community murals are featured in hundreds of locations, and original artworks are unveiled weekly in newly transformed facilities.\\nThis opportunity is with NOW Art directly to be included in our pre-qualified directory of artists for mural commissions. To participate in this program and be selected we are considering artists who create compositions in the following styles: contemporary, street art, and traditional.\\nThis will not require any onsite work.\\nArtists will create the designs remotely (either traditionally or digitally) and submit the work in high-resolution format. Our organization prints and installs their work in the stores.\\nSkills and Qualities:\\nTimeliness: Artists must be able to meet tight deadlines due to the time sensitive nature of this program.\\nDetail-oriented: The selected works will be significantly enlarged, so detail and an understanding of scale are key.\\nCommunication: Artists must be responsive collaborators with our agency.\\nExperience: Artists must have a link to a strong portfolio of work that showcases a range of compositions. Previous client-based experience is a bonus.\\nCompensation for the mural will be up to $1,000 per project. Inclusion in the directory does not guarantee a mural commission.\\nIf interested, please fill out our Request for Qualifications form at the link below. We do not accept applications through Indeed. You must submit your application via the RFQ link to be considered. There will be introductory Zoom interviews for artists we would like to move forward with.\\nThis opportunity is only available to residents of the United States and Puerto Rico. Preference for artists in the following states: Mississippi, Alabama, North Carolina, West Virginia, Texas, Louisiana, South Carolina, Oklahoma, and Kansas.",
        "topics_EN": [
            "Community Celebration",
            "Community Identity and Local Culture",
            "Place-making and Civic Pride",
            "Diversity of American Communities"
        ],
        "fees": "$0",
        "requirement": "Open to residents of the United States and Puerto Rico (preference for MS, AL, NC, WV, TX, LA, SC, OK, KS). Submit original, unique mural designs remotely (traditional or digital) in high-resolution; no onsite work. Work should align with contemporary, street art, or traditional styles. Applicants must provide a strong portfolio link, meet tight deadlines, be detail-oriented and responsive. Apply via the RFQ link (applications via Indeed not accepted). Inclusion in the directory does not guarantee commission; compensation up to $1,000 per project."
    },
    {
        "title": "Aesthetic Dynamics - Temporary, Artist Calls",
        "organization": "LoosenArt",
        "location": "International",
        "deadline": "10/13/2025",
        "url": "https://arts.ca.gov/collective/loosenart-235-4-aesthetic-dynamics/",
        "description": "AESTHETIC DYNAMICS\\nFree entryCall for Exhibition\\nPhotographers are invited to submit 1 up to 3 photos addressing the theme.\\nGroup Exhibition in Rome. January 2026\\n\\nThe aesthetic elaborations that turn their gaze towards formal dynamics have originated from the studies on the organic world. These have been being developed since the nineteenth century, thanks to scientific discoveries and technological inventions such as the microscope, x-rays, microphotography, etc., and all these are tools through which artists could also observe the natural world: in this cultural context Art Noveau develops as an artistic phenomenon characterized by a style that uses curved and sinuous lines to create fluid and dynamic shapes inspired by nature.\\nStemming out of very different principles and cultural backgrounds, other important movements have later given wide space to studies on aesthetic dynamics, such as Futurism, a movement born during the technological boom that allowed a new perception of space and time, and a movement that, inspired above all else by the inventions in the field of communication, gave life to new aesthetics that represent a praise to speed.\\nThe Aesthetic Dynamics call deals with a theme that inherits intellectual historical precepts from which, thanks to continuous scientific and technological development, it is still possible to provide new perceptions of reality.\\nThis call welcomes photographic works with no limit of style and genre.\\n\\nSubmissions  http://bit.ly/loosenartcalls\\nDeadline October 13th, 2025",
        "topics_EN": [
            "Aesthetic Dynamics",
            "Formal Dynamics",
            "Organic and Nature-Inspired Forms",
            "Microscopic/X-ray Perspectives",
            "Fluidity and Sinuous Lines (Art Nouveau)",
            "Speed, Movement and Futurist Perception",
            "Technological Mediation of Perception",
            "Perception of Space and Time"
        ],
        "fees": "$0",
        "requirement": "Open to photographers (no geographic restriction stated). Submit 1–3 photos addressing the 'Aesthetic Dynamics' theme. No style or genre limits. Group exhibition in Rome (January 2026). Free entry. Deadline: October 13, 2025."
    },
    {
        "title": "Guest Contributors & Re-curing Columnists to 1UV MONTHLY Magazine - Temporary, Artist Calls",
        "organization": "1UV Gallery Studio & 1UV MONTHLY Magazine",
        "location": "California",
        "deadline": "12/31/2025",
        "url": "https://arts.ca.gov/collective/1uv-gallery-studio-1uv-monthly-magazine-231-4-guest-contributors-re-curing-columnists-to-1uv-monthly-magazine/",
        "description": "Submit\\nyour original poetry, political cartoons, short comic strip, short fiction, or Art-related guest article for print in\\n1UV MONTHLY Magazine\\n. It is free to submit your original work. Publication is at the prerogative of 1UV. If your submission is accepted you will be notified.\\n1UV MONTHLY is also seeking\\nregularly contributing columnists\\nfor  recurring Art and/or local Culture Columns.\\nDuties include:\\n generating and editing original non-AI Slow-Art-related content relevant to 1UV MONTHLYs readership\\nThis is a part time remote contract position, with the exception of a one time face to face on-site Gallery meeting.\\nCompensation is: the freedom of your own voice free of editorial manipulation, a headshot with bio, plus other compensation to be negotiated upon agreement to contribute.\\nCandidate must:\\n be a minimum of 21 years of age\\n speak, read and write fluent English\\n be able to work legally in the United States\\n demonstrate journalistic writing proficiency\\n demonstrate ability to meet deadlines\\n demonstrate and understanding and practice of Slow Art\\n be committed to maintaining scheduled appointments\\n have your own reliable transportation\\nSubmission deadlines are as follows:\\nDEADLINES:\\nJanuary  submissions by November1\\nFebruary   submissions by December 1\\nMarch- submissions by January 2\\nApril  submissions by February 1\\nMay  submissions by March 1\\nJune  submissions by April 1\\nJuly  submissions by May 1\\nAugust  submissions by June 1\\nSeptember  submissions by July 1\\nOctober   submissions by August 1\\nNovember  submissions by September 1\\nDecember  submissions by October 1",
        "topics_EN": [
            "Slow Art",
            "Local Culture",
            "Political Commentary",
            "Art Criticism and Commentary"
        ],
        "fees": "$0",
        "requirement": "Applicants must be at least 21 years old, speak/read/write fluent English, and be legally able to work in the United States. Submissions must be original (non-AI) and relevant to Slow Art, art criticism, or local culture; publication is at 1UV MONTHLY's discretion. Columnist candidates must demonstrate journalistic writing proficiency, ability to meet deadlines, commitment to scheduled appointments, and have reliable transportation for a one-time on-site gallery meeting (otherwise a part-time remote contract). No artwork size limits specified."
    },
    {
        "title": "Join the Biofeedback Art|Research Network - Freelance, Artist Calls / Conferences/Workshops / Training",
        "organization": "Gray Area",
        "location": "California",
        "deadline": "01/01/2026",
        "url": "https://arts.ca.gov/collective/gray-area-231-5-join-the-biofeedback-art-research-practice-network/",
        "description": "About\\nThe Biofeedback Art|Research Network, led by curator & scholar Anastasia Chernysheva and supported by\\nGray Area\\n, is an international community of artists, scientists, and researchers exploring the intersection of biological data and artistic expression.\\nOur goal is to integrate cutting-edge biofeedback technology in artistic practices to push the boundaries of conventional art-making and to challenge traditional notions of the relationship between mind and body. The biofeedback art research practice network is an interdisciplinary community dedicated to advancing our understanding of the human experience and providing new insights into the potential of art as a tool for self-expression and self-discovery.\\nCurrent Members\\nAlan Macy (UC Santa Barbara), Alicia Champlin (Independent Artist), Alex Chechile (Rhode Island School of Design), Alexandria Smith (Georgia Institute of Technology), Allison Leigh Holt (Rensselaer Polytechnic Institute), Amanda Dawn Christie (Independent Artist), Anastasia Chernysheva (UCLA/Gray Area), Andromachi Vrakatseli (University of Western Macedonia), Annika Malmstrom-Smith (Santa Barbara City College), Anthony Lewis Brooks (Aalborg University), Aricia Macado (UNESPAR/FAP  Campus de Curitiba II),\\nBarbara Nerness (Stanford University/CCRMA), Ben Eyes (University of York), Beer van Geer (Independent Artist), Brett Griffin (Griffin Prototyping), Bruno Azevedo (University of Minho),\\nCathryn Ploehn (The University of Texas at Austin ), Chanee Choi (University at Albany), Chase Niesner (UC Berkeley), Cheng Yang (City University of Hong Kong), Claudia Krogmeier (University of Wisconsin), Corinne Whitaker (Independent Artist),\\nDaniel Macri (UCSF, Global Brain Health Institute), Duncan Williams (University of Salford),\\nElizabeth Williamson (University College Dublin), Erika-Jean Lincoln (LincolnLab Studios), Erin Gee (Universit de Montral),\\nFranciszek Sobiech (Lodz University of Technology), Franois Lespinasse (Concordia University), Grace Grothaus (York University),\\nGrace Leslie (University of Colorado Boulder), George Khut (Independent Artist),\\nIsabella Cao (UC Irvine), Ishraki Kazi (New Museum), Ivor Diosi (Independent Artist),\\nKachi Chan (Hong Kong Baptist University), Kavi (Ilze Briede) (York University), Kelly Andres (Independent Artist/Curator), Kodandi Nithyananda (Maharishi International University), Krisztin Hofstdter (University of York),\\nLaura Jade (Independent Artist), LeeAnn Perry (Independent Artist), Leslie Garca and Paloma Lpez (Interspecifics), Lesley Marshall (MAVNetwork), Jimmy Quatier (Center on Contemporary Art),\\nJo-Anne Maathuis (Maastricht University), Julia Barzizza (Precita Eyes Muralists),\\nMark-David Hosale (York University), Micah Huang (Harvard University), Mingyong Cheng (UCSD), Michelle Lewis-King (Independent Artist/FutureCultures), Natalia Fuchs (Ionian University),\\nRimon Alyagon Darr (Bezalel Academy of Arts and Design), Rka Harsnyi (Pcsi Tudomnyegyetem),\\nSharath Chandra Ramakrishnan (University of Illinois Urbana-Champaign), Susan Jowsey (Auckland University of Technology), Stella Zaltieri Pirola (Accademia di Brera  Milano), Taguhi Torosyan (Ars Techne Foundation), Tra Bouscaren (Arizona State University), Teresa Connors (Concordia University),\\nWalid Breidi (Independent Artist), Veronika Treumova (Independent Artist), Vishal Kumaraswamy (University of Washington), Ye Seung Lee (Korea University), Yuming Chen (University of Plymouth), Zachary Kerhoulas (University of Michigan)\\nMembership Offers\\nAs a member, you will enjoy\\nUpdates on the latest advancements in biofeedback art and research practice.\\nCollaboration opportunities with artists, researchers, and scholars from diverse backgrounds.\\nMentorship and peer learning  whether youre just starting out or seeking to realize a technically difficult idea, this group is a place to find support.\\nA community of like-minded individuals with relevant expertise.\\nRepresentation and visibility  we recognize and honor the diversity of experiences and identities of practitioners who came to the scene after the 1960s.\\nHow to Join\\nMembership is free. To join our community, you must be an artist, researcher, or scholar working with biofeedback technology and/or writing about its applications in art and science. We welcome individuals from diverse backgrounds and disciplines. To express your interest, email us a short description of your work and motivation to join.\\nFor External Outreach\\nWere also interested in connecting with:\\nTech companies producing Brain-Computer Interfaces and/or other devices gathering physiological data of the human body. If youd like to test your production with an artist or scientist, reach out to us.\\nCurators and venues wishing to have artists with performances and installations. Let us know if youd like to connect with one of our talented members.\\nEducators and workshop organizers seeking the involvement of researchers/practitioners. Were happy to help facilitate collaborations.\\nContact Details\\nPlease feel free to reach out to anchernyshyova@gmail.com for more information or to express your interest in joining the biofeedback art research practice network.\\nConnect\\nvia\\nInstagram\\n,\\nBlog\\n, or\\nLinkedIn\\n.",
        "topics_EN": [
            "Biofeedback Art",
            "Biological Data in Art",
            "Mind–Body Relationship",
            "Human Experience",
            "Interdisciplinary Art–Science Collaboration",
            "Brain–Computer Interfaces and Physiological Data",
            "Self-Expression and Self-Discovery"
        ],
        "fees": "$0",
        "requirement": "Open internationally to artists, researchers, or scholars working with biofeedback technology and/or writing about its applications in art and science; membership is free; apply by emailing a short description of your work and motivation to join; interdisciplinary practice involving biological/physiological data is required."
    },
    {
        "title": "Seeking artists for national community mural program (USA and Puerto Rico Only) - Freelance, Artist Calls",
        "organization": "NOW Art",
        "location": "Other",
        "deadline": "12/31/2025",
        "url": "https://arts.ca.gov/collective/now-art-242-5-seeking-artists-for-national-community-mural-program-usa-and-puerto-rico-only/",
        "description": "Community Mural Program\\nNOW Art is actively seeking artists nationwide to design unique and original mural compositions for community-focused programs. These public facing projects are in partnership with Walmart. Each mural is delivered as digital compositions or scanned high-resolution traditionally created artwork files. Approved artwork images will be printed on high quality vinyl, enlarged and adhered professionally in site specific locations.\\nSkills and Qualifications\\nArtists should be skilled in Photoshop, Illustrator, Procreate, or other software that uses a variety of brushes, filters, and effects or able to generate scanned digital files of work that are color corrected and clean to enlarge at scale.\\nArtists will be required to provide a high-resolution file at a minimum of 500-720 dpi. Exact dimensions will be provided once an artist is engaged in a project. Selected works will be significantly enlarged, so attention to detail is key.\\nTurnaround time per project is approximately 7  14 days, so efficiency is key.\\nLink to Apply:\\nhttps://forms.gle/rDzFq3dyKogA5ivC7\\nWebsite:\\nhttps://nowartpublic.com/community-murals-program/\\nInstagram:\\nhttps://www.instagram.com/community_mural_program/\\nQuestions?\\nmurals@nowartpublic.com\\nThis opportunity is only available to residents of the United States and Puerto Rico.",
        "topics_EN": [
            "Community Engagement",
            "Community Identity and Stories",
            "Site-specific / Place-based Themes",
            "Public-facing Accessible Art"
        ],
        "fees": "$0",
        "requirement": "Open to residents of the United States and Puerto Rico only. Artists must submit original mural compositions as high-resolution digital files or scanned traditional artwork (minimum 500–720 dpi). Exact final dimensions provided after selection; works must be suitable for large-scale enlargement. Quick turnaround required (~7–14 days). Proficiency with Photoshop, Illustrator, Procreate or ability to produce color-corrected, clean files is expected."
    },
    {
        "title": "Anthology Photography Competition 2025 - Temporary, Artist Calls",
        "organization": "Anthology Magazine",
        "location": "International",
        "deadline": "11/30/2025",
        "url": "https://arts.ca.gov/collective/anthology-magazine-235-4-anthology-photography-competition-2025/",
        "description": "Open to photographers working at any level, the Anthology Photography Competition celebrates outstanding standalone images. It also provides a platform for photographers to showcase their work through publication.\\nImages submitted must be on the theme of The World As You See It. Submissions will be judged on quality, creativity, originality, and visual/emotional impact.\\nPhotography styles can include street photography, landscapes, natural world & wildlife, macro photography, lifestyle, object and still life and architectural. Technically manipulated images such as abstract, panoramic, stitched and composite are also permitted. Extra merit will be awarded to creative interpretation of the brief.\\nEntries are invited from photographers of all nationalities, living anywhere in the world. There is no limit to entries per person.\\nThe winner will receive a 500 cash prize and editorial coverage in a future issue of Anthology magazine.\\nMore details and submissions: https://anthology-magazine.com/awards/photo-competition/",
        "topics_EN": [
            "The World As You See It",
            "Personal/Subjective Perspective",
            "Everyday Life",
            "Street Photography",
            "Landscapes",
            "Natural World & Wildlife",
            "Macro Details",
            "Lifestyle",
            "Objects & Still Life",
            "Architecture",
            "Experimental/Composite/Abstract"
        ],
        "fees": "$0",
        "requirement": "Open to photographers worldwide (all nationalities, any level). Images must be standalone photographs on the theme “The World As You See It.” All photographic styles accepted—including street, landscape, wildlife, macro, lifestyle, still life, architecture—and technically manipulated images (abstract, panoramic, stitched, composite) are permitted. Unlimited entries per person. No size/file limits specified; originality is not explicitly required but will be considered in judging."
    }
]