[
    {
        "title": "Call to Artists | Yellow Art Contest",
        "organization": "Grey Cube Gallery",
        "location": "N/A",
        "deadline": "October 23, 2025",
        "url": "https://azarts.gov/arts-op/call-to-artists-yellow-art-contest/",
        "description": "Call to Artists | Yellow Art Contest\\nPosted\\nSeptember 29th, 2025\\nGrey Cube Gallery proudly presents the fifth Yellow online art contest for the month of October 2025. Contest is open to all artists worldwide over 18 years of age. The theme may include any work with depiction of the color Yellow or shades of Yellow (beige, lemon yellow, canary yellow, golden yellow). All visual art mediums (except video and sound) are allowed. Best of Show artwork will be on the poster of the show. Winning artists (Merit Award & Honorable Mention) will receive a digital award certificate. The deadline to submit entries is the October 23, 2025.\\nDetails\\nOrganization/Company:\\nGrey Cube Gallery\\nWebsite:\\nhttps://greycubegallery.com/callforentries/index.html\\nLocation:\\nOnline\\nDeadline:\\nOctober 23, 2025\\nHow to Apply:\\n- Select an image (up to 2 MB) of your artwork\\n- Include an artist statement to be included with your art\\n- Fill out all required information\\n- Submit your artwork\\n- Your will be redirected to Pay Pal for payment\\n- You will receive a confirmation email after your payment is complete.\\nTags:\\nCalls for Public Art\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "2026 John Chervinsky Emerging Photographer Scholarship",
        "organization": "The Griffin Museum of Photography",
        "location": "N/A",
        "deadline": "October 31, 2025",
        "url": "https://azarts.gov/arts-op/2026-john-chervinsky-emerging-photographer-scholarship/",
        "description": "2026 John Chervinsky Emerging Photographer Scholarship\\nPosted\\nSeptember 29th, 2025\\nThe John Chervinsky Emerging Photographer Scholarship seeks to recognize, encourage and reward photographers with the potential to create a body of work and sustain solo exhibitions. Awarded annually, the Scholarship provides recipients with a monetary award of $3,000, exhibition of their work at the Griffin Museum of Photography, and a volume from Johns personal library of photography books. The Scholarship seeks to provide a watershed moment in the professional lives of emerging photographers, providing them with the support and encouragement necessary to develop, articulate and grow their own vision for photography.\\nEligibility Criteria\\nThe scholarship is open to photographers who have produced individual works of photography and/or are in the process of producing bodies of work.\\nWe are looking for candidates who are serious about photography, whose potential is emerging and whose photography will benefit from this scholarship.\\nCandidates can be currently enrolled in a photography degree program if in their graduating year. There is no age limit. There are no residency requirements. There is no application fee.\\nPhotographers without gallery representation who have not exhibited solo in a commercial gallery, academic gallery (except for thesis shows), galleries in organizations like the Griffin Museum, Houston Center for Photography, Center for Fine Art Photography etc. or a museum setting or have not received significant (over $3000) grant funding are eligible (coffee shop, community gallery, library, academic thesis exhibitions, etc. are eligible exhibition settings). Past awardees of the Chervinsky Scholarship, paid employees of the Griffin Museum or their immediate families, Griffin Museum board members and jurors immediate families and those immediate families of Griffin board members or jurors paid employees are not eligible.\\nThis scholarship is not for well-established photographers. Well-established photographers are individuals in mid-photography-careers and are seen by the public and peers as distinguished in the field of photography and have many accomplishments as a photographer. Of note, receiving a Fulbright Scholarship would disqualify a candidate from receiving this scholarship. Producing a published (by a publisher) photo book would disqualify a candidate from receiving this scholarship. Self publishing does not disqualify a candidate.\\nSubmissions\\nSubmissions may be made directly to Caf. You will be asked for a brief biography and artistic cv (a single PDF that includes both bio and cv. In the PDF title include Chervinsky and last name and first name.); a statement of artistic purpose/intent; a statement on the work supplied, and flattened rgb jpgs (1200 pixels on the longest side) of your photographs (10 photographs total). Please submit your images in the order you wish them to appear. numbering from 1-10 will be helpful to the jurors so they can see your intention with the works.\\nDo not supply links. Caf will give the jurors the ability to go there to view. No other means of submission will be accepted. All missing criteria will disqualify the submission. Emails will not be accepted as a method of submissions. It is recommended that great thought and effort be put into the artistic purpose/intent statement (see sample supplied). Artistic Purpose is how you will use the scholarship and your plan. The statement is about your body of works intent.\\nIt is recommended that you prepare all the elements of the application in advance. Do not start the application if you do not have time to finish it. Wait until you have time to complete the application in one session.\\nAbout the Jurors \\nJudith Donath is a writer, designer and artist whose work focuses on the co-evolution of technology and society. She has published numerous articles about social media, AI, ethics and anonymity, and is the author of The Social Machine: Designs for Living Online (MIT Press). As the former director of the MIT Media Labs Sociable Media Group, she and her students designed innovative interfaces for on-line communities; their art projects examining the future of identity, privacy and mediated life have been exhibited in museums and galleries worldwide. Currently, she is a faculty fellow at Harvards Berkman Klein Center and is writing a book about technology, trust and deception.\\nFern L. Nesson is a graduate of Harvard Law School. She received an M.A. in American History from Brandeis and an M.F.A in Photography from the Maine Media College. She lives in Cambridge, Massachusetts. She practiced law in Boston for twenty years and subsequently taught American History and Mathematics.\\nNessons photographs have been shown internationally in solo exhibitions at the Politecnico University in Torino, Italy, Les Rencontres de la Photographie in Arles, France, Ph21 Gallery in Budapest, Hungary and at The University of the West Indies in Kingston, Jamaica. In the United States, Nesson has had solo exhibitions at the Griffin Museum of Photography, at MIT and Harvard, and at the Beacon Gallery in Boston, Massachusetts, the Pascal Gallery in Rockport, and Maine, and Through This Lens Gallery in Durham, NC. Additionally, her work has been selected for numerous juried exhibitions in the U.S., Barcelona, Rome and Budapest. Nessons photobooks, Signet of Eternity and WORD, won the 10th and the 12th Annual Photobooks Award from the Davis-Orton Gallery. Her photography can be found at www.fernlnesson.\\nLaura Zittrain is a curator, teacher and writer who studies science and spirituality, including the rituals and practices of those disciplines. She produces workshops, classes and exhibitions that concern technology, mysticism, and embodiment. Her work extends from archival research in the history of chatbots and AI, to organizing hackathons and creating immersive soundscapes of celestial and human bodies. She is partial to dystopian science fiction and Busby Berkeley numbers, and can often be spotted in a cowboy hat in Cambridge, MA where lives and works.\\nDetails\\nOrganization/Company:\\nThe Griffin Museum of Photography\\nWebsite:\\nLocation:\\nGriffin Museum of Photography, Winchester MA\\nDeadline:\\nOctober 31, 2025\\nHow to Apply:\\nSubmit at this Cafe Link : https://artist.callforentry.org/festivals_unique_info.php?ID=15937&fbclid=PAVERFWAM_uNFleHRuA2FlbQIxMQABpwYMNcgWpHQQxAe3ih39G9l2zEgGtZvOle5O7v6pWXF9HI6d6YVxJJNOirAi_aem_yb0lePPfBUvjslrASe39Hw\\nTags:\\nGrants & Funding Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call for Artist | Visiting Sculpture Artist",
        "organization": "Cochise College Department of Art & Humanities",
        "location": "N/A",
        "deadline": "10/3/25",
        "url": "https://azarts.gov/arts-op/call-for-artist-visiting-sculpture-artist/",
        "description": "Call for Artist | Visiting Sculpture Artist\\nPosted\\nSeptember 29th, 2025\\nThe Cochise College Art and Humanities Department is bringing in a sculptor to collaborate with students from all of our campuses to create a burnable sculpture for the Pit Fire Pottery Festival. Artists will be selected by an application process and voted on by the Arts faculty. The sculptor will work with our 3D students to make an impermanent sculpture that will be burned during the festival. The selected artist will be invited to give an artist talk during their time at the college. Early career artists are encouraged to apply.\\nThe artist will be asked to work on-campus during the 3 weeks leading up to the event, and will receive an honorarium of $4,000 to cover lodging, travel, and stipend. In addition, we will provide and prepare up to $1,000 of purchased materials for the project (on top of available classroom and studio supplies). We will work with the accepted artists to plan the best timing for class visits and artist talks, and for working with students to create the artworks from October 27th- November 14th. We do have some flexibility here, so please mention any time constraints in your application.\\nDetails\\nOrganization/Company:\\nCochise College Department of Art & Humanities\\nWebsite:\\nhttps://www.cochise.edu/community/pit-fire-pottery-festival/index.html\\nLocation:\\nDouglas, Arizona\\nDeadline:\\n10/3/25\\nHow to Apply:\\nhttps://forms.gle/425EG4rgQqPmEKMb8\\nTags:\\nOther\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call to Artists | Grey Art Contest",
        "organization": "Grey Cube Gallery",
        "location": "N/A",
        "deadline": "Octoner 09, 2025",
        "url": "https://azarts.gov/arts-op/call-to-artists-grey-art-contest/",
        "description": "Call to Artists | Grey Art Contest\\nPosted\\nSeptember 29th, 2025\\nGrey Cube Gallery proudly presents the fourth Grey online art contest for the month of October 2025. Artists from around the world are welcome to submit. Entries must include the black and white or shades of gray as the primary focus. All visual art mediums (except video and sound) are allowed. Winning artwork (Best of Show) will be on the poster of the show. All winning artists will receive a digital award certificate. The deadline to submit entries is the October 09, 2025.\\nDetails\\nOrganization/Company:\\nGrey Cube Gallery\\nWebsite:\\nhttps://greycubegallery.com/callforentries/indexx.html\\nLocation:\\nOnline\\nDeadline:\\nOctoner 09, 2025\\nHow to Apply:\\n- Select an image (up to 2 MB) of your artwork\\n- Include an artist statement to be included with your art\\n- Fill out all required information\\n- Submit your artwork\\n- Your will be redirected to Pay Pal for payment\\n- You will receive a confirmation email after your payment is complete.\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call to Artist | Through the Lines",
        "organization": "Yuma Art Center",
        "location": "N/A",
        "deadline": "October 13, 2025",
        "url": "https://azarts.gov/arts-op/call-to-artist-through-the-lines/",
        "description": "Call to Artist | Through the Lines\\nPosted\\nSeptember 29th, 2025\\nThe City of Yuma invites artists to create designs for Through the Lines, a lenticular fence mural that shifts with the viewers perspective. Were looking for artwork celebrating the Southwest, downtown Yuma, or local heritage, textures, and patternsapproached with creativity and thoughtful representation.\\nSelected designs will be printed on durable vinyl and installed on a metal fence along East 2nd Street, forming a cohesive image from a specific viewing angle.\\nStipend: $2,000\\nDeadline: October 13, 2025\\nReveal: December 6, 2025\\nDetails\\nOrganization/Company:\\nYuma Art Center\\nWebsite:\\nhttps://www.yumaaz.gov/visitors/yuma-art-center-historic-yuma-theatre#!/\\nLocation:\\nYuma, Az\\nDeadline:\\nOctober 13, 2025\\nHow to Apply:\\nFor more information, view application form and apply here: https://form.jotform.com/252405991608058\\nTags:\\nCalls for Public Art\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call for Art Based on Nature | Arte Natura",
        "organization": "Limner Gallery",
        "location": "N/A",
        "deadline": "02/28/2026",
        "url": "https://azarts.gov/arts-op/call-for-art-based-on-nature-arte-natura/",
        "description": "Call for Art Based on Nature | Arte Natura\\nPosted\\nSeptember 29th, 2025\\nArte Natura is a thematic exhibition based on art inspired by the world of nature and biology. The exhibition will be held at the Limner Gallery, May 14  June 6, 2026 and is open for entry to all artists working in any media. All interpretations of the theme are acceptable, including landscape, fruits, vegetables, flowers, fauna and human figuration as part of the natural environment. Deadline February 28, 2026. On-line entry form at http://www.slowart.com/prospectus/natura.htm\\nDetails\\nOrganization/Company:\\nLimner Gallery\\nWebsite:\\nhttp://www.slowart.com\\nLocation:\\nHudson, NY\\nDeadline:\\n02/28/2026\\nHow to Apply:\\nhttp://www.slowart.com/prospectus/natura.htm\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call to Artists | NEOTERIC ABSTRACT XIV",
        "organization": "Limner Gallery",
        "location": "N/A",
        "deadline": "01/31/2026",
        "url": "https://azarts.gov/arts-op/call-to-artists-neoteric-abstract-xiv/",
        "description": "Call to Artists | NEOTERIC ABSTRACT XIV\\nPosted\\nSeptember 29th, 2025\\nNeoteric Abstract is an annual, thematic exhibition dedicated to abstract art that is open for entry to all artists working in any media. The exhibition will be held at the Limner Gallery, April 9  May 2, 2026 and is open to all forms of abstraction, from the geometric to the lyrical, from the precise to the raw. The entry deadline is January 31, 2026.\\nThe entry form is online at:\\nhttp://www.slowart.com/prospectus/abstract.htm\\nDetails\\nOrganization/Company:\\nLimner Gallery\\nWebsite:\\nhttp://www.slowart.com\\nLocation:\\nHudson, NY\\nDeadline:\\n01/31/2026\\nHow to Apply:\\nhttp://www.slowart.com/prospectus/abstract.htm\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call to Artists | 4th Koi Artist Award",
        "organization": "Blue Koi Gallery",
        "location": "N/A",
        "deadline": "11/30/2025",
        "url": "https://azarts.gov/arts-op/call-to-artists-4th-koi-artist-award/",
        "description": "Call to Artists | 4th Koi Artist Award\\nPosted\\nSeptember 29th, 2025\\nThe Koi Artist Award is now open for entries. An Open Theme (Artists Choice) call that gives you complete freedom of self-expression. This is your chance to showcase your vision without limits.\\nWe welcome artists and photographers from around the world, 18 years and older, working in every medium, style, and genre. Whether bold or subtle, abstract or representational, your work belongs here.\\nThe Winner will receive:\\n $500 cash prize\\n Solo exhibition feature\\n Official certificate\\n Media promotion\\n Highlight in the KAA newsletter\\nShare your creativity with a global audience. Submit today and let your art speak for itself.\\nClosing Date: November 30th, 2025\\nDetails\\nOrganization/Company:\\nBlue Koi Gallery\\nWebsite:\\nhttps://koisartistaward.com/\\nLocation:\\nOnline\\nDeadline:\\n11/30/2025\\nHow to Apply:\\nApplication: https://koisartistaward.com/koi-artist-award/\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call to Artists | Nature Art Competition",
        "organization": "Artist Space Gallery",
        "location": "N/A",
        "deadline": "Octobe 08, 2025",
        "url": "https://azarts.gov/arts-op/call-to-artists-nature-art-competition/",
        "description": "Call to Artists | Nature Art Competition\\nPosted\\nSeptember 29th, 2025\\nWe are pleased to announce our fourth Nature online Art Competition for the month of October 2025. The Nature theme may include everything that is nature related (landscapes, seascapes, skies, world of flora and fauna, etc). A variety of interpretations can be submitted (representative, abstract, conceptual). All visual art mediums are allowed.\\nIn addition to the selected artists, the jury will select award winners in the following art categories: painting, photography, sculpture. All selected artists will receive a digital award certificate. An article about each artist will be displayed alongside the best of show and three winners. The best of show will be displayed on the poster of the exhibition. Judging the artwork will be based on the following criteria: creativity, originality and quality of art, overall design, demonstration of artistic ability, and usage of medium. The jury will not consider artworks with pornographic or satanic content. Entry fees are $20 for two pieces of artwork. You may submit more than two images; there is no limit to the number of images an artist may submit. The application deadline is October 08.\\nDetails\\nOrganization/Company:\\nArtist Space Gallery\\nWebsite:\\nhttps://artistspacegallery.com/__nature/\\nLocation:\\nOnline\\nDeadline:\\nOctobe 08, 2025\\nHow to Apply:\\nUpload an image of your artwork (up to 2.0 MB)\\nInclude a short biography with your artwork, along with your artist statement\\nFill out all information required\\nSubmit your artwork\\nYour will be redirected to Pay Pal for payment\\nAfter your payment is complete, you will receive a confirmation email\\nTags:\\nCalls for Public Art\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "YICCA 25/26 | International Contest of Contemporary Art",
        "organization": "Moho Association",
        "location": "N/A",
        "deadline": "November 20, 2025",
        "url": "https://azarts.gov/arts-op/yicca-25-26-international-contest-of-contemporary-art/",
        "description": "YICCA 25/26 | International Contest of Contemporary Art\\nPosted\\nSeptember 29th, 2025\\nYICCA 25/26  International Contest of Contemporary Art\\nThe main goal of the YICCA competition is to promote participating artists, offering them the opportunity to actively engage in the international contemporary art scene. International exposure and networking are the key strengths of YICCA, making this competition an exceptional opportunity for growth and visibility for the selected artists.\\nParticipants will have the chance to:\\n1. Win cash prizes:\\n 1st Prize:  3,000.00\\n 2nd Prize:  1,000.00\\n2. Promote their art through multiple channels:\\n Exhibit selected artworks: Artists will have the opportunity to showcase their works in a prestigious exhibition in a dedicated space chosen by the competition.\\n Network with industry professionals: Finalists will be able to expand their network by connecting with critics, curators, gallerists, and representatives of public and private art institutions who will attend the exhibition.\\n Maximum media visibility: The competition will be accompanied by an extensive advertising campaign, ensuring broad exposure for the works and artists through various communication channels, both during and after the event.\\nYICCA thus serves not only as a prestigious platform but also as a springboard for artists wishing to gain recognition in the global contemporary art world, furthering their careers in a highly qualified international context.\\nDetails\\nOrganization/Company:\\nMoho Association\\nWebsite:\\nLocation:\\nOnline, Milan, Italy\\nDeadline:\\nNovember 20, 2025\\nHow to Apply:\\nDATES AND DEADLINES\\nNovember 20, 2025: Applications deadline\\nDecember 9, 2025: Notification of winning artworks\\nJurys final decision will lead to a selection of 18 artists that will participate in the final exhibition.\\nAll kinds of art works are accepted, including video, installations and performances.\nAll works will be presented by a picture or a video that must be followed by a description of the work.\nAll works must be available for the final exhibition and have to be artists property.\\nThe contest is open to all artists or groups of artists and professionals from any country. There are no special qualifications required for entry.\\nAll information about terms and conditions of subscription is published on the official website\\nwww.yicca.org www.contest.yicca.org\\nTo register please complete the registration form on the official website.\\nYICCA\nInternational Contest of Contemporary Art www.yicca.org\nwww.contest.yicca.org\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "PRISMA ART PRIZE  ROME | 18th EDITION",
        "organization": "Il Varco",
        "location": "N/A",
        "deadline": "12/19/2025",
        "url": "https://azarts.gov/arts-op/prisma-art-prize-rome-18th-edition/",
        "description": "PRISMA ART PRIZE  ROME | 18th EDITION\\nPosted\\nSeptember 29th, 2025\\nCalling all artists! The Prisma Art Prize is now accepting submissions for its 18th edition. As a global platform, we celebrate the power of art in all its forms, offering an inclusive space for painters, illustrators, and engravers. This is your chance to be part of a dynamic community of artists pushing boundaries and expressing the full spectrum of creativity.\\nAnnual Competitions and Awards:\\nCash prize: 2000 distributed over four quarterly competitions.\\nExhibition Opportunity: Participate in a collective exhibition in Autumn 2026 at Contemporary Cluster in Romea beacon in the international contemporary art scene.\\nSolo Exhibitions: Opportunities for solo shows at Isorrophia Gallery and the Pallavicini-Dettori Home Gallery.\\nArtist Resiencies: A two-week residency at Dar Meso, located in the heart of Tunis and a residency at Casacon Sirolo, Italy (details to be announced).\\nOther prizes will be announced.\\nKey Details:\\nSubmissions Open: March 13, 2025\\nDeadline: July 5, 2025\\nWinner Announcements for Cash and Service Prizes: July 2025\\nExhibition and Catalogue selection announcements: July 2026\\nWinner Announcements for Annual prizes (solo shows and residencies): September 2026\\nCatalog Publication: October 2026\\nExhibition Date: October 2026\\nSubmission Fees:\\n34 for 1-3 works. Up to 5 additional works can be registered at 5 each.\\nThis competition is curated by Domenico De Chirico with the artistic direction of Marco Crispano\\nFor more information on awards and to submit your work, visit our website at Prisma Art Prize Submission. Follow us on Instagram @prismaartprize for updates.\\nProduction: Il Varco Creative Hub\\nSubmission link\\nhttps://www.prismaartprize.com/submit/\\nMore information at\\nhttp://www.prismaartprize.com\\nInstagram:\\nhttps://www.instagram.com/prismaartprize\\nEmail:\\nprismaartprize@gmail.com\\nDetails\\nOrganization/Company:\\nIl Varco\\nWebsite:\\nhttps://www.prismaartprize.com/\\nLocation:\\nContemporary Cluster, Rome\\nDeadline:\\n12/19/2025\\nHow to Apply:\\nFill the form at https://www.prismaartprize.com/submit/\\nTags:\\nCompetitions\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Dreams and Fantasy | Juried Online Art Exhibition",
        "organization": "UPWARD Gallery",
        "location": "N/A",
        "deadline": "10/16/2025",
        "url": "https://azarts.gov/arts-op/dreams-and-fantasy-juried-online-art-exhibition/",
        "description": "Dreams and Fantasy | Juried Online Art Exhibition\\nPosted\\nSeptember 29th, 2025\\nUPWARD Gallery invites artists to submit artwork for our juried online art exhibition, Dreams and Fantasy.\\nThis exhibition explores how the subconscious and imagination are refracted through the prism of surrealism and magical realism, how dreams and fantasies reflect the conflict between fate and choice, transformation, personal fears, and desires.\\nWe welcome submissions from a variety of media, including but not limited to: painting, drawing, digital painting, sculpture, printmaking, photography, textiles, and mixed media.\\nAwards: Interviews and other publications are featured in the print edition of UPWARDs magazine and on the website, digital certificate, and personal artist page on the gallery website. The exhibition will be promoted online via our website and social media channels. All artists retain 100% of sales with inquiries directed to them.\\nDeadline: October 16, 2025\\nVisit\\nhttps://upwardgallery.com/ad/competitions/119/dreams-and-fantasy\\nfor a full information.\\nThe UPWARD Gallery was founded in 2021. Our online platform is designed to share art with new audiences using modern technologies. We assist emerging artists in gaining recognition and established artists in expanding their influence.\\nDetails\\nOrganization/Company:\\nUPWARD Gallery\\nWebsite:\\nhttps://upwardgallery.com\\nLocation:\\nOnline\\nDeadline:\\n10/16/2025\\nHow to Apply:\\nhttps://upwardgallery.com/ad/competitions/119/dreams-and-fantasy\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Color and Shape | Juried Online Art Exhibition",
        "organization": "UPWARD Gallery",
        "location": "N/A",
        "deadline": "10/14/2025",
        "url": "https://azarts.gov/arts-op/color-and-shape-juried-online-art-exhibition/",
        "description": "Color and Shape | Juried Online Art Exhibition\\nPosted\\nSeptember 29th, 2025\\nUPWARD Gallery invites artists to submit artwork for our juried online art exhibition, Color and Shape.\\nThe exhibition explores the harmonious or conflicting relationships between color and shape, as well as the use of color to express mood and identity.\\nWe welcome submissions from a variety of media, including but not limited to: painting, drawing, digital painting, sculpture, printmaking, photography, textiles, and mixed media.\\nAwards: Interviews and other publications are featured in the print edition of UPWARDs magazine and on the website, digital certificate, and personal artist page on the gallery website. The exhibition will be promoted online via our website and social media channels. All artists retain 100% of sales with inquiries directed to them.\\nVisit\\nhttps://upwardgallery.com/ad/competitions/118/color-and-shape\\nfor a full information.\\nThe UPWARD Gallery was founded in 2021. Our online platform is designed to share art with new audiences using modern technologies. We assist emerging artists in gaining recognition and established artists in expanding their influence.\\nDetails\\nOrganization/Company:\\nUPWARD Gallery\\nWebsite:\\nhttps://upwardgallery.com\\nLocation:\\nOnline\\nDeadline:\\n10/14/2025\\nHow to Apply:\\nhttps://upwardgallery.com/ad/competitions/118/color-and-shape\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Blue Art Competition",
        "organization": "Artist Space Gallery",
        "location": "N/A",
        "deadline": "October 22, 2025",
        "url": "https://azarts.gov/arts-op/blue-art-competition/",
        "description": "Blue Art Competition\\nPosted\\nSeptember 29th, 2025\\nWe are pleased to announce our third Blue online Art Competition for the month of October 2025. The theme may feature any work that interprets the color blue or its various shades as either a primary or secondary element. All visual art mediums are allowed.\\nIn addition to the selected artists, the jury will select award winners in the following art categories: painting, photography, sculpture. All selected artists will receive a digital award certificate. An article about each artist will be displayed alongside the best of show and three winners. The best of show will be displayed on the poster of the exhibition. Judging the artwork will be based on the following criteria: creativity, originality and quality of art, overall design, demonstration of artistic ability, and usage of medium. The jury will not consider artworks with pornographic or satanic content. Entry fees are $20 for two pieces of artwork. You may submit more than two images; there is no limit to the number of images an artist may submit. The application deadline is October 22, 2025.\\nDetails\\nOrganization/Company:\\nArtist Space Gallery\\nWebsite:\\nhttps://artistspacegallery.com/_blue-2/\\nLocation:\\nOnline\\nDeadline:\\nOctober 22, 2025\\nHow to Apply:\\nUpload an image of your artwork (up to 2.0 MB)\\nInclude a short biography with your artwork, along with your artist statement\\nFill out all information required\\nSubmit your artwork\\nYour will be redirected to Pay Pal for payment\\nAfter your payment is complete, you will receive a confirmation email\\nTags:\\nCalls for Public Art\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "City of Peoria Call to Artists | Request for Qualifications (RFQ)  Public Art at Park West",
        "organization": "City of Peoria Arts &Culture",
        "location": "N/A",
        "deadline": "11/14/2025",
        "url": "https://azarts.gov/arts-op/city-of-peoria-call-to-artists-request-for-qualifications-rfq-public-art-at-park-west/",
        "description": "City of Peoria Call to Artists | Request for Qualifications (RFQ)  Public Art at Park West\\nPosted\\nSeptember 29th, 2025\\nThe Peoria Arts & Culture Department invites artists and or artist teams to submit qualifications to be considered for a permanent public art opportunity located at Park West in Peoria, Arizona. The final selected artist(s) will create a permanent art installation at the site. Artists working in the states of: Arizona, California, Colorado, Utah, Nevada, and New Mexico; United States, who have experience designing, fabricating, and installing projects with a similar budget ($150,000) and scope, are encouraged to apply.\\nPeoria Arts & Culture is seeking to contract with an artist to design, fabricate, and install an artistic feature at Park West which is located at 9744 W Northern Ave, Peoria, AZ 85345. Peorias flagship lifestyle destination, blending shopping, dining, and entertainment into one vibrant experience.\\nAnchored by a 14-screen Harkins Theatre, the center features a curated mix of over 30 tenants, including national brands to distinctive local retailers, wellness studios, indoor recreation, and a diverse culinary lineupfrom upscale sit-down restaurants to casual eateries and quick bites.\\nBeyond retail, Park West fosters community connection through seasonal events, local markets, and family-friendly attractions like the splash pad, open daily during warmer months. The centers beautifully landscaped outdoor spaces and generous parking make exploring its walkable, open-air layout both convenient and enjoyable. Whether youre looking to browse, dine, unwind, or celebrate, Park West offers experiences for everyone.\\nThis public art project will be located near the entrance of Park West in Peoria, Arizona. Due to limited space within this open-air shopping destination, city staff have identified kinetic art as the best potential fit. While open to other forms of three-dimensional sculpture, kinetic art has been specifically identified as the perfect complement to be featured on the premises. An emphasis on complementing the existing aesthetic is also a project priority of this commission. Discussions with location management also underscore a shared preference for art that will incorporate motion. Consequently experience creating functional or interactive artwork is highly desired.\\nDetails\\nOrganization/Company:\\nCity of Peoria Arts &Culture\\nWebsite:\\nhttps://www.peoriaaz.gov/government/departments/arts-culture/arts\\nLocation:\\nPeoria, AZ\\nDeadline:\\n11/14/2025\\nHow to Apply:\\nApplications open 10/1/25 and can be submitted at the following site:\\nhttps://cityofpeoriaaz.submittable.com/submit/e96df8dd-d0c7-400e-80dd-de74c2f0168e/call-to-artists-request-for-qualifications-rfq-public-art-at-park-west\\nTags:\\nCalls for Public Art\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Budget & Grantwriting Workshop at CALA Alliance",
        "organization": "CALA Alliance",
        "location": "N/A",
        "deadline": "October 2, 2025",
        "url": "https://azarts.gov/arts-op/budget-grantwriting-workshop-at-cala-alliance/",
        "description": "Budget & Grantwriting Workshop at CALA Alliance\\nPosted\\nSeptember 23rd, 2025\\n\\nThe location of this workshop has changed since it was originally announced. The new location is listed below.\\nThursday, October 2\\n7:00 PM\\nAfternoons Studio\\n2811 N 7th Avenue\\nPhoenix, AZ 85007\\nRSVP\\nBudget & Grant Writing:\\nTransform your ideas into fundable projects.\\nJoin us for a session co-facilitated by Delia Ibaez, Artist Programs Coordinator at the Arizona Commission on the Arts, and Roman, Executive Director of CALA Alliance. Youll learn how to create clear, purposeful budgets and use accessible tools to write strong grant applications that effectively communicate and support your artistic vision.\\nWell also talk about the upcoming\\nArtist Opportunity Grant\\nfrom the Arizona Commission on the Artswhat it funds, who can apply, and how to strengthen your application.\\nThis workshop is presented by CALA Alliance in partnership with the Arizona Commission on the Arts.\\nDetails\\nOrganization/Company:\\nCALA Alliance\\nWebsite:\\nhttps://www.calaalliance.org/\\nLocation:\\nPhoenix, AZ\\nDeadline:\\nOctober 2, 2025\\nHow to Apply:\\nTags:\\nProfessional Development/Education\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Join us for a preliminary report on the first phase of our strategic planning process!",
        "organization": "Arizona Commission on the Arts",
        "location": "N/A",
        "deadline": "September 25, 2025",
        "url": "https://azarts.gov/news/join-us-for-a-preliminary-report-on-the-first-phase-of-our-strategic-planning-process/",
        "description": "Join us for a preliminary report on the first phase of our strategic planning process!\\nPosted\\nSeptember 16th, 2025\\nThe Arizona Commission on the Arts has completed the first phase of its\\nAZArts GPS\\nstrategic planning process. On Thursday, September 25, 2025, the staff of the Arizona Commission on the Arts will offer a preliminary report to their board of commissioners on this first phase, including listening sessions in 19 Arizona communities and a public feedback survey that received over 1,000 responses!\\nThis presentation will be part of the Arts Commissions quarterly board meeting. These meetings are always open to the public, but we hope youll take special interest in this opportunity to learn about our strategic planning process and how you and your fellow Arizonans are helping us map a course for the future of the arts in Arizona.\\nArizona Commission on the Arts\\nQuarterly Board Meeting\\nThursday, September 25, 2025\\n1:00  4:00 pm\\nJOIN THE MEETING\\nDetails\\nOrganization/Company:\\nArizona Commission on the Arts\\nWebsite:\\nhttps://azarts.gov/\\nLocation:\\nPhoenix, AZ\\nDeadline:\\nSeptember 25, 2025\\nHow to Apply:\\nTags:\\nOther\\nRecent News\\nJoin us for a preliminary report on the first phase of our strategic planning process!\\nStronger Together: National Arts in Education Week 2025\\nState Invests $2.5 Million in Nonprofit Arts & Culture Sector\\nRecent News\\nPress Releases\\nState Invests $2.5 Million in Nonprofit Arts & Culture Sector\\nState Continues Award-winning State Park Artist Residency Program\\nGovernors Budget Proposes Ongoing Funding for the Arts\\nPress Releases\\nPress Resources\\nWorking on a news story about the Arizona Commission on the Arts? Find additional graphics, images and resources on our Press Resources page.\\nPress Resources"
    },
    {
        "title": "Unfurl Your Creativity | Artsy International Juried Art Competition | TERAVARNA",
        "organization": "TERAVARNA",
        "location": "N/A",
        "deadline": "12/15/2025",
        "url": "https://azarts.gov/arts-op/unfurl-your-creativity-artsy-international-juried-art-competition-teravarna/",
        "description": "Unfurl Your Creativity | Artsy International Juried Art Competition | TERAVARNA\\nPosted\\nSeptember 12th, 2025\\nWant to sell your artworks for free but dont know where to look for them? TERAVARNAs Artsy International Juried Art Competition is here to guide and support your creative journey. Theme? We decided to go with an open theme so that artists can bring on new ideas or celebrate the traditional ones! This time, sell your art on the esteemed art marketplace, Artsy, without listing fees! Submit with a nominal entry fee of $9/artwork before the deadline of December 15, 2025!\\nDetails\\nOrganization/Company:\\nTERAVARNA\\nWebsite:\\nhttps://www.teravarna.com/\\nLocation:\\nOnline\\nDeadline:\\n12/15/2025\\nHow to Apply:\\nThe process to participate in the Artsy International Juried Art Competition is fairly simple. Heres how you can apply:\\nStep 1: Decide the total number of artworks you are willing to submit to the competition. A maximum of 10 uploads is accepted in a single submission.\\nStep 2: Visit the website of TERAVARNA and choose the number of artwork(s) you are willing to submit. With payment options like those of PayPal or your credit card, carry out your transactions seamlessly.\\nStep 3: Post successful payment, the server will redirect you to a different page where you can upload your artworks and mention other necessary details.\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "In Person Exhibition  | Art Comes Alive 2025",
        "organization": "ADC Fine Art",
        "location": "N/A",
        "deadline": "10/03/2025",
        "url": "https://azarts.gov/arts-op/in-person-exhibition-art-comes-alive-2025/",
        "description": "In Person Exhibition  | Art Comes Alive 2025\\nPosted\\nSeptember 12th, 2025\\nFor over 30 years, its been ADCs mission to support living artists, and ACA (Art Comes Alive) does just that. Now entering its 16th year, ACA has earned its reputation as the Academy Awards for Art, and its only getting bigger\\nHeld inside our stunning 13,000 sq. ft. gallery in Cincinnatis vibrant Over-the-Rhine district, an artistic hub bursting with creativity, ACA is a career-making opportunity for contemporary artists.\\nThis one-of-a-kind event connects artists with the people who can elevate their careers: interior designers, gallery owners, private collectors, corporate art buyers, and more. Each year, ACA grows in size, prestige, and and influence  and this year promises to be the biggest yet, featuring:\\n Over $450,000 in awards,\\n New jurors,\\n More exposure, opportunities, and ways to get your work seen and sold\\nIf youre ready to take your art career to the next level, ACA 2025 is your moment!\\nDetails\\nOrganization/Company:\\nADC Fine Art\\nWebsite:\\nhttps://adcfineart.com\\nLocation:\\nCincinnati, OH\\nDeadline:\\n10/03/2025\\nHow to Apply:\\nApply Here: https://artist.callforentry.org/festivals_unique_info.php?ID=15857\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "NEW Community Engaged Practice 2-Week Residency Programs 2026  Mexico & Peru",
        "organization": "Arquetopia Foundation & International Artist Residency",
        "location": "N/A",
        "deadline": "Wednesday, October 15, 2025",
        "url": "https://azarts.gov/arts-op/new-community-engaged-practice-2-week-residency-programs-2026-mexico-peru-2/",
        "description": "NEW Community Engaged Practice 2-Week Residency Programs 2026  Mexico & Peru\\nPosted\\nSeptember 12th, 2025\\nNEW Community Engaged Practice 2-Week Residency Programs 2026  Mexico & Peru\\nhttps://www.arquetopia.org/special-themed-residency-programs\\ninfo@arquetopia.org\\nArquetopia is excited to announce the launch of VAACA (Vinculacin Acadmica, Artstica y Comunitaria de Arquetopia), our new area of Community Engaged Practice. This initiative focuses on strengthening educational and artistic connections with diverse sectors, fostering the shared responsibility of participating in healthy cultural ecosystems. Through VAACA, we will expand our collaborations with museums and cultural institutions, share our critical perspectives, and build meaningful bridges with cultural heritage.\\nAs part of this effort, we are introducing a series of new residencies that bring critical perspectives to artistic practice, with a special focus on non-dominant forms of knowledge that have historically been ignored. These programs highlight reciprocal learning, encourage situated practices, and invite participants to engage with culture as a living and dynamic system.\\nUpcoming Programs\\nBotany and the Mapping of Ignorance (2026): An immersive two-week learning program that rethinks the history of botany through the lens of colonial knowledge and ecological interdependence.\\nUnmaking Power, Remaking Worlds: A two-week guided art program designed as a cultural ecosystem, where art, knowledge, and community practices intersect to generate new possibilities for inhabiting the world.\\nDay of the Dead (2026): A two-week immersive learning program centered on the practices, rituals, and ancestral knowledge of Da de Muertos, combining Spanish language learning, tasting, and creating as pathways into cultural memory and continuity.\\nThrough these new initiatives, Arquetopia continues to nurture critical dialogue, collective learning, and the creation of new methodologies rooted in reciprocity and cultural awareness. Dont hesitate to contact us for more information.\\ninfo@arquetopia.org\\nDetails\\nOrganization/Company:\\nArquetopia Foundation & International Artist Residency\\nWebsite:\\nhttps://www.arquetopia.org/special-thematic-residency-programs\\nLocation:\\nOaxaca, Mexico / Puebla, Mexico / Cusco, Peru\\nDeadline:\\nWednesday, October 15, 2025\\nHow to Apply:\\nHOW TO APPLY\\nVisit the Arquetopia Foundation website at https://www.arquetopia.org\\nE-mail us at info@arquetopia.org\\nComplete and submit the Arquetopia Artist-in-Residence Online Application Form https://www.arquetopia.org/residency-application, following the instructions indicated.\\nFollowing selection, applicants are notified immediately via e-mail.\\nTags:\\nResidencies\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Special Residencies for Artists, Designers, Art Historians & Researchers (Independent or Master Instructed)  2025 & 2026  Oaxaca, Mexico / Puebla, Mexico / Cusco, Peru",
        "organization": "Arquetopia Foundation & International Artist Residency",
        "location": "N/A",
        "deadline": "Wednesday, October 15, 2025",
        "url": "https://azarts.gov/arts-op/special-residencies-for-artists-designers-art-historians-researchers-independent-or-master-instructed-2025-2026-oaxaca-mexico-puebla-mexico-cusco-peru/",
        "description": "Special Residencies for Artists, Designers, Art Historians & Researchers (Independent or Master Instructed)  2025 & 2026  Oaxaca, Mexico / Puebla, Mexico / Cusco, Peru\\nPosted\\nSeptember 12th, 2025\\nSpecial Residencies for Artists, Designers, Curators, Art Historians, Researchers (Independent or with Master Instruction)  2025 & 2026  Puebla, Mexico / Oaxaca, Mexico / Cusco, Peru\\nSpaces are limited, and selection is first-come, first-served. Residency applications are evaluated for selection as they are received.\\nWebsite:\\nhttps://www.arquetopia.org/open-calls-deadlines\\nE-mail\\ninfo@arquetopia.org\\nfor more information.\\nNow in its 15th year, Arquetopia Foundation https://www.arquetopia.org is a multiple award-winning nonprofit arts and cultural foundation with a social scope that is internationally established on three continents. Our mission emphasizes critical thinking, a commitment to reciprocity, and a sense of ethics at the core of all artistic practices. Our customized, professional International Artist-in-Residence Programs https://www.arquetopia.org/residencies-general-info are among the largest and most reputable worldwide. All of our multinational artist residency programs are unique, with an array of content anchored in local knowledge, critical academic perspectives, and a solid structure of collaborations with prominent cultural institutions, renowned experts, and notable artists. Our residency sites are located in four distinct cultural regions selected for their historical importance, influence and artistic contribution to the world: Puebla and Oaxaca in Mexico, Cusco in Peru, and Naples in southern Italy.\\nThrough the years, we have successfully created a generous space where different perspectives meet and address important questions on the legacy of art history and the current state of the world. We are proud to have established through our multiple residency programs a generous and culturally diverse space by hosting every year artists, scholars, and researchers from the Americas, Europe, Asia, Africa and Australia. Our experience has been enriched by the multiplicity of perspectives of more than 1200 of our resident artists and writers who have come from all regions of the world and more than 100 countries. Our residency programs offer competitive professional opportunities for emerging and mid-career, national and international artists, designers, curators, art historians, art educators, writers, journalists, and cultural researchers age 20 and over.\\nArquetopia is distinguished worldwide for its array of unique residency programs with substantial content. Our residency spaces function exclusively for productive art professionals, writers, and researchers and include structured, informative programs; a network of collaborative workspaces, institutions, and studios; and personalized project support.\\nTESTIMONIALS FROM OUR PAST RESIDENT ARTISTS\\nFor profiles, feedback and testimonials from many of our outstanding past resident artists, art historians, and writers, dont miss this page on our website: Arquetopia Foundation: Our Resident Artists\\nhttps://www.arquetopia.org/our-resident-artists\\nArquetopia Foundation is now welcoming applications for the following residency programs in the majestic central historic district of Puebla, Mexico; the open countryside of Oaxaca, Mexico; and the Sacred Valley of the Andes of Cusco, Peru, for all dates in 2025 and 2026. Click on each link below for program info on our website.\\nPART 1  SPECIAL RESIDENCIES FOR ARTISTS, DESIGNERS, ART HISTORIANS, CURATORS, WRITERS & RESEARCHERS, 2025 & 2026:\\nA. Arquetopia Immersive Learning Residency Program 2025  Botany and the Mapping of Ignorance (Puebla)\\nhttps://www.arquetopia.org/special-thematic-residency-programs\\nFlexible dates. This 2- or 3-week intensive program encompasses a comprehensive structure aimed at enriching participants understanding of herbalist techniques and local plant knowledge, including their historical significance, all approached through the lens of agnotology.\\nPART 2  RESIDENCIES FOR ARTISTS, DESIGNERS, ART HISTORIANS, CURATORS & RESEARCHERS: SPACES IN 2025 & 2026 (MENTORED, NON-INSTRUCTIONAL)\\nB. Guided Art, Design, or Photography Residency (Puebla, Oaxaca, or Cusco).\\nhttps://www.arquetopia.org/art-design-or-photography-residency\\nFlexible sessions of 3 to 6 weeks; various techniques supported.\\nC. Mexican Ceramics Residency (Puebla).\\nhttps://www.arquetopia.org/mexican-ceramics-residency\\nMaster ceramicist supervised. Sessions of 5 weeks.\\nD. Printmaking Residency (Puebla).\\nhttps://www.arquetopia.org/printmaking-residency\\nMaster printer supervised. Flexible sessions of 4 to 5 weeks.\\nE. Art Educators Residency (Puebla).\\nhttps://www.arquetopia.org/art-educators-residency\\nDevelop educational projects and pedagogic methods with university students in Pueblas historic capital. Self-directed (staff-assisted). Sessions of 4 weeks.\\nF. Art History or Cultural Research Residency (Puebla).\\nhttps://www.arquetopia.org/art-history-or-cultural-research-residency\\nExplore magnificent southern Mexicos unique archives and resources from pre-Hispanic to contemporary. Self-directed (staff-assisted), flexible sessions of 3 to 5 weeks.\\nPART 3  ARTIST RESIDENCIES WITH INTENSIVE TECHNIQUE INSTRUCTION BY LOCAL MASTER ARTISTS: SPACES IN 2025 & 2026\\nG. Electroetching Instructional Residency (Puebla).\\nhttps://www.arquetopia.org/electroetching-residency\\nLearn Electroetching techniques from a Mexican master, with time for independent production in various other printmaking techniques. Extendable sessions of 3 weeks.\\nH. Gold Leafing & Estofado Instructional Residency (Puebla).\\nhttps://www.arquetopia.org/gold-leafing-residency\\nLearn an array of Gold Leafing (Gilding) and Estofado techniques from a Mexican master, with time for independent production. Extendable sessions of 3 weeks.\\nI. Mexican Jewelry & Silversmithing Instructional Residency (Oaxaca).\\nhttps://www.arquetopia.org/mexican-jewelry-residency\\nLearn jewelrymaking and silversmithing from a Mexican master, with time for independent production. Extendable sessions of 3 weeks.\\nJ. Mexican Textiles Instructional Residency: Weaving or Embroidery (Oaxaca).\\nhttps://www.arquetopia.org/mexican-textiles-residencies\\nLearn traditional Mexican Weaving or Embroidery from a Mexican master, with time for independent production. Extendable sessions of 3 weeks.\\nK. Mexican Textiles Instructional Residency: Tapestry (Oaxaca).\\nhttps://www.arquetopia.org/mexican-textiles-residencies\\nLearn traditional Mexican Tapestry from a Mexican master, with time for independent production. Sessions of 4 weeks.\\nL. Natural Ink Silkscreen Instructional Residency (Puebla).\\nhttps://www.arquetopia.org/natural-ink-silkscreen-residency\\nLearn to create and use a variety of Natural Inks specifically for silkscreening, from a Mexican master, with time for independent production. Extendable sessions of 3 weeks.\\nM. Natural Pigments Instructional Residency (Oaxaca or Cusco).\\nhttps://www.arquetopia.org/natural-ink-silkscreen-residency\\nLearn to create and use a variety of Natural Pigments for fiber dyeing, from a Mexican or Peruvian master, with time for independent production. Extendable sessions of 3 weeks.\\nN. Organic Painting Instructional Residency (Puebla).\\nhttps://www.arquetopia.org/organic-painting-residency\\nLearn an array of Organic Painting techniques from a Mexican master, with time for independent production. Extendable sessions of 3 weeks.\\nO. Peruvian Textiles Instructional Residency: Andean Weaving (Cusco).\\nhttps://www.arquetopia.org/peruvian-textiles-residency\\nLearn traditional Andean Weaving from a Peruvian master, with time for independent production. Extendable sessions of 3 weeks.\\nP. Pre-Columbian Ceramics Instructional Residency (Puebla or Cusco).\\nhttps://www.arquetopia.org/pre-columbian-ceramics-residency\\nLearn pre-Columbian Ceramics techniques from a Mexican or Peruvian master, with time for independent production. Extendable sessions of 5 weeks.\\nArquetopia is committed to providing an inclusive and welcoming environment for all members of our diverse local and international community. Arquetopias resident artist and staff backgrounds vary in all aspects. As part of Arquetopias mission is to promote diversity, Arquetopia actively fights discrimination by offering access to its programs and activities without regard to race, color, gender or gender expression, national origin, age, religion, creed, or sexual orientation.\\nMain Website:\\nhttps://www.arquetopia.org\\nInstagram:\\nhttps://www.instagram.com/arquetopia\\nFacebook:\\nhttps://www.facebook.com/arquetopia\\nDetails\\nOrganization/Company:\\nArquetopia Foundation & International Artist Residency\\nWebsite:\\nhttps://www.arquetopia.org/current-calls\\nLocation:\\nOaxaca, Mexico / Puebla, Mexico / Cusco, Peru\\nDeadline:\\nWednesday, October 15, 2025\\nHow to Apply:\\nVisit the Arquetopia Foundation website at https://www.arquetopia.org\\nE-mail us at info@arquetopia.org\\nComplete and submit the Arquetopia Artist-in-Residence Online Application Form https://www.arquetopia.org/residency-application, following the instructions indicated.\\nFollowing selection, applicants are notified immediately via e-mail.\\nTags:\\nResidencies\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "2026 Namingha Institute Master Class | Museum of Northern Arizona",
        "organization": "Museum of Northern Arizona",
        "location": "N/A",
        "deadline": "01/11/2026",
        "url": "https://azarts.gov/arts-op/2026-namingha-institute-master-class-museum-of-northern-arizona/",
        "description": "2026 Namingha Institute Master Class | Museum of Northern Arizona\\nPosted\\nSeptember 12th, 2025\\nThe Museum of Northern Arizona invites applications for the 2026 Namingha Institute Master Class, honoring the Namingha familys commitment to supporting and nurturing young artists. This two-week residency provides six artists with a stimulating environment to explore diverse media, draw inspiration from the Colorado Plateau, and connect with master artists.\\nDates: April 26  May 10, 2026\\nLocation: Museum of Northern Arizona in Flagstaff, AZ\\nBenefits: $1,500 stipend, lodging, and one-on-one instruction with master artists, who may invite other distinguished artists to instruct at their discretion. Participants will also tour MNAs Platinum LEED-certified Easton Collection Center and engage directly with the regions cultural and natural heritage.\\nApplication instructions available on MNAs website\\nwww.musnaz.org/namingha\\nDetails\\nOrganization/Company:\\nMuseum of Northern Arizona\\nWebsite:\\nhttps://musnaz.org/namingha/\\nLocation:\\nFlagstaff, AZ\\nDeadline:\\n01/11/2026\\nHow to Apply:\\nEmail all application materials as a PDF to NaminghaInstitute@musnaz.org. Include: letter of interest, artist statement, resume, portfolio and optional letter of support. Download application instructions on MNA's website https://musnaz.org/namingha/\\nTags:\\nResidencies\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call to Artist | Herberger Theater Galleries | Barrio Exhibit",
        "organization": "Herberger Theater Center",
        "location": "N/A",
        "deadline": "11/14/25",
        "url": "https://azarts.gov/arts-op/call-to-artist-herberger-theater-galleries-barrio-exhibit/",
        "description": "Call to Artist | Herberger Theater Galleries | Barrio Exhibit\\nPosted\\nSeptember 12th, 2025\\nThe Herberger Theater Center is accepting submissions for its Barrio Exhibit. Open to Arizona artists, ages 18+, in the following mediums: painting, drawing, printmaking, mixed media, glass, photography, gicles of paintings and sculpture in both traditional approaches and new techniques.\\nThe Barrio Exhibit celebrates the vibrant culture, history, and resilience of Latino communities. Through art, photography, music, and personal stories, the exhibit captures the essence of life in the barrio  highlighting traditions, struggles, triumphs, and the powerful sense of identity that unites generations.\\nFor application and guidelines, visit\\nhttps://herbergertheater.org/artistic-opportunities/\\nDetails\\nOrganization/Company:\\nHerberger Theater Center\\nWebsite:\\nhttps://herbergertheater.org/\\nLocation:\\nPhoenix, AZ\\nDeadline:\\n11/14/25\\nHow to Apply:\\nThere are TWO options to apply:\\n1. Submit online through our website, https://www.herbergertheater.org/artistic-opportunities/\\n2. Submit by mail; download application at https://herbergertheater.org/wp-content/uploads/2025/09/Barrio-Call.pdf\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "International Art Competition Animals",
        "organization": "Art Room Gallery",
        "location": "N/A",
        "deadline": "October 02, 2025",
        "url": "https://azarts.gov/arts-op/international-art-competition-animals/",
        "description": "International Art Competition Animals\\nPosted\\nSeptember 12th, 2025\\nContemporary Art Room Gallery is proud to announce their 9th Animals Online Art Competition for the month of October 2025. This is an international competition and artists from around the world are welcome to submit their work. Through this call artists and photographers are invited to present their best artworks related to the world of animals. A variety of interpretations of Animals theme can be submitted (representative, abstract, conceptional). All visual art mediums are acceptable (painting, photography, drawing, sculpture, digital, prints, fiber art, collage or installation art) except sound and video art. Winning artwork (First place) will be on the poster of the show. All selected artists will receive a digital award certificate. The deadline to apply to this art competition is October 02 2025.\\nDetails\\nOrganization/Company:\\nArt Room Gallery\\nWebsite:\\nhttps://artroomgalleryonline.com/call_for_artistss.html\\nLocation:\\nOnline\\nDeadline:\\nOctober 02, 2025\\nHow to Apply:\\n- Artwork images should be labeled as: First Name-Last Name-Title of Art.jpg\\n- Image size should be up to 2.0 MB in JPG format.\\n- Only the artwork should be visible, clear and in focus. Please crop out any background in the images.\\n- Images must be original work created by the artist.\\nTags:\\nCalls for Public Art\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call for Entries | SONORAN HOURGLASS: Dawns Early Light",
        "organization": "Tohono Chul",
        "location": "N/A",
        "deadline": "10/12/2025",
        "url": "https://azarts.gov/arts-op/call-for-entries-sonoran-hourglass-dawns-early-light/",
        "description": "Call for Entries | SONORAN HOURGLASS: Dawns Early Light\\nPosted\\nSeptember 12th, 2025\\nA day is composed of 24 hours; split in half, the cycle is equal parts day and night, twelve-hour intervals  heralded by the transitional phases of dawn and dusk. The exhibition series SONORAN HOURGLASS will survey how time moves over the Sonoran Desert in the most obvious and subtle of ways  through the air: the light, the temperature, the mood, the pressure  through the landscape: the creatures, the water, the plants, the earth  through the cosmos. Using abstract notions and temporal quotients of past, present, and future, the classic form and function of an hourglass hearkens times effect in slow dissolution or methodical accretion, lending a timeless tone and romance to this project.\\nConcentrating on the timeframe of dawn and all its workings, Dawns Early Light is the first installment in the series, SONORAN HOURGLASS.\\nArtists from the region are invited to submit 2-dimensional or 3-dimensional works in any media for consideration in this curated exhibition. To learn more visit:\\nhttps://tohonochul.org/galleries/upcoming-events/\\nDetails\\nOrganization/Company:\\nTohono Chul\\nWebsite:\\nhttps://tohonochul.org\\nLocation:\\nTucson, AZ\\nDeadline:\\n10/12/2025\\nHow to Apply:\\nArtists may submit images of work digitally via email (exhibits@tohonochul.org). Artists may submit images of up to 3 artworks in JPEG format (at least 72 dpi, no more than 6 inches in any direction  If available: 300 dpi, no more than 6 inches in any direction).  Each image file should be renamed with the artists last name, first name, title of work, medium, size of the work (in inches), and price.\\nEntries must also contain a list of images that includes the title, date completed, media, dimensions, and price of each work submitted.\\nSubmitting artists must include a brief artist statement about the submitted work and an artist biography with complete contact information. These must be submitted in either a Word document or pasted within the body of the submission email.\\nPlease include Attn: SONORAN HOURGLASS: Dawns Early Light in the subject line of the email.\\nTo view the complete prospectus visit: https://tohonochul.org/wp-content/uploads/2025/09/SONORAN-HOURGLASS-Dawns-Early-Light_prospectus_2025.pdf\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call to Artists | Arizona Sunsets Outdoor Sculpture Exhibition",
        "organization": "Shemer Art Center",
        "location": "N/A",
        "deadline": "OCTOBER 31, 2025 Entry fee and images due by 5 pm",
        "url": "https://azarts.gov/arts-op/call-to-artists-arizona-sunsets-outdoor-sculpture-exhibition/",
        "description": "Call to Artists | Arizona Sunsets Outdoor Sculpture Exhibition\\nPosted\\nSeptember 12th, 2025\\nThe Shemer Art Center is now accepting submissions from Arizona sculptors for an outdoor exhibition titled Arizona Sunsets. This two-year exhibition will focus on contemporary outdoor sculpture featuring artworks that reflect and celebrate the colors of Arizonas desert skies. Artists are encouraged to think outside the box to create sculptures incorporating color and possibly even new technologies and/or viewer interactivity, such as soft, playful sounds or gentle illumination. The Shemer Art Center is quickly becoming a destination for outdoor sculptures in Arizona. Opening in 2026, this exhibition will be showcased and promoted for two years.\\nIconic architect Alfred Newman Beadle was best known for his Mid-Century home designs throughout the Phoenix area, but many may not know he was also an artist and he designed numerous sculptural works. His daughter, Gerri Beadle-Murray, along with colleagues of Al Beadle, will be jurying this exhibition.\\nDetails\\nOrganization/Company:\\nShemer Art Center\\nWebsite:\\nhttps://shemerartcenter.org/\\nLocation:\\nPhoenix, AZ\\nDeadline:\\nOCTOBER 31, 2025 Entry fee and images due by 5 pm\\nHow to Apply:\\nArtists are asked to submit up to three artworks in digital format for the jury process (conceptual or completed). A schematic/description of the work(s): size, composition, and how it will be installed to be structurally secure and safe for the viewing public. For complete details and to apply today please visit - https://shemerartcenter.org/opportunities/artist_opps/\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call for Art | Art in Revolt Magazine",
        "organization": "Art In Revolt Magazine",
        "location": "N/A",
        "deadline": "Ongoing",
        "url": "https://azarts.gov/arts-op/call-for-art-art-in-revolt-magazine/",
        "description": "Call for Art | Art in Revolt Magazine\\nPosted\\nSeptember 9th, 2025\\nArt In Revolt Magazine is always on the lookout for new artwork to feature in our magazine. We are a new quarterly arts and entertainment magazine. Our first print will be available Oct. 2025. Please check out our Instagram before applying to this call to ensure your artwork meets our aesthetic. There is a small onetime $10 application fee.\\nDetails\\nOrganization/Company:\\nArt In Revolt Magazine\\nWebsite:\\nhttps://www.instagram.com/art_in_revolt\\nLocation:\\nOnline/Print\\nDeadline:\\nOngoing\\nHow to Apply:\\nPlease click the link below to fill out the application. You will be directed to PayPal to make your payment before submitting your application.\\nhttps://docs.google.com/forms/d/e/1FAIpQLSf17e0XXOeY06PWkWIsdKTAZEUjFKMWR7l_qiToy9tCiKa6Rg/viewform?usp=header\\nTags:\\nOther\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call for Art | Holiday Small Works Show",
        "organization": "First Studio Gallery",
        "location": "N/A",
        "deadline": "October 15, 2025",
        "url": "https://azarts.gov/arts-op/call-for-art-holiday-small-works-show/",
        "description": "Call for Art | Holiday Small Works Show\\nPosted\\nSeptember 9th, 2025\\nAbout the Show\\nFirst Studio Gallery is excited to announce its inaugural Holiday Small Works Show & Sale!\\nWe invite artists to submit artwork that measures no larger than 12 x 12 (not including frame).\\nAll mediums and styles are welcome. Since this is a holiday show, sold artwork may be taken home by the patron at the time of purchase, and artists are encouraged to replace sold work with new pieces.\\nArtwork will be selected based on quality, diversity of style, use of materials, and artist participation in receptions.\\nImportant Dates\\n-Entry Period: August  October 15, 2025\\n-Notification to Artists: October 22, 2025 (via email)\\n-Artwork Drop-Off & Installation: November 1, 2025 | 10:0011:00 AM (other times by appointment)\\n-Show Dates: November 7, 2025  January 17, 2026\\nReceptions\\n-Opening Reception (First Friday): November 7, 2025 | 59 PM\\n-Holiday Reception (First Friday): December 5, 2025 | 59 PM\\n-Closing Reception (Third Friday): January 16, 2026 | 59 PM\\n(Artists may pick up work immediately following the reception.)\\n-Artwork Pick-Up: January 17, 2026 | 9:00 AM\\nFees\\n-Submission: Free to apply\\n-Participation Fee: $35 per artist for up to 3 accepted pieces\\n-Additional pieces: $10 each (for work beyond the first 3 accepted)\\n-Fees are due at drop-off.\\nSales\\nNo commission taken  artists keep 100% of their sales.\\nArtists handle sales directly with patrons.\\nArtists are expected to:\\n-Promote the show and receptions\\n-Invite art buyers and guests\\n-Attend, mingle, and bring refreshments for receptions\\nEntry Guidelines\\n-Artists may submit up to 3 works.\\n-Submit JPEG images labeled with: Artist Name_Title_Dimensions.\\n-Example: Kris Kollasch_Jazz It Up_12x12\\n-Image size: max 2 MB, or 6 inches on the longest side.\\n-Provide high-quality images, as accepted work will be promoted on social media.\\nEntry Form Information Required:\\nArtist Name (as it should appear on labels)\\nTitle, Size, Medium, and Price\\nContact Info (name, email, phone, website, social media)\\nConfirmation of availability to attend receptions (Nov 7, Dec 5, Jan 16\\nArtwork Requirements\\nMaximum size: 12 x 12 (x12) (excluding frame)\\nAll work must be professionally prepared:\\nLabel each piece with Name, Phone Number, and Title\\n2D work: wired for hanging (no sawtooth hangers)\\n3D work: max 30 lbs; large works must be installed by the artist\\nArtists are responsible for delivery and pick-up, or may arrange alternatives in advance by emailing FirstStudioGallery@gmail.com\\nDetails\\nOrganization/Company:\\nFirst Studio Gallery\\nWebsite:\\nhttps://sites.google.com/view/firststudiogallery/call-for-art/holiday-call-for-art\\nLocation:\\nPhoenix, AZ\\nDeadline:\\nOctober 15, 2025\\nHow to Apply:\\nApply through the online portal:\\nhttps://sites.google.com/view/firststudiogallery/call-for-art/holiday-call-for-art\\nQuestions:  FirstStudioGallery@gmail.com\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call for Art | A Show of Peace",
        "organization": "Arizona Art Alliance",
        "location": "N/A",
        "deadline": "December 20, 2025",
        "url": "https://azarts.gov/arts-op/call-for-art-a-show-of-peace/",
        "description": "Call for Art | A Show of Peace\\nPosted\\nSeptember 9th, 2025\\nIf art can be an act of resistance, it can also be a path to peace. A Show of Peace invites artists to create work that envisions the positive changes they long to see in the world. We seek artwork that reflects what brings you inner peaceand how that peace radiates outward into community, society, and nature.\\nThis exhibition will celebrate harmony, balance, and renewal through diverse artistic expressions. This includes themes inspired by sacred geometry and the natural world, reminding us of the universal patterns that connect all living things.\\nArtists are encouraged to submit works in all media and styles that embody peace, compassion, and hope. Together, these voices will create a contemplative space where art becomes an invitation to imagine a more harmonious future.\\nThis is a national call for art.\\nAll mediums, styles and sizes will be considered. All artwork, even if sold, must remain for the duration of the show, unless an exception is granted by the curator/s. Artwork will be chosen for the quality of work, diversity of style, use of material and expression.\\nArtwork outside of Arizona will be exhibited digitally in the gallery and on social media. However, if you live outside of Arizona and want to ship your artwork for inclusion in the in-person exhibition you may do so by making prior arrangements with FSG. All shipping fees and expenses are the responsibility of the artist. FSG will return artwork in the same packaging in which it was sent. Return shipping must be pre-paid by the artist.\\nImportant Dates\\nEntry close: midnight, December 20, 2025\\nNotification to Artists: January 5, 2026 via email\\nDROP OFF and Installation: January 17, 2026 | 10:00-11:00 AM\\nPick-Up Artwork: | Saturday March 28, 2026 | 9:00 AM\\nShow Dates: January 18, 2026  March 27, 2026\\nHours: weekdays 10 AM-4PM by appointment\\nOpening Reception: February 6 | 5-9PM\\nClosing Reception: March 6, 2026 | 5-9PM\\nSpecial event: Saturday, March 14, 2026 | Noon to 7:00 PM\\nFirst Studio Gallerys neighbor, Peace Pi will be hosting a special event. For tickets and details peacepi.com.\\nEntry Guidelines:\\nArtists are invited to enter up to three pieces of art.\\nLabel your jpeg images with your name, title and dimensions. Example: Kris Kollasch Jazz it Up 32 x 40\\nLimit the size of your images to no more than 2 MB, or 6-inches on the longest side.\\nThe accepted work will be on display at First Studio Gallery and promoted through social media. Be sure your images are high quality.\\nInformation you will need for your application:\\n Your Name, Title, Medium, Size, and Price (if selected, this info will be printed on the label).\\nYour contact info (email, phone number, web site and social media info)\\nConfirm your availability to attend at least one reception\\nA brief Biographical statement\\nA brief Artist statement\\nShow Fees:\\nThere is NO cost to submit to the show, however there is a participant fee of $35 per artist for up-to-3 pieces. This applies to only those artists whose work is accepted. Payment is due upon art drop-off. For artists outside of the area exhibiting digitally, we will send billing and payment information.\\nSales:\\nFirst Studio Gallery does not take a commission on sales. Sales are handled directly by the artist.\\nArtists are expected to promote the exhibition and events, invite guests, and attend the receptions.\\nArtwork:\\nArtwork will be chosen for the quality of work, relevance to show theme, diversity of style, and use of material. Artwork must not exceed 48 inches on the longest side.\\nArtwork must be professionally prepared:\\nLabel each piece with your Name, Phone Number and Title.\\n2D work must be wired for installation. No saw tooth hangers.\\n3D work must be no heavier than 30* pounds. Large works must be installed by the artist.\\nArtists are responsible for art delivery, and pick-up, or must make prior arrangements. Contact FirstStudioGallery@gmail.com with any questions.\\n*exceptions made on individual basis.\\nDetails\\nOrganization/Company:\\nArizona Art Alliance\\nWebsite:\\nhttps://azartalliance.com/a-show-of-peace-call-for-art/\\nLocation:\\nPhoenix, AZ and online/virtual\\nDeadline:\\nDecember 20, 2025\\nHow to Apply:\\nHere is the link to the full prospectus and entry form.\\nQuestions:  info@AzArtAlliance.com\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call for Choirs | Living Christmas Tree Choir",
        "organization": "Spotlight Community Theater",
        "location": "N/A",
        "deadline": "Open until filled",
        "url": "https://azarts.gov/arts-op/call-for-choirs-living-christmas-tree-choir/",
        "description": "Call for Choirs | Living Christmas Tree Choir\\nPosted\\nSeptember 9th, 2025\\nSpotlight Community Theater is seeking choirs to collaborate in creating a Living Christmas Tree Choir for this years production of The Best Christmas Pageant Ever.\\nSpotlight Community Theater is a faith-based theater company in Tucson. Each year, our productions carry a message of hope, love, and community, with a portion of our proceeds donated to charity. This December, we are thrilled to present The Best Christmas Pageant Ever.\\nAs part of this special event, our vision is to create a Living Christmas Tree Choir, a choir arranged in the shape of a Christmas tree that will lift up the joy of the season through song. This choir will be a central and beautiful part of our production, reinforcing the faith-based message of the show while giving our community something truly memorable.\\nDetails\\nOrganization/Company:\\nSpotlight Community Theater\\nWebsite:\\nhttps://spotlightcommunitytheater.com\\nLocation:\\nTucson, AZ\\nDeadline:\\nOpen until filled\\nHow to Apply:\\nSpotlightcommunitytheater.com\\nTags:\\nOther\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "American Youth Circus Regional Festival",
        "organization": "American Youth Circus Organization & Momentum Aerial",
        "location": "N/A",
        "deadline": "10/9/25",
        "url": "https://azarts.gov/arts-op/american-youth-circus-regional-festival/",
        "description": "American Youth Circus Regional Festival\\nPosted\\nSeptember 9th, 2025\\nThe American Youth Circus Organization (AYCO) is pleased to invite all Arizona youth, ages 8-20 to the AYCO Regional Festival in Flagstaff, AZ hosted by Momentum Aerial.\\nNo prior experience is necessary to join this three-day festival. AYCO Fest is packed with hands-on circus workshops, exciting activities, and a community showcase. Youll learn new skills and make new friends with circus youth from all over the region.\\nMomentum Aerial  Flagstaff, AZ\\nOct 9  11, 2025\\nFor ages 8-20 (no prior experience needed)\\nWhat to Expect:\\n1. Nine circus workshops designed just for you! Weve created the perfect mix of aerial, acrobatics, juggling, and more.\\n2. A supportive and fun circus community where youll connect with other youth.\\n3. A chance to perform in or watch the showcase and celebrate the joy of circus.\\nBONUS: Got a circus crew?\\nGroups get a discount! So grab your friends and join the fun.\\nDetails\\nOrganization/Company:\\nAmerican Youth Circus Organization & Momentum Aerial\\nWebsite:\\nhttps://www.momentumaerial.org/upcoming-events/2025/5/29/ayco-fest\\nLocation:\\nFlagstaff, AZ\\nDeadline:\\n10/9/25\\nHow to Apply:\\nApply here:\\nhttps://www.momentumaerial.org/upcoming-events/2025/5/29/ayco-fest\\nTags:\\nProfessional Development/Education\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call for Artists | Sedav Vaaki Museum",
        "organization": "S'edav Va'aki Museum",
        "location": "N/A",
        "deadline": "10/03/2025",
        "url": "https://azarts.gov/arts-op/call-for-artists-sedav-vaaki-museum/",
        "description": "Call for Artists | Sedav Vaaki Museum\\nPosted\\nSeptember 9th, 2025\\nSedav Vaaki Museum seeks artists who have a lived experience and rich connection with Native American tribes in Arizona, for an upcoming exhibition, Indigenous Identities. Artwork should explore the complexity, diversity, and resilience of indigenous voices though visual, sculptural, digital, or mixed media arts. We welcome work that reflects on cultural heritage, contemporary indigenous experiences, ancestral knowledge, sovereignty, language, and the ongoing relationship to land and community. Artists are encouraged to challenge stereotypes, reclaim narratives, and share stories that speak to identity in both personal and collective ways. Artwork may be previously created or newly proposed. The deadline for applications is October 3rd, 2025. Artists selected will be featured in an exhibition that will run from Fall 2026 through Summer 2027.\\nDetails\\nOrganization/Company:\\nS'edav Va'aki Museum\\nWebsite:\\nhttps://www.phoenix.gov/svmuseum\\nLocation:\\nPhoenix, AZ\\nDeadline:\\n10/03/2025\\nHow to Apply:\\nhttps://www.publicartist.org/call.cfm?id=7151\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Great Basin National Park Artist in Residences 2026",
        "organization": "Great Basin National Park Foundation",
        "location": "N/A",
        "deadline": "October 15, 2025",
        "url": "https://azarts.gov/arts-op/great-basin-national-park-artist-in-residences-2026/",
        "description": "Great Basin National Park Artist in Residences 2026\\nPosted\\nSeptember 4th, 2025\\nCall Overview\\nEntry Deadline: 10/15/25\\nCall Type:\\nResidencies\\nEligibility:\\nNational\\nState:\\nNevada\\nJury Dates:\\n11/1/25  12/1/25\\nBudget:\\nThe selected artists will be awarded housing (either camping or lodging) but no other stipend. The artists must pay for their own travel as well as food and other expenditures.\\nCall Description\\nArtists have played an important role in the formation, preservation, and enjoyment of national parks. Over a century ago, by painting landscapes of the American West, artists publicized many of the natural wonders of a land little known to an eastern populace. Their body of work helped to foster appreciation for these national wonders which ultimately resulted in the establishment of many national parks. Artists interpretation of park landscapes through many types of media connects people to these special places, which is an essential part of the preservation and protection of Americas national parks.\\nAt Great Basin National Park, artists will be surrounded by the natural beauty of the Park from the 13,063-foot summit of Wheeler Peak to the depths of Lehman Caves. The Park offers the solitude of the wilderness and provides expansive and renowned dark-sky stargazing. The sights, sounds, and textures of the environment, along with uninterrupted time, offer a respite from typical daily life and provide inspiration for creative work.\\nGreat Basin National Park is very remote. The closest town is Baker which has few to no amenities. Artists will find amenities in Ely, Nevada, 60 miles away.\\nWe are selecting 4 individuals from this call. Each residence will occur in 2026. The residencies are as follows:\\nSummer residence\\nThe artist may choose a 2-3 week residency during July and August. This is a CAMPING residency. Most camping gear is provided (tent, stove, cots, camp kitchen, etc).  Artists should be familiar and confident with camping prior to applying for this residency. A campsite will be provided. The artist may choose their preferred campground within the Park. Please be aware that internet service is unavailable and public WiFi at the visitor centers is spotty. Cell service is limited and varies between carriers. Pets and smoking are not allowed. Summer is a beautiful time within the Park, with much to explore.\\nFall residence\\nThe artist may choose a 2-3 week residency during September (camping) or November (housing). Please see CAMPING info above, and HOUSING info below. The September camping residency can take place during the Parks Astronomy Festival  a stellar event!\\nWinter residence\\nThe artist may choose a 2-3 week residency during January and February. This residency has Park housing. Lodging includes a furnished private bedroom within a shared living space (kitchen and bathroom). Washers and dryers are available and the kitchen includes major appliances (refrigerator, stove, sink) and basic utensils and dishes. The selected artist is responsible for bringing everything else they may need including all bedding. Please be aware that internet service is unavailable and there is limited public WiFi. Cell service is also limited and varies between carriers. Pets and smoking are not allowed. In winter the park is very quiet and likely to be covered with several feet of snow. A residence may choose to explore on snowshoes or cross country skis. Storms may make travel to amenities in Ely more difficult. In winter the Park is very quiet and much of the Park is covered with several feet of snow.\\nWe are selecting one\\nREGIONAL Artist-in-Residence (AIR)\\nfrom this call. The artist must live and work in Nevada or Utah and may apply for any season.\\nEach AIR will present at least one public program during their residency. The winter program may take place in a local school rather than the Park.\\nEach AIR will provide a digital portfolio of visual art, writing, music, or performance created during the residency. The digital portfolio will not be monetized, and exclusive rights will not be requested. Artists will always be credited with their work when digital items are used. Digital portfolios will be shared with Great Basin National Park and GBNPF.\\nEach AIR will donate one physical artistic piece (if applicable), along with a digital representation of the artistic piece within one year of their residency. The donation may be displayed in the Park for up to three years, after which it will be transferred to GBNPF for unrestricted use. Each AIR will provide a deed of gift to GBNPF for donated work(s) allowing rights to both digital & physical pieces.\\nArtists will be selected based upon their ability to interpret Great Basin National Park to the public, artistic integrity, and ability to reside in a remote location (camping and/or housing). Artists professional resume and personal statement should address the above to be competitive within this application  and specifically  Why Great Basin?\\nApplication Requirements\\nAll artists must submit:\\nA Professional Resume\\nA Personal Statement which includes Why Great Basin National Park? and includes a public program concept. Please also address your ability to reside in a remote location and work independently.\\nWork Sample Requirements\\nVisual Artists: Provide 6-12 images. Clearly label each image with your name, works title, medium, and dimensions.\\nWriters/Poets: Provide 6-12 short works or 1 long work. Clearly label each work with your name and its title. Examples include: Six Short Poems or other short writing samples of artistic merit (less than 1 page each) or One Short Story, Essay, or Manuscript Excerpt (10 pages max).\\nComposers, Musicians, Performing Artists, Video, Film: Provide no more than six short selections (about 6 minutes total) or 1 long selection (about 10 minutes total).\\nImages | Minimum: 0, Maximum: 12\\nAudio | Minimum: 0, Maximum: 6\\nVideo | Minimum: 0, Maximum: 6\\nTotal Samples | Minimum: 1, Maximum: 12\\nAll artists: All materials must be submitted through the online process. Additional materials or links to additional materials will result in disqualification.\\nEligibility Criteria\\nPlease apply for all seasons you would like to be considered for.\\nResidencies are open to visual artists, literary artists, musicians and other creative activity media artists.\\nThis call is open to artists that reside anywhere, but one spot each year will be held for a regional residence for an artist that lives and works in Nevada or Utah.\\nApply\\nApply now at\\nhttps://artist.callforentry.org/agreetoterms.php?ID=16008&ArtistFairID\\nMore Info\\nOrganization Website:\\nhttps://www.nps.gov/grba/index.htm\\nContact Email:\\ncontact@greatbasinfoundation.org\\nContact Phone:775-983-6171\\nDetails\\nOrganization/Company:\\nGreat Basin National Park Foundation\\nWebsite:\\nhttp://greatbasinfoundation.org/\\nLocation:\\nGreat Basin National Park, Nevada\\nDeadline:\\nOctober 15, 2025\\nHow to Apply:\\nApply at https://artist.callforentry.org/agreetoterms.php?ID=16008&ArtistFairID=\\nTags:\\nResidencies\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Sensorio, Famed California Immersive Art Experience, Issues Open Call to Artists | Seeking Innovative Works to Transform Expansive Open-Air Spaces",
        "organization": "Sensorio",
        "location": "N/A",
        "deadline": "October 10, 2025",
        "url": "https://azarts.gov/arts-op/sensorio-famed-california-immersive-art-experience-issues-open-call-to-artists-seeking-innovative-works-to-transform-expansive-open-air-spaces/",
        "description": "Sensorio, Famed California Immersive Art Experience, Issues Open Call to Artists | Seeking Innovative Works to Transform Expansive Open-Air Spaces\\nPosted\\nAugust 27th, 2025\\nAugust 19, 2025 (Paso Robles, Calif.,)  Sensorio, the internationally acclaimed immersive art destination located in the scenic heart of Californias Central Coast, is officially inviting artists, designers, and creators to submit proposals for new groundbreaking outdoor installations. With over 20,000 square feet of open exhibit space available, Sensorio is seeking innovative works that fuse light with landscape, designed specifically for nighttime use. The multi-sensory experience looks forward to submissions from a wide range of creators in its first international, open call for exhibit proposals.\\nSince its launch in 2019, Sensorio has become a global beacon for experiential art, show-casing works such as the celebrated exhibits Field of Light and Light Towers by acclaimed artist Bruce Munro, DIMENSIONS by the artist collective HYBYCOZO, and partnering with British award-winning composer Nainita Desai. Sensorio merges art, technology, and nature to create one-of-a-kind nighttime environments that delight, inspire, and transport visitors into new worlds. See submission details below on how your vision could become Sensorios next awe-inspiring display to light up the rolling fields of Paso Robles.\\nMore Details:\\nhttps://mailchi.mp/solterrastrategies.com/art-destination-sensorio-issues-call-for-artist-proposals\\nDetails\\nOrganization/Company:\\nSensorio\\nWebsite:\\nhttps://sensoriopaso.com/\\nLocation:\\nPaso Robles, CA\\nDeadline:\\nOctober 10, 2025\\nHow to Apply:\\nhttps://mailchi.mp/solterrastrategies.com/art-destination-sensorio-issues-call-for-artist-proposals\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "NEW Community Engaged Practice 2-Week Residency Programs 2026  Mexico & Peru",
        "organization": "Arquetopia Foundation & International Artist Residency",
        "location": "N/A",
        "deadline": "Wednesday, October 1, 2025",
        "url": "https://azarts.gov/arts-op/new-community-engaged-practice-2-week-residency-programs-2026-mexico-peru/",
        "description": "NEW Community Engaged Practice 2-Week Residency Programs 2026  Mexico & Peru\\nPosted\\nAugust 27th, 2025\\nNEW Community Engaged Practice 2-Week Residency Programs 2026  Mexico & Peru\\nhttps://www.arquetopia.org/special-themed-residency-programs\\ninfo@arquetopia.org\\nArquetopia is excited to announce the launch of VAACA (Vinculacin Acadmica, Artstica y Comunitaria de Arquetopia), our new area of Community Engaged Practice. This initiative focuses on strengthening educational and artistic connections with diverse sectors, fostering the shared responsibility of participating in healthy cultural ecosystems. Through VAACA, we will expand our collaborations with museums and cultural institutions, share our critical perspectives, and build meaningful bridges with cultural heritage.\\nAs part of this effort, we are introducing a series of new residencies that bring critical perspectives to artistic practice, with a special focus on non-dominant forms of knowledge that have historically been ignored. These programs highlight reciprocal learning, encourage situated practices, and invite participants to engage with culture as a living and dynamic system.\\nUpcoming Programs\\nBotany and the Mapping of Ignorance (2026): An immersive two-week learning program that rethinks the history of botany through the lens of colonial knowledge and ecological interdependence.\\nUnmaking Power, Remaking Worlds: A two-week guided art program designed as a cultural ecosystem, where art, knowledge, and community practices intersect to generate new possibilities for inhabiting the world.\\nDay of the Dead (2026): A two-week immersive learning program centered on the practices, rituals, and ancestral knowledge of Da de Muertos, combining Spanish language learning, tasting, and creating as pathways into cultural memory and continuity.\\nThrough these new initiatives, Arquetopia continues to nurture critical dialogue, collective learning, and the creation of new methodologies rooted in reciprocity and cultural awareness. Dont hesitate to contact us for more information.\\ninfo@arquetopia.org\\nDetails\\nOrganization/Company:\\nArquetopia Foundation & International Artist Residency\\nWebsite:\\nhttps://www.arquetopia.org/special-themed-residency-programs\\nLocation:\\nOaxaca, Mexico / Puebla, Mexico / Cusco, Peru\\nDeadline:\\nWednesday, October 1, 2025\\nHow to Apply:\\nE-mail us at info@arquetopia.org\\nTags:\\nResidencies\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Community Engaged Practice Programs",
        "organization": "VAACA-Arquetopia",
        "location": "N/A",
        "deadline": "12/31/2025",
        "url": "https://azarts.gov/arts-op/community-engaged-practice-programs/",
        "description": "Community Engaged Practice Programs\\nPosted\\nAugust 27th, 2025\\nArquetopia is excited to announce the launch of VAACA (Vinculacin Acadmica, Artstica y Comunitaria de Arquetopia), our new area of Community Engaged Practice. This initiative focuses on strengthening educational and artistic connections with diverse sectors, fostering the shared responsibility of participating in healthy cultural ecosystems. Through VAACA, we will expand our collaborations with museums and cultural institutions, share our critical perspectives, and build meaningful bridges with cultural heritage.\\nAs part of this effort, we are introducing a series of new residencies that bring critical perspectives to artistic practice, with a special focus on non-dominant forms of knowledge that have historically been ignored. These programs highlight reciprocal learning, encourage situated practices, and invite participants to engage with culture as a living and dynamic system.\\nUpcoming Programs\\nBotany and the Mapping of Ignorance (2026): An immersive two-week learning program that rethinks the history of botany through the lens of colonial knowledge and ecological interdependence.\\nUnmaking Power, Remaking Worlds: A two-week guided art program designed as a cultural ecosystem, where art, knowledge, and community practices intersect to generate new possibilities for inhabiting the world.\\nDay of the Dead (2026): A two-week immersive learning program centered on the practices, rituals, and ancestral knowledge of Da de Muertos, combining Spanish language learning, tasting, and creating as pathways into cultural memory and continuity.\\nDetails\\nOrganization/Company:\\nVAACA-Arquetopia\\nWebsite:\\nhttps://www.arquetopia.org\\nLocation:\\nMexico\\nDeadline:\\n12/31/2025\\nHow to Apply:\\ninfo@arquetopia.org\\nTags:\\nProfessional Development/Education\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Traffic Signal Cabinet Art Project",
        "organization": "City of Goodyear - Arts & Culture",
        "location": "N/A",
        "deadline": "October 13, 2025 by 11:59 p.m.",
        "url": "https://azarts.gov/arts-op/traffic-signal-cabinet-art-project/",
        "description": "Traffic Signal Cabinet Art Project\\nPosted\\nAugust 27th, 2025\\nThe city of Goodyear is seeking Arizona artists to aesthetically treat utility infrastructure throughout the community. Artists will transform traffic signal control cabinets in Goodyear from only being functional infrastructure to colorful, inspired works of art. The artwork will either be painted directly on the cabinet or created digitally as a vinyl wrap that will be applied to the cabinet.\\nCabinets are located on or near street corners where there are traffic signals. The placement of the cabinets makes them visible to both pedestrian and vehicular traffic. With this placement, the art should be graphically clear so that a passing car and those walking by at a leisurely pace can view it. Traffic signal cabinet locations are determined by the city of Goodyear and will be assigned to the selected artists.\\nCompensation:\\nPainted Cabinet: Artist will be compensated $2,000 for community outreach, design, materials, and time.\\nWrapped Cabinet: Artist will be compensated $1,200 for community outreach, design, materials, and time.\\nDetails\\nOrganization/Company:\\nCity of Goodyear - Arts & Culture\\nWebsite:\\nhttps://www.goodyearaz.gov/government/departments/parks-recreation/arts-culture/art-for-adults/call-to-artists-1718\\nLocation:\\nGoodyear, AZ\\nDeadline:\\nOctober 13, 2025 by 11:59 p.m.\\nHow to Apply:\\nInterested artists shall submit the following application materials no later than October 13, 2025 by 11:59 p.m.\\nSubmit your application: https://goodyearparksandrec.wufoo.com/forms/xb6hnt91ye20zy/\\nTags:\\nCalls for Public Art\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    },
    {
        "title": "Call for Art | IN THE PINK",
        "organization": "Art Fluent",
        "location": "N/A",
        "deadline": "12/12/2025",
        "url": "https://azarts.gov/arts-op/call-for-art-in-the-pink/",
        "description": "Call for Art | IN THE PINK\\nPosted\\nAugust 27th, 2025\\nTHEME\\nWere looking to celebrate everything pink can be. From soft and sweet to bold and in charge, pink does it all. We invite you to explore the many moods of pink. Show us your pink as the main character for IN THE PINK.\\nCALENDAR\\nJPEGs due by Friday, December 12, 2025 at midnight MST.\\nNotification of acceptance and online gallery opening by Friday, January 9, 2026.\\nAWARDS\\nAll accepted pieces will be displayed in our online gallery at www.art-fluent.com\\nBest of Show: $750\\nTwo Directors Choice awards: $250 each\\nELIGIBILITY\\nThis call is open to artists worldwide, both amateur and professional. Work that has been selected for previous exhibits with Art Fluent will not be considered.\\nRULES\\nWork that is copied or done under the guidance of an instructor is not eligible. Open to ALL fine art mediums (oil, acrylic, watermedia, pastel, drawing, printmaking, mixed media, photography, sculpture, fiber, wood, ceramics, film/video, digital art). AI will not be accepted. Diptychs and triptychs should be uploaded as a single image.\\nSELECTION PROCESS\\nDirectors choice. Each show is curated and juried by Creative Director, Amy Matteson Neill along with an anonymous committee of jurors. Please note, there is no personal feedback given by jurors.\\nNOTIFICATION\\nNotification will be done by email, everyone who submits will be notified of the jurors selections. If for any reason you do not hear from us by the notification date, please check the filters in your email account. Notification emails are sent to the email on file with CaF.\\nSALES\\nAll sales inquiries will be directed to the artists website and/or contact information. For any artwork that is sold, the artists receive 100% of the sale.\\nGIVING BACK\\nA portion of the proceeds from the entry fees is donated to organizations committed to the arts and supporting artists.\\nREQUIRED FORMS\\nCash awards over $600 are subject to federal income tax withholding within the United States. A W-9 form must be filled out by the winner and submitted to Art Fluent, Inc.\\nREGULATIONS\\nBy entering our calls for art through CaF you are agreeing to be added to Art Fluents email list for forthcoming artist opportunities. By submitting images, you agree that the images are your own work, nothing copied, you own all rights to the images, and you take full responsibility for the content of all images, including the likeness of recognizable individuals. The actual artwork will remain the property of the artist, our mission is to promote artists and their work. Should your work be accepted, you grant Art Fluent the right to reproduce your image on our website, on social media, and where appropriate to help promote further online opportunities. Art Fluent will always credit you and your copyright wherever feasible. We will not use your image for any other purpose without the artists permission.\\nDetails\\nOrganization/Company:\\nArt Fluent\\nWebsite:\\nhttps://art-fluent.com/calls-for-art/in-the-pink-prospectus/\\nLocation:\\nBoston, MA | Online\\nDeadline:\\n12/12/2025\\nHow to Apply:\\nENTRY PROCEDURE\\nEntry is done through CaF, a web-based service that allows artists to upload images and organize their artwork for submissions to galleries. To apply for a call, you must leave our website and go to the CaF website at www.callforentry.org where you can create a FREE artist account. You will add your details and upload your images to CaF and then you can submit work to IN THE PINK. If you have any questions, please contact us at hello@art-fluent.com we are happy to walk you through the process.\\nMEDIA PREPARATION\\nPlease only submit properly cropped images of your work that are in focus. We have a free resource for artists for tips on how to get high quality images of your work. Visit www.art-fluent.com/resources for a free download. CaF also offers tips on their blog which you can find here www.callforentry.org/photographing-artwork/.\\nAll images must be in JPEG/JPG format using CaF guidelines. The image size must be 1,200 pixels or greater on the longest side. Maximum file size is 5 mb.\\nAccepted video formats include MOV, MP4, WMV. Aspect ratio 4:3 or 16:9, resolution minimum 640x480, maximum 1920 x1080, bit rate recommended above 240 kbps, recommended frame rate 30 fps. File size must be under 100 MB. If your video work has been selected for the exhibit, we kindly request that you provide us with the file link via Vimeo. Please ensure the linked video is set to be shared publicly. Your video will not play if it is set to private.\\nTags:\\nExhibition Opportunities\\nSubmit an Arts Opportunity Listing\\nDo you have an opportunity you would like listed? Click the button below to fill out our form.\\nAdd a Listing"
    }
]