[
    {
        "title": "Call for Artists: Emerald Hills Park Public Art Project - Freelance, Artist Calls",
        "organization": "City of San Diego",
        "location": "San Diego",
        "deadline": "12/23/2025",
        "url": "https://arts.ca.gov/collective/city-of-san-diego-244-5-call-for-artists-emerald-hills-park-public-art-project/",
        "description": "Art Budget:\\nApproximately $70,000\\nEligibility\\n: Any artists or artist teams legally authorized to work in the U.S.\\nApplication Deadline:\\nDecember 22, 2025, 4:00 PM PST\\nThe City of San Diego is seeking applications from interested qualified artists to provide public art services for the Emerald Hills Park Public Art Project.  An artist or artist team is sought to design, fabricate and transport permanent, site-specific artwork for the park improvements and consult during installation of artwork at the site by the City.\\nLearn more and apply here:\\nhttps://www.sandiego.gov/economic-development/cultural-affairs/public-arts/opportunities-for-artists"
    },
    {
        "title": "Good Hart Artist Residency  Open Call for Residencies - Temporary, Artist Calls",
        "organization": "Good Hart Artist Residency",
        "location": "Other",
        "deadline": "01/13/2026",
        "url": "https://arts.ca.gov/collective/good-hart-artist-residency-242-4-good-hart-artist-residency-open-call-for-residencies/",
        "description": "Call Opens: December 1, 2025\\nDeadline for Application: January 13, 2026\\nThe Good Hart Artist Residency offers 1021 day residency stays to visual artists, writers, and composers at any stage of their career. Each resident is provided with a private residence and detached studio, a $500 stipend, a kitchen stocked with basic foods, several home-cooked meals from local hosts, and a quiet setting along the shores of Lake Michigan.\\nLocated along the scenic Tunnel of Trees in Northern Michigan, the residency is nestled in the woods just a short walk from the village of Good Hart. Residents can enjoy Lake Michigan, nearby dunes, and the areas inland lakes and wetlands. The residency typically hosts one artist at a time, offering the time, space, and solitude needed to focus and create.\\nThe open call deadline is January 13, 2026. Full details are available at https://goodhartartistresidency.org/apply-now/"
    },
    {
        "title": "Call to Artists: Carnival as Folklore Residency in New Orleans - Temporary, Artist Calls / Conferences/Workshops",
        "organization": "Kolaj Institute",
        "location": "Other",
        "deadline": "12/28/2025",
        "url": "https://arts.ca.gov/collective/kolaj-institute-242-4-call-to-artists-carnival-as-folklore-residency-in-new-orleans/",
        "description": "Carnival as Folklore\\nA five-day, in-person collage artist residency at Kolaj Institute in New Orleans\\nVirtual Sessions: Wednesdays, 14 and 21 January 2026, 7-9PM EST\\nIn Person: 4PM on Sunday, 25 January to 3PM on Friday, 30 January 2026\\nEarly Deadline to Apply: 14 December 2025. The Final Deadline (if space is available) is 28 December 2025. Submissions will be reviewed on a rolling basis until space is filled. Artists are encouraged to apply well before the deadline.\\nABOUT THE RESIDENCY\\nCarnival is a season of celebration and symbolic renewal that takes place each year, according to the Christian liturgical calendar, between Epiphany and Mardi Gras, ending on Ash Wednesday and the season of Lent, a period of solemn reflection and religious piety. During Carnival, social roles are reversed and norms are suspended; the jester becomes the king. Festivities are wide ranging and can include parades, street parties, formal balls, and cakes eaten only during that time of year. Carnivals traditions are rooted in ancient European festivals. Its 19th-century revival in the Americas parallels a time when people were rediscovering and reveling in Greek and Roman Mythology. As such, carnival is dripping with folklore. No place does Carnival like New Orleans, where the city comes alive in a mass display of collective effervescence.\\nDuring this in-person Artist Residency, collage artists will be invited to spend a week in New Orleans investigating Carnival as folklore and making art about it. Taking a broad view of collage and rooted in an understanding of Artist Practice, artists will hear a working theory of folklore; what it is; how it functions in communities; and the role artists can play in activating, transmitting, and celebrating folklore in communities as a form of cultural expression and a strategy for community resilience. Artists will learn how to identify and document folklore; make art in response to that folklore; build a context for the folklore; and develop strategies for getting that artwork to communities and into the larger ecosystem of Art.\\nFee: $750\\nTo apply, read the full Call to Artists\\nHERE\\n."
    },
    {
        "title": "Call to Artists: Folklore & Collage Virtual Residency 2025 - Temporary, Artist Calls / Conferences/Workshops",
        "organization": "Kolaj Institute",
        "location": "Other",
        "deadline": "12/06/2025",
        "url": "https://arts.ca.gov/collective/kolaj-institute-242-4-call-to-artists-folklore-collage-virtual-residency-2025/",
        "description": "Folklore & Collage Virtual Artist Residency\\nA four-week, virtual collage artist residency\\nSessions: Four Sundays starting 14 December 2025, 1-3PM EST\\nEarly Deadline to Apply: 30 November 2025\\nFinal Deadline to Apply: 6 December 2025\\nFolklore & Collage Residency is a four-week program designed to support artists who want to develop a practice that includes folklore in their artmaking. In four virtual meetings over four weeks and through ongoing, online discussion, we will explore folklore as an idea, its role in culture, and influence on art. During the Residency, artists will identify stories from communities and make art which activates these stories. Artists will examine the work done previously by artists in Kolaj Institutes Folklore Collage Society Project to develop a series of strategies for making collage that is in conversation with folklore relevant to their own community.\\nFee: $500\\nTo apply, read the full call to artists\\nHERE\\n."
    },
    {
        "title": "CALL FOR ARTISTS: Women United ART MAGAZINE | Issue XIII Winter 2026 - Freelance, Artist Calls",
        "organization": "Women United ART MOVEMENT",
        "location": "International",
        "deadline": "12/16/2025",
        "url": "https://arts.ca.gov/collective/women-united-art-movement-235-5-call-for-artists-women-united-art-magazine-issue-xiii-winter-2026/",
        "description": "Women United ART MAGAZINE is delighted to announce an open call for submissions for Issue XIII, scheduled for Winter 2026. This edition will be curated by Mona Lerch, founder of Women United ART MOVEMENT and a passionate advocate for women in the arts.\\nAbout Women United ART MAGAZINE\\nWomen United ART MAGAZINE is an international quarterly print and digital publication dedicated to showcasing the brilliance of women in the arts. We highlight extraordinary women creatives, inspiring industry leaders, and remarkable art organizations, providing a platform for diverse voices and perspectives from around the globe.\\nEligibility\\nOpen to all women-identifying artists worldwide, regardless of age, experience, education, race, or sexual orientation.\\nSubmission Requirements:\\nArtist Bio\\nArtist Statement\\nUp to 4 high-resolution images of artworks (minimum 300 DPI)\\nWebsite and/or social media handles\\nContact information\\nWhy Submit?\\n* Visibility: Gain exposure to a diverse and engaged global audience, including artists, art lovers, collectors, and gallerists.\\n* Advocacy: Join us in amplifying the voices of women artists worldwide.\\n* Connection: Forge meaningful connections within the art community and beyond.\\n* Inclusion in Issue XI: Selected artists will be featured in the magazine, with the length of the feature determined by the guest curator.\\n* Additional Benefits: complimentary digital copy of the magazine, virtual group exhibit, social media feature.\\nAbout the Curator: Mona Lerch is the founder of Women United ART MOVEMENT, an online platform dedicated to empowering women creatives by providing opportunities for visibility, networking, and professional development. As an artist and advocate, Mona is committed to fostering a supportive community that celebrates and elevates the voices of women in the arts.\\nHow to Submit: To submit your work for consideration, please visit our submission page https://womenunitedartmovement.com/artmagazine\\nJoin us in celebrating the creativity and resilience of women artists worldwide. We look forward to receiving your submissions!\\nSubmission Fee\\nEUR 35\\nThis fee supports our community of artists, creating opportunities and enhancing the visibility of women artists in the art world.\\nDeadline for Entries\\n15 December, 2026\\nNotification of Selection\\nJanuary 2026\\nPublication Date\\nFebruary 2026"
    },
    {
        "title": "Call for art and seeds - Temporary, Artist Calls",
        "organization": "The Verdancy Project",
        "location": "Western States",
        "deadline": "01/01/2026",
        "url": "https://arts.ca.gov/collective/the-verdancy-project-248-4-call-for-art-and-seeds/",
        "description": "The Verdancy Project invites you to take part in our annual mail-in seed swap and seed packet art exchange. This is a chance to share seeds, create original packet artwork, and connect with others who enjoy both art and gardening.\\nLearn more and sign up at: https://www.verdancyproject.com/seedswap\\nWho can join?\\nAnyone in the U.S. There is no age limit.\\nWhat do I need to do?\\nSign up\\nPay the small participation fee\\nCreate 11 seed packets with original artwork\\nMail them to The Verdancy Project\\nBecause of postage and customs issues, this swap is open to U.S. residents only.\\nWhat do I receive?\\nAt least 10 packets of seeds mailed back to you\\nSeed packets featuring original art (you can frame them once the seeds are used)\\nYour artwork included in an online exhibition\\nA feature on our social media\\nA chance to connect with other creative gardeners\\nWhat does it cost?\\nThe fee is $15.\\nThis covers return postage, processing, packaging, and work to create the online exhibit.\\nYou are responsible for providing your seeds (which can be from your garden), your art supplies, and the cost to mail your packets to us.\\nWhat kind of seeds should I include?\\nSeeds can be flowers, herbs, vegetables, or fruit.\\nPlease send organically grown seeds.\\nYou may send seeds you saved yourself, purchased seeds, extras from a seed company, or seeds gathered during travel.\\nMake sure the seeds are fresh (no more than 2 years old) and include enough in each packet for a good harvest.\\nEach of your 11 packets can contain a different variety.\\nPDF presentation on how to save seeds from an OSU Master Gardener.\\nAbout the packet design:\\nPackets must be 46 inches or smaller\\nYou may make your own envelopes or use premade ones\\nYou can create one design for all packets or make each one different\\nInclude:\\nCommon name\\nVariety\\nYear the seeds were collected\\nAny growing tips (optional, can be a separate sheet)\\nYour name and website/social media\\nSeal packets well so seeds do not fall out\\nDeadlines:\\nDecember 31, 2025  Last day to sign up\\nJanuary 31, 2026  Seed packets must be received by this date\\nYou will receive your seed packets back in February 2026.\\nMail your packets to:\\nThe Verdancy Project\\n30310 SE Division Dr.\\nTroutdale, OR 97060\\nQuestions?\\nEmail us at info@verdancyproject.com"
    },
    {
        "title": "PROUD+ Exhibition 2026 - Temporary, Artist Calls",
        "organization": "The Studio Door",
        "location": "National",
        "deadline": "05/09/2026",
        "url": "https://arts.ca.gov/collective/the-studio-door-238-4-proud-exhibition-2026/",
        "description": "The 9th Annual PROUD+ Exhibition will be held June 19  July 31, 2026, during San Diego Pride Month, showcasing the work of LGBTQ+ artists from across the country. Produced by The Studio Door, this national exhibition celebrates the unique perspectives and voices of the LGBTQ+ community through contemporary art.\\nFor nearly a decade, PROUD+ has provided a vital platform for LGBTQ+ artists to express their creativity, identity, and lived experiences. From bold declarations of self to quiet explorations of inner worlds, this exhibition seeks to highlight the richness and diversity of LGBTQ+ life and culture. Artists are invited to submit works that reflect their own interpretations of pride, resilience, and community. We encourage artists to share their truth, amplify their voice, and contribute to the ongoing conversation around LGBTQ+ identity in the arts.\\nPast exhibition catalogs are no longer available online but you can find gallery walk through videos on our YouTube Channel: https://www.youtube.com/@thestudiodoor"
    },
    {
        "title": "12th Annual The Crow Show - Temporary, Artist Calls",
        "organization": "The Studio Door",
        "location": "National",
        "deadline": "01/17/2026",
        "url": "https://arts.ca.gov/collective/the-studio-door-238-4-12th-annual-the-crow-show/",
        "description": "THE CROW SHOW 2026 is the celebratory 12th anniversary of the national exhibition of visual arts running February 20  April 3, 2026, produced by The Studio Door. As we enter a new decade of this beloved exhibition, The Crow Show continues to showcase diverse artistic interpretations of our feathered neighbor, the Crow.\\nFor over a decade, The Crow Show has been a celebrated tradition in San Diego, uniting artists from across the nation in a shared fascination with the enigmatic crow. Revered in cultures around the world, the crow has long been a symbol of mystery, transformation, and intelligence. Whether as a harbinger of change or a messenger of hope, these birds captivate our imaginations. This annual exhibition invites artists to explore the crows many faceswhether rooted in reality or soaring through the realms of fantasy. What does the crow embody for you? We invite you to share your unique vision [Creative interpretations of all black birds, ravens, and other Corvus species are welcome].\\nPast exhibition catalogs are no longer available online but you can find gallery walk through videos on our YouTube Channel: https://www.youtube.com/@thestudiodoor"
    },
    {
        "title": "Call for Art- WABI-SABI II - Temporary, Artist Calls",
        "organization": "Art Fluent",
        "location": "International",
        "deadline": "03/06/2026",
        "url": "https://arts.ca.gov/collective/art-fluent-235-4-call-for-art-wabi-sabi-ii/",
        "description": "Art Fluent invites artists worldwide to submit artwork to our online exhibit, WABI-SABI II.\\nTHEME\\nWABI-SABI is a Japanese term that refers to that which is impermanent, imperfect, aged, humbled, and unconventional. It is a state of mind and a way of being. It expresses a whole new world of seeing. Perhaps being open to mistakes and accidents will lead us somewhere new, beautiful, and authentic. As artists, we know this all too well. Visually, it is the simplicity of composition and exploring the meaning and beauty of everyday objects. Show us WABI-SABI from your perspective.\\nCALENDAR\\nJPEGs due by Friday, March 6, 2026, at midnight MST.\\nNotification of acceptance and online gallery opening by Friday, April 3, 2026.\\nAWARDS\\nAll accepted pieces will be displayed in our online gallery at www.art-fluent.com\\nBest of Show: $750\\nTwo Directors Choice awards: $250 each\\nENTRY FEE\\n$25 for first entry/$10 for each additional entry. You may enter up to 20 total. Payment is non-refundable and does not guarantee acceptance. For 3D work, there is no need to pay for additional entries for detail shots. Once your first entry is made, you may send additional views by email to hello@art-fluent.com.\\nELIGIBILITY\\nThis call is open to artists worldwide, both amateur and professional. Work selected for previous exhibits with Art Fluent will not be considered.\\nRULES\\nWork copied or done under the guidance of an instructor is not eligible. Open to ALL fine art mediums (oil, acrylic, watermedia, pastel, drawing, printmaking, mixed media, photography, sculpture, fiber, wood, ceramics, film/video, digital art). AI will not be accepted. Diptychs and triptychs should be uploaded as a single image.\\nSELECTION PROCESS\\nDirectors choice. Each show is curated and juried by Creative Director Amy Matteson Neill, along with an anonymous committee of jurors. Please note, there is no personal feedback given by jurors.\\nENTRY PROCEDURE\\nEntry is done through CaF, a web-based service that allows artists to upload images and organize their artwork for submissions to galleries. To apply for a call, you must leave our website and go to the CaF website at www.callforentry.org where you can create a FREE artist account. You will add your details and upload your images to CaF and then you can submit work to WABI-SABI II. If you have any questions, please contact us at hello@art-fluent.com. We are happy to walk you through the process.\\nMEDIA PREPARATION\\nPlease only submit properly cropped images of your work that are in focus. We have a free resource for artists with tips on how to get high-quality images of their work. Visit www.art-fluent.com/resources for a free download. CaF also offers tips on its blog, which you can find here: www.callforentry.org/photographing-artwork/.\\nAll images must be in JPEG/JPG format using CaF guidelines. The image size must be 1,200 pixels or greater on the longest side. The maximum file size is 5 mb.\\nAccepted video formats include MOV, MP4, WMV. Aspect ratio 4:3 or 16:9, resolution minimum 640480, maximum 1920 x1080, bit rate recommended above 240 kbps, recommended frame rate 30 fps. File size must be under 100 MB. If your video work has been selected for the exhibit, we kindly request that you provide us with the file link via Vimeo. Please ensure the linked video is set to be shared publicly. Your video will not play if it is set to private.\\nNOTIFICATION\\nNotification will be done by email; everyone who submits will be notified of the jurors selections. If for any reason you do not hear from us by the notification date, please check the filters in your email account. Notification emails are sent to the email on file with CaF.\\nSALES\\nAll sales inquiries will be directed to the artists website and/or contact information. The artists receive 100% of the sale for any artwork sold.\\nGIVING BACK\\nA portion of the proceeds from the entry fees is donated to organizations committed to the arts and supporting artists.\\nREQUIRED FORMS\\nCash awards over $600 are subject to federal income tax withholding within the United States. A W-9 form must be filled out by the winner and submitted to Art Fluent, Inc.\\nREGULATIONS\\nBy entering our calls for art through CaF, you agree to be added to Art Fluents email list for forthcoming artist opportunities. By submitting images, you agree that the images are your own work, nothing copied, you own all rights to the images, and you take full responsibility for the content of all images, including the likeness of recognizable individuals. The actual artwork will remain the property of the artist, our mission is to promote artists and their work. Should your work be accepted, you grant Art Fluent the right to reproduce your image on our website, on social media, and where appropriate to help promote further online opportunities. Art Fluent will always credit you and your copyright wherever feasible. We will not use your image for any other purpose without the artists permission."
    },
    {
        "title": "Paper National Juried Exhibition - Freelance, Artist Calls",
        "organization": "Arc Studios & Gallery",
        "location": "SF Bay Area",
        "deadline": "03/31/2026",
        "url": "https://arts.ca.gov/collective/arc-studios-gallery-245-5-paper-national-juried-exhibition/",
        "description": "Artists are invited to submit works that explore the creative potential of this ancient and timeless material. Whether used as a surface, substrate or sculptural element, paper must be a central component of each piece. We welcome a wide range of techniquesshow us what you can do with paper, whether its drawing, painting, printing, folding, sculpting, collaging, sewing, binding, and beyond."
    },
    {
        "title": "International Art Competition Grey - Temporary, Artist Calls",
        "organization": "Art Room Gallery",
        "location": "International",
        "deadline": "12/12/2025",
        "url": "https://arts.ca.gov/collective/art-room-gallery-235-4-international-art-competition-grey-2/",
        "description": "Contemporary Art Room Gallery is proud to announce their 6th Grey Online Art Competition for the month of December 2025. Only works of art created in black, white and or shades of grey will be accepted. All visual art mediums are acceptable (painting, photography, drawing, sculpture, digital, prints, fiber art, collage or installation art) except sound and video art. Winning artwork (First place) will be on the poster of the show. Depending on the number and quality of all submissions received, Merit awards and Honorable Mention awards may also be presented. All selected artists will receive a digital award certificate. The deadline to apply to this art competition is December 11, 2025."
    },
    {
        "title": "30th Annual Art in the Pearl Call for Entry - Temporary, Artist Calls",
        "organization": "Art in the Pearl",
        "location": "Other",
        "deadline": "02/16/2026",
        "url": "https://arts.ca.gov/collective/art-in-the-pearl-242-4-30th-annual-art-in-the-pearl-call-for-entry/",
        "description": "Come join us for our 30th anniversary Art in the Pearl show in the beautiful park blocks of NW Portland, Oregon. Be one of 140+ artists from around the country to reach over 50,000 attendees who come to the show. If you create exceptional work in fine art, fine craft, or mixed media, we invite you to apply and be part of this milestone year! Art in the Pearl is nationally recognized for its welcoming atmosphere, dedicated collectors, and commitment to showcasing high-quality handmade art.\\nLabor Day Weekend | September 5th  7th\\nPortland, Oregon"
    },
    {
        "title": "Call for Entry- Left Coast Annual Juried Exhibition - Temporary, Artist Calls",
        "organization": "Sanchez Art Center",
        "location": "SF Bay Area",
        "deadline": "01/27/2026",
        "url": "https://arts.ca.gov/collective/sanchez-art-center-245-4-call-for-entry-left-coast-annual-juried-exhibition/",
        "description": "An exciting opportunity for all California, Oregon, Washington, Alaska, and Hawaii fine art visual artists! Sanchez Art Center invites you to enter the 2026 Left Coast Annual, an open call for contemporary art (no theme, all visual art media).  This years juror is Scott A. Shields, Ph.D., Ted and Melza Barr Chief Curator and Associate Director at the Crocker Art Museum in Sacramento.\\nDont wait, enter now!\\nAwards:  2 Exhibition Awards ($250 plus an exhibition in 2027; and 2 Merit Awards ($250). Entry deadline: 11 pm PST, Tuesday, January 27, 2026."
    },
    {
        "title": "Light & Shadow 2025 Art Competition - Temporary, Artist Calls",
        "organization": "Fusion Art",
        "location": "International",
        "deadline": "01/06/2026",
        "url": "https://arts.ca.gov/collective/fusion-art-235-4-light-shadow-2025-art-competition/",
        "description": "Fusion Art announces the Light & Shadow 2025 Art Competition.\\nFor this competition, both 2D & 3D artists, worldwide, are invited to submit their best artwork depicting light and shadow. Whether color or black and white, the artwork should focus on the dramatic placement and effects of light and shadow over the canvas or through the lens.\\nChoice of a cash prize or complimentary one-year membership to Fusion Arts Members Gallery for Best in Show winners. Winners and finalists are provided with extensive worldwide publicity and promotion.\\nEntry Fees: $25 for 1-2 images / $40 for up to 5 images\\nThe deadline to enter is January 5, 2025.\\nPlease visit https://www.fusionartps.com/calls-for-artists/ for full competition guidelines and to submit.\\nAbout Fusion Art\\nFounded by Award winning artist, Chris and Valerie Hoffman, Fusion Art was envisioned and formed out of a passion for art and the artists who create it. The website promotes and connects new, emerging and established artists with collectors and art enthusiasts, while offering the opportunity to participate in art competitions, exhibitions and experiences."
    },
    {
        "title": "Bizarre | Juried Online Art Exhibition - Freelance, Artist Calls",
        "organization": "UPWARD gallery",
        "location": "International",
        "deadline": "12/13/2025",
        "url": "https://arts.ca.gov/collective/upward-gallery-235-5-bizarre-juried-online-art-exhibition/",
        "description": "UPWARD Gallery invites artists to submit artwork for our juried online art exhibition, Bizarre.\\nThe works presented at the exhibition explore the surreal and supernatural, the unconscious and unexpected, challenging the order of the world.\\nWe welcome submissions from a variety of media, including but not limited to: painting, drawing, digital painting, sculpture, printmaking, photography, textiles, and mixed media.\\nAwards: Interviews and other publications are featured in the print edition of UPWARDs magazine and on the website, digital certificate, and personal artist page on the gallery website. The exhibition will be promoted online via our website and social media channels. All artists retain 100% of sales with inquiries directed to them.\\nFee: $15 for entry, $12 (2-4 entries), $10 (5 or more entries).\\nDeadline: December 12, 2025\\nVisit\\nhttps://upwardgallery.com/ad/competitions/120/bizarre\\nfor a full information.\\nThe UPWARD Gallery was founded in 2021. Our online platform is designed to share art with new audiences using modern technologies. We assist emerging artists in gaining recognition and established artists in expanding their influence."
    },
    {
        "title": "Shadow Play | Juried Online Art Exhibition - Freelance, Artist Calls",
        "organization": "UPWARD gallery",
        "location": "International",
        "deadline": "12/06/2025",
        "url": "https://arts.ca.gov/collective/upward-gallery-235-5-shadow-play-juried-online-art-exhibition/",
        "description": "UPWARD Gallery invites artists to submit artwork for our juried online art exhibition, Shadow Play.\\nThe theme of the exhibition explores the visual and spatial perception of shadow and light in art, and their potential to depict fleeting moments and personal memories.\\nWe welcome submissions from a variety of media, including but not limited to: painting, drawing, digital painting, sculpture, printmaking, photography, textiles, and mixed media.\\nAwards: Interviews and other publications are featured in the print edition of UPWARDs magazine and on the website, digital certificate, and personal artist page on the gallery website. The exhibition will be promoted online via our website and social media channels. All artists retain 100% of sales with inquiries directed to them.\\nFee: $15 for entry, $12 (2-4 entries), $10 (5 or more entries).\\nDeadline: December 5, 2025\\nVisit\\nhttps://upwardgallery.com/ad/competitions/121/shadow-play\\nfor a full information.\\nThe UPWARD Gallery was founded in 2021. Our online platform is designed to share art with new audiences using modern technologies. We assist emerging artists in gaining recognition and established artists in expanding their influence."
    },
    {
        "title": "Contemporary art prize LAB ART PRIZE - Temporary, Artist Calls",
        "organization": "Malamegi Lab",
        "location": "International",
        "deadline": "12/20/2025",
        "url": "https://arts.ca.gov/collective/malamegi-lab-235-4-contemporary-art-prize-lab-art-prize/",
        "description": "The Malamegi Lab Art Award is an international competition open to all artists. The competition is open to works in various disciplines, including drawing, painting, sculpture, photography, graphic design, mixed media, digital art, and video.\\nThe competition will select 12 finalist artists, who will have the opportunity to win prestigious prizes and exhibit their works in a high-profile group exhibition. The prizes include: New Malamegi Collection, Artwork Acquisition Award, Group Exhibition, Cash Prize, and Monographic Catalogue.\\nThe Award represents an important opportunity for artists to establish themselves and connect with the world of contemporary art. Dont miss the chance to showcase your work internationally and become part of a network of emerging talents. A global platform, prestigious prizes, and unique opportunities. Dont let this extraordinary opportunity slip away.\\nApplication deadline : December 19, 2025\\nYou can find all the information about the contest on the official website: www.lab.malamegi.com\\nPRIZES & AWARDS\\nArtwork Acquisition Award\\nMalamegi Lab will acquire one among 12 final artworks. This artwork will become part of the Malamegi Labs private collection. The award has a maximum purchase value of  2000,00. Artworks not for sale or with a price higher than the acquisition prize will not participate in this prize. These artworks will still be able to win one of the other prizes.\\nCash prize\\nAt the end of the collective exhibition, to an artist among the 12 selected will be awarded a cash prize of  1000,00. The award will be given based on the quality and originality of the work on display. The winning work will remain property of the artist. The prize is a contribution to the development of art and artists aesthetic research.\\nMonographic art book\\nA monographic book will be dedicated to one of the finalists. The monography will be curated by Malamegi Lab with the support of final exhibitions curators. The book will be edited, developed, printed and distributed at Malamegi Lab expenses. Apart the copies in distribution, another ones will be added for the artists personal use.\\nMalamegis new collection\\nMalamegi is raffling the creation of a new works collection through the selection of one artist among 12 finalists of the contest. The collaboration will enable the artist to develop an entire collection of his works which will be advertised and presented to all buyers of the commercial network.\\nCollective exhibition\\n12 artists will be selected for the final exhibition of the competition. the exhibition opening will be ac- companied by the general catalogue, distributed throughout the exhibition period. invitations to vernissage will be sent to artists, curators, critics, journalists and media of the hosting city."
    },
    {
        "title": "Gathering Ground: A celebration of compost art and culture! - Temporary, Artist Calls",
        "organization": "California Alliance for Community Composting",
        "location": "Sacramento",
        "deadline": "11/30/2025",
        "url": "https://arts.ca.gov/collective/california-alliance-for-community-composting-243-4-gathering-ground-a-celebration-of-compost-art-and-culture/",
        "description": "Calling all composters and artists, and artists that compost!\\nWere excited to announce an open call for visual art submissions to\\nGathering Ground: A celebration of compost art and culture!\\nThis is a 3-day art exhibition taking place in\\nSacramento, CA from February 1-3, 2026\\nalongside the upcoming Institute for Local Self Reliances \\nCultivating Community Composting\\n forum.\\nThe art exhibition will explore how compost, soil health, and regenerative agriculture shape more resilient communities. Through visual art, installations, and thought-provoking dialogue, Gathering Ground is meant to bring together and celebrate science, sustainability, and creativity in one participatory space.\\nWere inviting artists and creatives to submit original completed artwork that speaks to these themes. If youre interested, please fill out\\nthis short submission form\\nby\\nNovember 30, 2025\\n. It only takes a few minutes!\\nSome notes about participating:\\nYou can be an amateur artist. We are looking for a range of submissions from people of all backgrounds and experience. If you make something creative that you love, were interested in hearing from you!\\nWe are open to submissions of all genres of visual art, including painting and drawings, photography, videography, sculpture, conceptual work, textiles and fashion, graphic designs for screen printing, and whatever visual stimulation you can dream up!\\nYou can be an artist from anywhere in the United States.  We have some limited resources to accommodate shipping and storage of non-local works. You can let us know in your submission proposal if you would require help getting your finished artwork to/from Sacramento, and we will do our best to assist.\\nThe application process is meant to be simple and accessible. Have fun with it!\\nOur goal is to represent a diverse array of art projects and people, and maximize our art curation within the constraints of our limited gallery space at\\nSol Collective\\n. Selected pieces to be displayed as part of the exhibition will be notified by\\nFriday, December 19, 2025\\n.\\nOur focus is on uplifting local voices, while also welcoming perspectives from beyond Sacramento and California to create meaningful exchange across the country. We want this show to reflect the diversity of ways people are engaging with compost, soil and climate today: from rural and urban contexts, personal and collective experiences, scientific and imaginative approaches.\\nWe are intending to compensate selected artists for their participation, and we will determine the final offer based on the total number of art pieces we are able to curate. All artists may also choose to offer their pieces for sale at the exhibition.\\nWe hope youll join us in celebrating the power of soil, compost, and community, and in imagining the regenerative future that they collectively make possible.\\nHappy creating!\\nNatal, Cass, and Kourtnii\\nThe Art Team at the California Alliance for Community Composting\\nQuestions?  Please email us at californiasoilstewards@gmail.com"
    },
    {
        "title": "GLENDALE PUBLIC ART REQUEST FOR QUALIFICATIONS - Freelance, Artist Calls",
        "organization": "LeBasse Projects",
        "location": "Los Angeles",
        "deadline": "01/31/2026",
        "url": "https://arts.ca.gov/collective/lebasse-projects-236-5-glendale-public-art-request-for-qualifications/",
        "description": "The City of Glendale is on the path to become an arts and\\nculture destination in the Los Angeles metropolitan region.\\nReflecting on its diverse population, history and\\ninnovation in public spaces, the City seeks to further\\nenrich the day-to-day experiences of the community with\\nits emphasis on the importance of arts and culture.\\nAs part of the City of Glendales initiative to become a\\nprime arts and culture destination, up to ten long-term to\\npermanent artwork installations will be commissioned,\\ndeveloped and established over the course of the next\\nfew years. These landmark installations will be\\nstrategically placed throughout the City in locations that\\nfocus on public accessibility and encourage public\\nengagement and interactivity.\\nThis call for artists will reach out for three different project opportunities in the City of\\nGlendale. The aim for all three artwork opportunities is to create world-class public\\nartwork in a diverse range of mediums that are designed to engage the community, and\\nshowcase the cultural diversity of the City and enhance the various civic and public\\nspaces.\\nEach location is different and asks for its own unique mediums utilizing highly imaginative\\nand forward-thinking approaches. Selected Artists and Artist Teams will be asked to\\ndemonstrate creative applications to support the building and activation of a community\\ninterconnected by its public art.\\nWe encourage Artists and Artist Teams to review the opportunities and consider how their\\nown practice relates to the conceptual and visual demands and how their art practice\\nmight address the stated project goals. When applying to the RFQ, Artists and Artist\\nTeams may apply for one or multiple opportunities that they feel they can develop strong\\nconcepts and visions for.\\nPlease find the full RFQ, and application link below:\\nhttps://lebasseprojects.submittable.com/submit"
    },
    {
        "title": "International Art Competition Faces - Temporary, Artist Calls",
        "organization": "Art Room Gallery",
        "location": "International",
        "deadline": "12/05/2025",
        "url": "https://arts.ca.gov/collective/art-room-gallery-235-4-international-art-competition-faces-3/",
        "description": "Contemporary Art Room Gallery is proud to announce their sixth Faces Online Art Competition for the month of December 2025. This is an international competition and artists from around the world are welcome to submit their work. Only the face of a person or animal should be visible (single person, a group, or self-portrait). All visual art mediums are acceptable (painting, drawing, photography, sculpture, digital, prints, fiber art, collage or installation art) except sound and video art. Winning artwork (First place) will be on the poster of the show. Depending on the number and quality of all submissions received, Merit awards and Honorable Mention awards may also be presented. The deadline to apply to this art competition is December 04, 2025."
    },
    {
        "title": "15th Annual All Women Online Art Competition - Temporary, Artist Calls",
        "organization": "Light Space & Time Online Art Gallery",
        "location": "International",
        "deadline": "12/27/2025",
        "url": "https://arts.ca.gov/collective/light-space-time-online-art-gallery-235-4-15th-annual-all-women-online-art-competition/",
        "description": "Light Space & Time Online Art Gallery announces the 15th Annual All Women Online Art Competition.\\nThere is no theme for this competition, so any subject matter and any media are acceptable for consideration. Both 2D & 3D women artists only, worldwide, are invited to submit their best representational and/or abstract art.\\nBest in Show winner will receive a cash prize. Winners receive extensive worldwide publicity and promotion.\\nEntry Fees: $18.00 for 1 to 2 entries / $26.00 for 3 to 5 entries. Early entry and art student discounts.\\nThe deadline to apply is December 27, 2025.\\nFor further information and to apply online: https://lightspacetime.art/15th-annual-all-women-online-art-competition-2026/\\nAbout Light Space & Time Online Art Gallery\\nLight Space & Time Online Art Gallery conducts monthly themed online art competitions and art exhibitions for new and emerging artists on a worldwide basis.  It is the gallerys intention to help todays artists to successfully market their art to a worldwide audience."
    },
    {
        "title": "Fluid Abstract | 2025 Art Competition - Temporary, Artist Calls",
        "organization": "Blue Koi Gallery",
        "location": "Other",
        "deadline": "01/01/2026",
        "url": "https://arts.ca.gov/collective/blue-koi-gallery-242-4-fluid-abstract-2025-art-competition/",
        "description": "Fluid Abstract invites artists and photographers to explore the beauty of movement, emotion, and transformation through abstract expression.\\nLet your imagination flow where form meets freedom. The Fluid Abstract Art Competition invites artists and photographers to dive into the beauty of movement, color, and emotion, where nothing is fixed and everything transforms. All mediums, styles, and interpretations are welcome. Whether bold or ethereal, your work belongs here.\\nSubmit your entry before December 31, 2025, and be part of an international showcase celebrating the limitless language of abstraction\\n* Applications Open: October 30, 2025\\n* Close Submissions: December 31, 2025\\n* Image format: JPG/PNG, max 3MB per file\\n* Rename files with clear Artist Name_Title\\nThe Winner will receive:\\n           $250 cash prize\\n           Exhibition feature\\n           Official certificate\\n           Media promotion\\n           Highlight in the KAA newsletter\\n$25 for 4 images/ $35 for 6 images\\nhttps://koisartistaward.com/fluid-abstract-art-competition/\\nHow to Enter\\n1. Complete the online entry form\\n2. Upload your images and artwork details\\n3. Pay the applicable entry fee\\n4. Receive confirmation of your entry and stay tuned for winner announcements"
    },
    {
        "title": "RED 2025 Art Competition - Temporary, Artist Calls",
        "organization": "Fusion Art",
        "location": "International",
        "deadline": "12/02/2025",
        "url": "https://arts.ca.gov/collective/fusion-art-235-4-red-2025-art-competition/",
        "description": "Fusion Art announces the RED 2025 Art Competition.\\nThe color RED dominates human emotion as the color of passion, power, and intensityfrom blazing anger to tender love. For this competition, both 2D and 3D artists, worldwide, are invited to submit their best art and photography using red as the primary color in their work to convey strong feelings and psychological depth. While red should be the predominant visual element, other colors can be used to enhance its emotional impact and meaning.\\nChoice of a cash prize or complimentary one-year membership to Fusion Arts Members Gallery for Best in Show winners. Winners and finalists are provided with extensive worldwide publicity and promotion.\\nEntry Fees: $25 for 1-2 images / $40 for up to 5 images\\nThe deadline to enter is December 1, 2025.\\nPlease visit https://www.fusionartps.com/red-2025-art-competition/ for full competition guidelines and to submit.\\nAbout Fusion Art\\nFounded by Award winning artist, Chris and Valerie Hoffman, Fusion Art was envisioned and formed out of a passion for art and the artists who create it. The website promotes and connects new, emerging and established artists with collectors and art enthusiasts, while offering the opportunity to participate in art competitions, exhibitions and experiences."
    },
    {
        "title": "Artist of the Autumn | Juried Online Art Exhibition - Freelance, Artist Calls",
        "organization": "UPWARD gallery",
        "location": "International",
        "deadline": "11/30/2025",
        "url": "https://arts.ca.gov/collective/upward-gallery-235-5-artist-of-the-autumn-juried-online-art-exhibition/",
        "description": "UPWARD Gallery invites artists to submit artwork for our juried online art exhibition, Artist of the Autumn.\\nWe welcome submissions from a variety of media, including but not limited to: painting, drawing, digital painting, sculpture, printmaking, photography, textiles, and mixed media.\\nAwards: Interviews and other publications are featured in the print edition of UPWARDs magazine and on the website, digital certificate, and personal artist page on the gallery website. The exhibition will be promoted online via our website and social media channels. All artists retain 100% of sales with inquiries directed to them.\\nFee: $15 for entry, $12 (2-4 entries), $10 (5 or more entries).\\nDeadline: November 30, 2025\\nVisit\\nhttps://upwardgallery.com/ad/competitions/115/artist-autumn-2025\\nfor a full information.\\nThe UPWARD Gallery was founded in 2021. Our online platform is designed to share art with new audiences using modern technologies. We assist emerging artists in gaining recognition and established artists in expanding their influence."
    },
    {
        "title": "Figurative | Juried Online Art Exhibition - Freelance, Artist Calls",
        "organization": "UPWARD gallery",
        "location": "International",
        "deadline": "11/28/2025",
        "url": "https://arts.ca.gov/collective/upward-gallery-235-5-figurative-juried-online-art-exhibition/",
        "description": "UPWARD Gallery invites artists to submit artwork for our juried online art exhibition, Figurative.\\nWe welcome submissions from a variety of media, including but not limited to: painting, drawing, digital painting, sculpture, printmaking, photography, textiles, and mixed media.\\nAwards: Interviews and other publications are featured in the print edition of UPWARDs magazine and on the website, digital certificate, and personal artist page on the gallery website. The exhibition will be promoted online via our website and social media channels. All artists retain 100% of sales with inquiries directed to them.\\nFee: $15 for entry, $12 (2-4 entries), $10 (5 or more entries).\\nDeadline: November 28, 2025\\nVisit\\nhttps://upwardgallery.com/ad/competitions/117/figurative\\nfor a full information.\\nThe UPWARD Gallery was founded in 2021. Our online platform is designed to share art with new audiences using modern technologies. We assist emerging artists in gaining recognition and established artists in expanding their influence."
    },
    {
        "title": "Still Life Art Contest - Temporary, Artist Calls",
        "organization": "Grey Cube Gallery",
        "location": "International",
        "deadline": "11/28/2025",
        "url": "https://arts.ca.gov/collective/grey-cube-gallery-235-4-still-life-art-contest-2/",
        "description": "Grey Cube Gallery proudly presents the third Still Life online art contest for the month of December 2025. Contest is open to all artists worldwide over 18 years of age. As part of this competition, artists must incorporate either natural objects, such as foods, flowers, plants, rocks, shells, or man-made objects, such as books, vases, jewelry, coins, pipes, etc. We are not accepting still-life paintings that depict a dead animal or human skull. All visual art mediums (except video and sound) are allowed. Best of Show artwork will be on the poster of the show. Winning artists (Merit Award & Honorable Mention) will receive a digital award certificate. The deadline to submit entries is the November 27, 2025."
    },
    {
        "title": "Floral Art Competition - Temporary, Artist Calls",
        "organization": "Artist Space Gallery",
        "location": "International",
        "deadline": "11/26/2025",
        "url": "https://arts.ca.gov/collective/artist-space-gallery-235-4-floral-art-competition/",
        "description": "We are pleased to announce our first Floral online Art Competition for the month of December 2025. The gallery welcomes artists and photographers to present their unique artistic vision through works inspired by botanical and floral subjects  such as flowers, herbs, fruits, leaves, plants, and other related natural subjects. All visual art mediums are allowed. In addition to the selected artists, the jury will select award winners in the following art categories: painting, photography, sculpture. All selected artists will receive a digital award certificate. An article about each artist will be displayed alongside the best of show and three winners. The best of show will be displayed on the poster of the exhibition. Judging the artwork will be based on the following criteria: creativity, originality and quality of art, overall design, demonstration of artistic ability, and usage of medium. The jury will not consider artworks with pornographic or satanic content. Entry fees are $20 for two pieces of artwork. You may submit more than two images; there is no limit to the number of images an artist may submit."
    },
    {
        "title": "Call for Artists: CICA Young Korean Artists Solo Show Series Spring 2026 - Temporary, Artist Calls",
        "organization": "CICA Museum",
        "location": "Other",
        "deadline": "11/25/2025",
        "url": "https://arts.ca.gov/collective/cica-museum-242-4-call-for-artists-cica-young-korean-artists-solo-show-series-spring-2026/",
        "description": "CICA Museum invites Korean and Korean diaspora artists worldwide, as well as international artists residing in Korea, to participate in the Young Korean Artists Show Spring 2026, including a publication and interviews. Each selected artist will have a solo exhibition for one week (WednesdaySunday) in the gallery space (approximately 44m) at the CICA Museum. The artists will be featured in the e-book series CICA Art Now, available via Amazon. A printed version will be available by order. Additionally, artists may optionally participate in an online session, the recording of which will be shared on social media.\\n*The categories include:\\n Painting\\n Photography\\n Sculpture and Installation Art\\n Performance\\n Video & New Media Art\\n Design\\n*Timeline:\\nNovember 24, 2025: Submission deadline\\nNovember 25 December 10, 2025: Exhibition schedules will be arranged\\nJanuaryJune 2026: Young Korean Artists Show series\\nAugust 1, 2026: Expected publication date of CICA Art Now 2026\\n***Dates are subject to change.\\n*How to submit your work: Please visit our website for more information.\\n(https://cicamuseum.com/call-for-artists-cica-young-korean-artists-solo-show-series/)"
    },
    {
        "title": "41st Annual Made in California Juried Exhibition - Freelance, Artist Calls",
        "organization": "Brea Gallery",
        "location": "California",
        "deadline": "02/07/2026",
        "url": "https://arts.ca.gov/collective/brea-gallery-231-5-41st-annual-made-in-california-juried-exhibition/",
        "description": "41st Annual Made in California Juried Exhibition\\nApril 25 -June 28, 2026\\nEntry Deadline: February 6th, 2026\\nArtists! Submit your work for our annual juried exhibition, Made in California.\\nOpen to all living artists ages 18 and up residing in California. All entries must be original, completed in the past three years, and not previously shown at the Brea Gallery. All mediums are welcome! Over $2,500 in prizes are awarded annually and there is a unique opportunity to win a solo exhibition. Single entries are just $20, while solo show submissions are only $80 for a body of work (5  10 pieces).\\nThis annual juried exhibit showcases artwork from all over the state of California. Over the past four decades, Made in California has highlighted thousands of artists in all stages of their careers, offering them a chance to compete for a number of awards, including the coveted solo show opportunity. This regional show features artwork from an extensive variety of mediums and explores creative movements happening in California.\\nEntry URL:\\nhttps://www.breaartgallery.com/entermica\\nProspectus:\\nhttps://www.breaartgallery.com/prospectus\\nFAQs:\\nhttps://www.breaartgallery.com/faq"
    },
    {
        "title": "Vibrant Colors Art Challenge 2026 | Free Entry for Early Entries - Temporary, Artist Calls",
        "organization": "Ten Moir Gallery",
        "location": "International",
        "deadline": "02/05/2026",
        "url": "https://arts.ca.gov/collective/ten-moir-gallery-235-4-vibrant-colors-art-challenge-2026-free-entry-for-early-entries/",
        "description": "Let color speak!\\nThe Vibrant Colors Art Challenge invites artists to explore the language of color in its most expressive forms. Whether through bold abstract expression, radiant landscapes, or subtle harmonies of tone, this challenge celebrates how color transforms emotion and energy into art.\\nWere seeking works that pulse with life  and pieces that prove color isnt just seen, but felt.\\nImportant Dates\\nEarly Bird Deadline (Free 1st Entry): December 15, 2025\\nFinal Submission Deadline: February 4, 2026\\nWinners Announced: February 18, 2026\\nEntry Fees\\n1st Artwork Entry Free until Dec 15 (Early Bird period only)\\nAdditional entries: Tiered pricing that rewards fuller submissions.\\nOpen to all artists, worldwide.\\nAwards & Recognition\\nBest in Show\\n$100 Cash Award recognizing creative excellence\\nExclusive Artist Interview published on Ten Moir Gallerys website\\nFeatured in The Moir Weekly newsletter (6,000+ readers)\\nMini Spotlight in The Moir Art Journal\\nHomepage Feature for one month\\nFree Entry into the Blu Sky Artist Award (worth $1,000 in total prizes)\\nCategory Runner-Ups (Traditional & Photography)\\n$25 Cash Award\\nWebsite & Social Media Feature shared across Ten Moir Gallery platforms\\nFree Entry into the Blu Sky Artist Award\\nFinalists (Top 1520 Artists)\\nPermanent Website Listing in the Vibrant Colors Collection\\nDigital Certificate of Achievement for CVs and portfolios\\nGroup Social Media Feature celebrating all finalists\\nOpen to 2D and 3D artworks including:\\nPainting (oil, acrylic, watercolor, mixed media), Drawing, Illustration, Digital Art, Photography, Sculpture, and other creative media.\\nWhy Enter?\\nWith your first artwork free, its the perfect opportunity to showcase your creativity to an international audience. Gain professional recognition, publication opportunities, and lasting visibility.\\nHow to Enter\\nSubmit through the\\nhttps://tenmoirgallery.com/vibrant-colors-art-competition/\\nUpload up to 6 artworks (JPEG, PNG, or PDF format)\\nInclude your artist statement (100150 words)\\nPay applicable fees for additional entries (after the free first entry)\\nReceive a confirmation email\\nAbout Ten Moir Gallery\\nTen Moir Gallery is a creative hub dedicated to celebrating and elevating contemporary artists. Through curated challenges, artist features, artist grants, and the semi-annual Moir Art Journal, we connect artists to new audiences, meaningful recognition, and professional opportunities.\\nOur mission is simple: to amplify artistic voices, foster genuine community, and keep creativity thriving in every form."
    },
    {
        "title": "Monthly Themed Art Challenges | Free Entry for Early Entries - Temporary, Artist Calls",
        "organization": "Ten Moir Gallery",
        "location": "International",
        "deadline": "01/01/2027",
        "url": "https://arts.ca.gov/collective/ten-moir-gallery-235-4-monthly-themed-art-challenges-free-entry-for-early-entries/",
        "description": "Ten Moir Gallerys Monthly Themed Art Challenges celebrate artists who push boundaries and express meaning through visual storytelling. Each month introduces a new theme, inviting you to explore different moods, ideas, and techniques.\\nFrom vibrant colors to Free Flow, these challenges are designed to keep your creative practice active, visible, and inspired all year long.\\nHow It Works\\nNew Theme Every Month\\nFree First Entry  available during the Early Bird period (typically through the 15th).\\nFinal Submission Deadline\\nResults Announced\\nEntry Fees\\n1st artwork entry free during the Early Bird period\\nAdditional entries available through tiered pricing on the submission form\\nOpen worldwide to all artists\\nAwards & Recognition\\nBest in Show  $150 Cash Award Artist interview  The Moir mini spotlight feature  Homepage feature  Free Blue Sky Artist Award entry\\nCategory Runner-Ups (Traditional & Photography)  $50 Cash Award   Website feature  Dedicated Social Media Post Art Journal Mini Spotlight  Free Blue Sky entry\\nFinalists (Top 1520)  permanent listing in the monthly collection, digital certificate, and group social feature.\\nAll Selected Artists  showcased in the Monthly Challenge Collection.\\nWhy\\nParticipate?\\nThe Monthly Themed Challenges are designed to keep your art in motion. Whether youre building your portfolio, exploring new ideas, or growing your visibility, each month offers a new opportunity for recognition and connection within a supportive artist community.\\nAbout Ten Moir Gallery\\nTen Moir Gallery is a creative hub dedicated to celebrating and elevating contemporary artists. Through curated challenges, artist features, and the Moir Art Journal, we connect artists with audiences, recognition, and opportunities to grow.\\nhttps://tenmoirgallery.com/art-competitions-open-call"
    },
    {
        "title": "LAB ART PRIZE - Temporary, Artist Calls",
        "organization": "Malamegi Lab",
        "location": "International",
        "deadline": "12/19/2025",
        "url": "https://arts.ca.gov/collective/malamegi-lab-235-4-lab-art-prize/",
        "description": "The Malamegi Lab Art Award is an international competition open to all artists. The competition is open to works in various disciplines, including drawing, painting, sculpture, photography, graphic design, mixed media, digital art, and video.\\nThe competition will select 12 finalist artists, who will have the opportunity to win prestigious prizes and exhibit their works in a high-profile group exhibition. The prizes include: New Malamegi Collection, Artwork Acquisition Award, Group Exhibition, Cash Prize, and Monographic Catalogue.\\nThe Award represents an important opportunity for artists to establish themselves and connect with the world of contemporary art. Dont miss the chance to showcase your work internationally and become part of a network of emerging talents. A global platform, prestigious prizes, and unique opportunities. Dont let this extraordinary opportunity slip away.\\nApplication deadline : December 19, 2025\\nYou can find all the information about the contest on the official website: www.lab.malamegi.com\\nPRIZES & AWARDS\\nArtwork Acquisition Award\\nMalamegi Lab will acquire one among 12 final artworks. This artwork will become part of the Malamegi Labs private collection. The award has a maximum purchase value of  2000,00. Artworks not for sale or with a price higher than the acquisition prize will not participate in this prize. These artworks will still be able to win one of the other prizes.\\nCash prize\\nAt the end of the collective exhibition, to an artist among the 12 selected will be awarded a cash prize of  1000,00. The award will be given based on the quality and originality of the work on display. The winning work will remain property of the artist. The prize is a contribution to the development of art and artists aesthetic research.\\nMonographic art book\\nA monographic book will be dedicated to one of the finalists. The monography will be curated by Malamegi Lab with the support of final exhibitions curators. The book will be edited, developed, printed and distributed at Malamegi Lab expenses. Apart the copies in distribution, another ones will be added for the artists personal use..\\nMalamegis new collection\\nMalamegi is raffling the creation of a new works collection through the selection of one artist among 12 finalists of the contest. The collaboration will enable the artist to develop an entire collection of his works which will be advertised and presented to all buyers of the commercial network.\\nCollective exhibition\\n12 artists will be selected for the final exhibition of the competition. the exhibition opening will be ac- companied by the general catalogue, distributed throughout the exhibition period. invitations to vernissage will be sent to artists, curators, critics, journalists and media of the hosting city."
    },
    {
        "title": "Call for Artists: the International Exhibition Circle 2026 - Temporary, Artist Calls",
        "organization": "CICA Museum",
        "location": "Other",
        "deadline": "11/24/2025",
        "url": "https://arts.ca.gov/collective/cica-museum-242-4-call-for-artists-the-international-exhibition-circle-2026/",
        "description": "CICA Museum invites artists worldwide to participate in the International Exhibition, Circle 2026. We are open to photography, 2D digital art, video art, interactive art, painting, sculpture and installation art dealing with circles, roundness, circulation, repetition, rituals, wholeness, etc.\\n*Deadline: November 24, 2025\\n*Category\\n-Photographs & 2D Digital Art\\n-Video & Interactive Art\\n-Painting, Sculpture & Installation Art\\n*Installation\\n-Photography & 2D Digital Art\\nSelected works will be printed in 1015 or 1010 inches, framed, and installed by our curators & assistants. If requested by the artist, works can be printed and framed in different sizes. Additional fees may apply.\\n-Video & Interactive Art\\nWe will provide projectors and DVD/DIVX players for the show. Multiple single-channel works will be screened through a projector. If the work is required to be screened through a projector exclusively, or more than two projectors/monitors are needed, please indicate the special requirements in the submission email. Additional fees may apply.\\n-Physical Works (Painting, Drawing, Print, Sculpture, and Installation Art)\\nThe artist is responsible for the shipment and delivery of his/her physical work to and from CICA Museum, as well as all related expenses. The two-dimensional work should be no larger than 39 inch (1 m) on the longest side, and the installation piece should be no larger than 39x39x79 inches (1 x 1 x 2 m, w x l x h). The work that needs to be mounted on the wall should not exceed 10 kg. Please indicate in the submission email if you are interested in exhibiting works exceeding the size/weight limit.\\n*Exhibition Dates: August 19  September 6, 2026\\n***The dates are subject to change.\\n*How to submit your work: Please visit our website for more information.\\nhttps://cicamuseum.com/call-for-artists-circle/"
    },
    {
        "title": "True Blue | 2025 International Art Competition - Temporary, Artist Calls",
        "organization": "Blue Koi Gallery",
        "location": "Other",
        "deadline": "01/01/2026",
        "url": "https://arts.ca.gov/collective/blue-koi-gallery-242-4-true-blue-2025-international-art-competition/",
        "description": "We invite artists and photographers to submit to True Blue, an open-themed art competition dedicated to exploring Blue, in all its emotional, symbolic, and visual depth. Were seeking work that expresses what blue means to you.\\nWhether your vision is literal or abstract, cool-toned or emotionally charged, True Blue is your opportunity to showcase artwork that resonates with this timeless color and concept. All mediums, styles, and interpretations are welcome.\\nWe welcome artists and photographers from around the world, 18 years and older. Whether bold or subtle, abstract or representational, your work belongs here\\nThe Winner will receive:\\n           Cash prize\\n           Exhibition feature\\n           Official certificate\\n           Media promotion\\n           Highlight in the KAA newsletter\\n$25 for 4 images/ $40 for 6 images    Entry deadline: December 31, 2025."
    },
    {
        "title": "15th Annual Nature Online Art Competition - Temporary, Artist Calls",
        "organization": "Light Space & Time Online Art Gallery",
        "location": "International",
        "deadline": "11/28/2025",
        "url": "https://arts.ca.gov/collective/light-space-time-online-art-gallery-235-4-15th-annual-nature-online-art-competition/",
        "description": "Light Space & Time Online Art Gallery announces the 15th Annual Nature Online Art Competition.\\nThe Nature theme is the artists interpretation and depiction of nature art. Nature subjects include geographical subjects, landscapes, natural objects, wildlife and natural environments. Both 2D & 3D artists (including photography & digital arts) are invited to submit their best representational and/or abstract art.\\nBest in Show winner will receive a cash prize. Winners receive extensive worldwide publicity and promotion.\\nEntry Fees: $18.00 for 1 to 2 entries / $26.00 for 3 to 5 entries. Early entry and art student discounts.\\nThe deadline to apply is November 27, 2025.\\nFor further information and to apply online: https://lightspacetime.art/15th-annual-nature-art-competition-2025/\\nAbout Light Space & Time Online Art Gallery\\nLight Space & Time Online Art Gallery conducts monthly themed online art competitions and art exhibitions for new and emerging artists on a worldwide basis.  It is the gallerys intention to help todays artists to successfully market their art to a worldwide audience."
    },
    {
        "title": "First Light - Temporary, Artist Calls",
        "organization": "FOLD Gallery",
        "location": "California",
        "deadline": "12/16/2025",
        "url": "https://arts.ca.gov/collective/fold-gallery-231-4-first-light/",
        "description": "Exhibition Title:\\nFirst Light\\nDeadline to Apply:\\nDecember 15th, 2026\\nExhibition Dates:\\nMarch 2nd  April 21st\\nLocation:\\nSpring Arts Gallery\\nTheme Overview:\\nFirst Light invites artists to explore the powerful symbolism and sensory experience of dawn  the moment light first breaks through darkness. Whether interpreted literally, metaphorically, emotionally, or spiritually, First Light represents new beginnings, awakening, revelation, and the quiet resilience of hope.\\nWere seeking works that engage with themes such as:\\nRenewal and rebirth\\nThe transition from darkness to light\\nBeginnings, origin stories, or first experiences\\nLight as a medium, metaphor, or motif\\nThe interplay between shadow and illumination\\nWho Can Apply:\\nWe welcome emerging and established artists working in all mediums, including but not limited to:\\nPainting, drawing, printmaking\\nPhotography and digital art\\nSculpture and installation\\nVideo, new media\\nMixed media and conceptual works\\nArtists of all backgrounds and identities are encouraged to apply.\\nSubmission Guidelines:\\nPlease submit the following via Info@FOLDdtla.com"
    },
    {
        "title": "OPEN CALL FOR CURRENTS 2026: ART & TECHNOLOGY FESTIVAL - Temporary, Artist Calls",
        "organization": "CURRENTS New Media",
        "location": "Western States",
        "deadline": "12/05/2025",
        "url": "https://arts.ca.gov/collective/currents-new-media-248-4-open-call-for-currents-2026-art-technology-festival/",
        "description": "CURRENTS New Media is now accepting submissions for our 17th annual Art and Technology Festival in Santa Fe, New Mexico. Please feel free to forward our call for submissions to anyone in your network who you would feel would benefit from this opportunity!\\nCall for Submission:\\nCURRENTS 2026 Art & Technology Festival\\nSubmission Deadline: December 5, 2025\\nFestival Dates: June 12  21, 2026\\nEvery summer since 2010,\\nCURRENTS New Media\\npresents one of the leading art and technology festivals in the United States. Based in Santa Fe, New Mexico, CURRENTS brings together the work of established and emerging new media artists from the USA and around the world.\\nThis years submission categories include:\\nInstallations\\nSound Environments/Installations\\nVirtual, Augmented, and Mixed Reality Environments\\nArtist/AI Collaboration\\nRobotics/Kinetic/Electro-Mechanical Objects and Installations\\nMultimedia Performance\\nFabrication and 2D/3D Printing\\nWearables\\nExperimental Single Channel Video, Experimental Documentary, and Animation\\nSubmission Fee:  $25/single, $20 each/multiple\\nDue to the already high and escalating cost and risks of international shipping we may not be able to support this expense for international artists. We may be able to supply needed equipment.\\nPlease read the Submission Guidelines before filling out the form\\nBegin your submission process\\nHERE\\n.\\nCURRENTS 2026 Festival Homepage\\nFestival Video Documentations on Vimeo\\nOur Mission:\\nCURRENTS New Media is an annual art + technology festival, year-round exhibition/experience space, and non-profit organization based in Santa Fe, New Mexico USA. We support 21st Century art making and innovative creatives. Our festival, educational programs, and exhibition space give the public year-round access to immersive and expansive art experiences.\\nThe Festival is the result of a collaboration between Parallel Studios, its partners throughout the city and the many volunteers who invest their time to support this project.\\nQuestions?\\nContact us"
    }
]