[
    {
        "title": "FALL* $1,800.00 Innovate Grants for Art + Photo - Temporary, Artist Calls / Grants",
        "organization": "Innovate Grant",
        "location": "International",
        "deadline": "12/12/2025",
        "url": "https://arts.ca.gov/collective/innovate-grant-235-4-fall-1800-00-innovate-grants-for-art-photo-2/",
        "description": "FALL 2025 OPEN FOR SUBMISSIONS\\n Innovate Grant is thrilled to introduce our newly increased award amounts of $1,800.00.\\nInnovate Grant\\nawards (2) $1,800.00 grants each quarter, to one Visual Artist and one Photographer. In addition, (12) honorable mentions (6 in art and 6 in photo), will be featured on our website and join a growing community of vibrant and talented artists. Innovate Grants commitment extends beyond the grant cycle by promoting the work of selected winners and honorable mentions into the future. For more information and to apply visit\\nhttps://innovateartistgrants.org\\nInnovate Gran\\nt supports artists and photographers through quarterly grants. Weve simplified the grant process, so that artists and photographers can focus on making their innovative work. The work should speak for itself and our application reflects that.\\nInnovate Grant\\nawards:\\n+ 1 x $1,800.00 Grant to a Visual Artist\\n+ 1 x $1,800.00 Grant to a Photographer\\n+ 12 x Honorable Mentions\\nExplore the work of ALL Past Innovate Grant recipients and read their interviews at\\nhttps://innovateartistgrants.org\\nHow to Apply: Visual Artists and Photographers 18 years and older, from all around the world, are eligible to apply. All media and genres are accepted. All applicants retain the right to the work they submit. Apply today at\\nhttps://innovateartistgrants.org\\nCategory: Multiple disciplines and genres accepted\\nDeadline:  Thursday, December 11, 2025  Submit by 11:59PM Pacific Standard Time\\nRegion: US & International\\nAwards: 2 x $1,800.00 USD Grants // 12 x Honorable Mentions\\nApply Online Today\\nhttps://innovateartistgrants.org"
    },
    {
        "title": "Blu Sky Artist Award  January 2026 - Temporary, Artist Calls / Grants",
        "organization": "Ten Moir Gallery",
        "location": "International",
        "deadline": "02/01/2026",
        "url": "https://arts.ca.gov/collective/ten-moir-gallery-235-4-blu-sky-artist-award-january-2026/",
        "description": "Blu Sky Artist Award  January 2026\\nPresented by Ten Moir Gallery\\nThe Blu Sky Artist Award is a biannual international competition celebrating excellence in both Traditional/Mixed Media and Photography/Digital Art.\\nAwards: 2 winners ($500 each, interview, catalogue feature, press release, permanent website feature). 20 finalists (catalogue feature, certificate, website feature). All selected artists appear in the Blu Sky online collection.\\nKey Dates: Early Bird $25  Nov 15, 2025  Final Deadline Jan 31, 2026 ($35)  Results Feb 15, 2026.\\nEligibility: Open worldwide, ages 18+, all mediums welcome.\\nGuidelines: Submit up to 10 images (JPG/PNG, max 3MB each). Multiple entries allowed.\\nJoin artists worldwide in an award designed to amplify careers and visibility beyond the competition.\\n Enter now:\\nhttps://tenmoirgallery.com/blu-sky-emerging-artist-award/"
    },
    {
        "title": "Call for Art- THE BIG CHILL - Temporary, Artist Calls",
        "organization": "Art Fluent",
        "location": "International",
        "deadline": "01/23/2026",
        "url": "https://arts.ca.gov/collective/art-fluent-235-4-call-for-art-the-big-chill/",
        "description": "Art Fluent invites artists worldwide to submit artwork to our online exhibit, THE BIG CHILL.\\nTHEME\\nWinter strips it all down with its bare trees, frosted mornings, and that sharp breath of cold air. But its not all icy; theres cocoa, cozy fires, and the sparkle of snowflakes, too. Show us your version of winters beauty and transformation show us THE BIG CHILL from your perspective.\\nCALENDAR\\nJPEGs due by Friday, January 23, 2026, at midnight MST.\\nNotification of acceptance and online gallery opening by Friday, February 20, 2026.\\nAWARDS\\nAll accepted pieces will be displayed in our online gallery at www.art-fluent.com\\nBest of Show: $750\\nTwo Directors Choice awards: $250 each\\nENTRY FEE\\n$25 for first entry/$10 for each additional entry. You may enter up to 20 total. Payment is non-refundable and does not guarantee acceptance. For 3D work, there is no need to pay for additional entries for detail shots. Once your first entry is made, you may send additional views by email to hello@art-fluent.com.\\nELIGIBILITY\\nThis call is open to artists worldwide, both amateur and professional. Work selected for previous exhibits with Art Fluent will not be considered.\\nRULES\\nWork copied or done under the guidance of an instructor is not eligible. Open to ALL fine art mediums (oil, acrylic, watermedia, pastel, drawing, printmaking, mixed media, photography, sculpture, fiber, wood, ceramics, film/video, digital art). AI will not be accepted. Diptychs and triptychs should be uploaded as a single image.\\nSELECTION PROCESS\\nDirectors choice. Each show is curated and juried by Creative Director Amy Matteson Neill, along with an anonymous committee of jurors. Please note, there is no personal feedback given by jurors.\\nENTRY PROCEDURE\\nEntry is done through CaF, a web-based service that allows artists to upload images and organize their artwork for submissions to galleries. To apply for a call, you must leave our website and go to the CaF website at www.callforentry.org where you can create a FREE artist account. You will add your details and upload your images to CaF and then you can submit work to THE BIG CHILL. If you have any questions, please contact us at hello@art-fluent.com. We are happy to walk you through the process.\\nMEDIA PREPARATION\\nPlease only submit properly cropped images of your work that are in focus. We have a free resource for artists with tips on how to get high-quality images of their work. Visit www.art-fluent.com/resources for a free download. CaF also offers tips on its blog, which you can find here: www.callforentry.org/photographing-artwork/.\\nAll images must be in JPEG/JPG format using CaF guidelines. The image size must be 1,200 pixels or greater on the longest side. The maximum file size is 5 mb.\\nAccepted video formats include MOV, MP4, WMV. Aspect ratio 4:3 or 16:9, resolution minimum 640480, maximum 1920 x1080, bit rate recommended above 240 kbps, recommended frame rate 30 fps. File size must be under 100 MB. If your video work has been selected for the exhibit, we kindly request that you provide us with the file link via Vimeo. Please ensure the linked video is set to be shared publicly. Your video will not play if it is set to private.\\nNOTIFICATION\\nNotification will be done by email; everyone who submits will be notified of the jurors selections. If for any reason you do not hear from us by the notification date, please check the filters in your email account. Notification emails are sent to the email on file with CaF.\\nSALES\\nAll sales inquiries will be directed to the artists website and/or contact information. The artists receive 100% of the sale for any artwork sold.\\nGIVING BACK\\nA portion of the proceeds from the entry fees is donated to organizations committed to the arts and supporting artists.\\nREQUIRED FORMS\\nCash awards over $600 are subject to federal income tax withholding within the United States. A W-9 form must be filled out by the winner and submitted to Art Fluent, Inc.\\nREGULATIONS\\nBy entering our calls for art through CaF, you agree to be added to Art Fluents email list for forthcoming artist opportunities. By submitting images, you agree that the images are your own work, nothing copied, you own all rights to the images, and you take full responsibility for the content of all images, including the likeness of recognizable individuals. The actual artwork will remain the property of the artist, our mission is to promote artists and their work. Should your work be accepted, you grant Art Fluent the right to reproduce your image on our website, on social media, and where appropriate to help promote further online opportunities. Art Fluent will always credit you and your copyright wherever feasible. We will not use your image for any other purpose without the artists permission."
    },
    {
        "title": "Urban Life | Juried Online Art Exhibition - Freelance, Artist Calls",
        "organization": "UPWARD gallery",
        "location": "International",
        "deadline": "10/29/2025",
        "url": "https://arts.ca.gov/collective/upward-gallery-235-5-urban-life-juried-online-art-exhibition/",
        "description": "UPWARD Gallery invites artists to submit artwork for our juried online art exhibition, Urban Life.\\nThis exhibition features artworks exploring themes of city life, such as community, culture, movement, and the complexity of urban landscapes.\\nWe welcome submissions from a variety of media, including but not limited to: painting, drawing, digital painting, sculpture, printmaking, photography, textiles, and mixed media.\\nAwards: Interviews and other publications are featured in the print edition of UPWARDs magazine and on the website, digital certificate, and personal artist page on the gallery website. The exhibition will be promoted online via our website and social media channels. All artists retain 100% of sales with inquiries directed to them.\\nFee: $15 for entry, $12 (2-4 entries), $10 (5 or more entries).\\nDeadline: October 29, 2025\\nVisit\\nhttps://upwardgallery.com/ad/competitions/116/urban-life\\nfor a full information.\\nThe UPWARD Gallery was founded in 2021. Our online platform is designed to share art with new audiences using modern technologies. We assist emerging artists in gaining recognition and established artists in expanding their influence."
    },
    {
        "title": "UCLA Film & Television Archive   Artist in Residence - Temporary, Artist Calls",
        "organization": "UCLA Film & Television Archive",
        "location": "Los Angeles",
        "deadline": "11/15/2025",
        "url": "https://arts.ca.gov/collective/ucla-film-television-archive-236-4-ucla-film-television-archive-artist-in-residence/",
        "description": "The UCLA Film & Television Archive will host an emerging artist for two weeks to activate the Archives collection in their artistic practice. The program provides the artist with time, support, and access to select Archive collections.\\nApplication deadline: Monday, November 14, 5 p.m. Pacific Standard Time\\nFor more information about the residency and to submit an application, please visit the Archives website: https://cinema.ucla.edu/blogs/archive-blog/apply-2026-artist-in-residence-program\\nThe Archive recognizes that barriers to archival access have limited engagement with this rich collection, particularly among emerging artists and cultural producers from marginalized communities. In the selection process, the advisory committee will prioritize proposals that are responsive to todays cultural context. The candidate is not required to have an academic background and can work in the visual arts, archiving, filmmaking and time-based media. The program is not open to currently enrolled students. The Archive will provide an honorarium of $10,750 for the selected artist-in-residence.This program is made possible with support from the Golden Globes Foundation."
    },
    {
        "title": "InterContinental Music Awards  Enter the most cultural and inclusive music and songwriting contest in Los Angeles (Enter for a chance to win great prizes, including our $1000 ICon Award prize! ) - Temporary, Artist Calls",
        "organization": "InterContinental Music Awards",
        "location": "Other",
        "deadline": "04/16/2026",
        "url": "https://arts.ca.gov/collective/intercontinental-music-awards-242-4-intercontinental-music-awards-enter-the-most-cultural-and-inclusive-music-and-songwriting-contest-in-los-angeles-enter-for-a-chance-to-win-great-prizes-includin/",
        "description": "InterContinental Music Awards  Enter the most cultural and inclusive music and songwriting contest in Los Angeles\\nSubmissions are now Closed and the finalists will be announced by June 30th, 2025 and the Winners expected to be announced in Late August!\\n2026 Early Bird submissions are now open until November 30th 2025. Enter for a chance to win amazing prizes, including our $1000 ICon Award!\\nRecognized and acknowledged by the City of Los Angeles, the InterContinental Music Awards (ICMA) is a well-known international music competition dedicated to celebrating musical talent from around the world.\\nBeing a winner at the InterContinental Music Awards not only brings credibility but also opens doors to the global music stages, including worldwide recognition, opportunities for bookings, the chance to network with peers in the music industry and many more.\\nIn addition, winners have the exclusive opportunity for mentoring sessions with top-tier industry experts, which can significantly boost their career prospects.\\nHere is a taste of what musicians discover in ICMA:\\n A single $1000 prize (ICon Award)!\\n International promotion and recognition through major media outlets, our website, and social media channels, opening doors to global opportunities.\\n A unique chance to join a multi-cultural network of artists, influencers, and industry leaders from around the world.\\n Access to exclusive online sessions led by industry experts on The Landscape of the Music Business with professional insights and international opportunities.\\n-A one-on-one session with members of the judging panel, offering insights and advice tailored to their specific music journey (Only for emerging artists).\\n2026 Early bird Submissions are now open /  deadline is on Nov 30th 2023 so submit your music today!"
    },
    {
        "title": "Yellow Art Contest - Temporary, Artist Calls",
        "organization": "Grey Cube Gallery",
        "location": "International",
        "deadline": "10/23/2025",
        "url": "https://arts.ca.gov/collective/grey-cube-gallery-235-4-yellow-art-contest-3/",
        "description": "Grey Cube Gallery proudly presents the fifth Yellow online art contest for the month of October 2025. Contest is open to all artists worldwide over 18 years of age. The theme may include any work with depiction of the color Yellow or shades of Yellow (beige, lemon yellow, canary yellow, golden yellow). All visual art mediums (except video and sound) are allowed. Best of Show artwork will be on the poster of the show. Winning artists (Merit Award & Honorable Mention) will receive a digital award certificate. The deadline to submit entries is the October 23, 2025."
    },
    {
        "title": "Group Exhibition with Prizes and Publication Juried by Joseph DeLappe - Freelance, Artist Calls",
        "organization": "Center on Contemporary Art",
        "location": "International",
        "deadline": "11/10/2025",
        "url": "https://arts.ca.gov/collective/center-on-contemporary-art-235-5-group-exhibition-with-prizes-and-publication-juried-by-joseph-delappe/",
        "description": "Call for Art: We Dont Need This Fascist Groove Thang\\n2025 Annual Exhibition\\nJuried by Joseph DeLappe\\nFrom December 4, 2025 February 21, 2026, CoCA will present the latest incarnation of its storied series exploring contemporary art, the CoCA Annual, a juried group exhibition seeking work from emerging as well as established artists in the Northwest and worldwide. For the 25th edition, CoCA is proud to announce Joseph DeLappe as juror.\\nJoseph DeLappe, (American, b. 1963), is an artist, activist and educator, currently working in Scotland, where he is the Professor of Games and Tactical Media at Abertay University, Dundee. Working with electronic and digital media since 1983, his projects in online gaming performance, sculpture and electromechanical installation have been shown throughout the world.  Considered a pioneer in the critical and creative engagement of video games, performance, activism and community-based practices, DeLappe co-edited INCITE: Digital Art and Activism (Peacock Visual Arts) with art historian and curator Dr. Laura Leuzzi in 2023. In 2017 he was awarded a Guggenheim Fellowship in the Fine Arts.\\nwww.delappe.net. We are grateful to him for the following description of the exhibition:\\nWe Dont Need This Fascist Groove Thang\\nThe world we inhabit is in a state of ongoing upheaval. We have witnessed the onslaught of authoritarianism in the USA, with escalating attacks on civil rights, immigrants, the degradation of freedom of speech and expression, reversals on reproductive autonomy, the erasure of LGBTQIA+ rights, etc. Our collective landscape continues to grow more volatile. We have lived through the global pandemic, witnessed systemic state violence against minorities, witnessed the Russian invasion of Ukraine, the brutal genocide in Gaza, intensifying climate catastrophes, and felt the shockwaves of Roe v. Wade being overturned. The ongoing erosion of democratic institutions, and the weaponization of digital technologies have only deepened the sense of instability\\n.\\nIn these struggles, is it possible, even necessary, for artists, technologists, writers, and activists to imagine alternative futures, challenging dominant narratives, and carve out spaces of truth, dissent, and hope?\\nWe Dont Need This Fascist Groove Thang is a call for artworks across all media that respond to our current moment of intersecting crises. We are seeking works that confront, question, and resist the politics of authoritarianism, nationalism, and hate, while also proposing creative strategies for care, solidarity, survival, and beauty.\\nWe welcome submissions in any formvisual art, performance, games, writing, film, sound, installation, digital media, and hybrid practices. This exhibition is rooted in the belief that creativity is both a tool of resistance and a catalyst for change. Lets come together to insist that another world is possibleand that we dont need this fascist groove thang!\\nThe deadline for submissions is midnight on Sunday, November 9 There will be a series of opening receptions, all on the Pioneer Square ArtWalk on First Thursday, December 4, January 1st, and February 5 at CoCAs Pioneer Square location inside the Tashiro Kaplan Building at 114 Third Ave. South, Seattle, 98104. Other related events and performances will be determined from the submissions.\\nArtists in any region and any country are welcome to submit. A $500 first prize, $250 second prize, and $150 3rd prize will be awarded by the juror, as well as up to two $50 honorable mentions featured on CoCAs website and become part of the ongoing 45-year archive (Prize monies in USD). A catalog of the show will feature artists statements, biographies, and images, as well as a short introductory essay by the juror.\\nTo apply:\\nFull details at: https://www.cocaseattle.org/calls-for-art. Applications are electronic and can be made entirely online at http://www.cocaseattle.org/submission.php.\\nBe sure to enter Annual when asked what you are submitting for. Deadline: electronic submission completed as of midnight on November 9, 2025. The online system will ask you to:\\n       Submit up to 10 images of the artwork for consideration. Format is jpg file, max. dimension of 2400 pixels in at least one direction. For video / performance / dance, please include a link and make sure that access is open for review period (or include password in Work Description).\\nEnter a Work Description (max. 500 words): In addition to title, dimensions, edition, medium, year, and price (or NFS) for each artwork, consider the body of work as a unit, indicating whether new work or old, part of a series or not, previously exhibited, result of a collaboration, etc. Artwork is for sale at 60% Artist, 40% CoCA (70% Artist, 30% CoCA for members) and can also be NFS.\\n       Upload an Artists statement specific to the theme of the exhibition (250 words): This will appear in the catalog if accepted.\\n       Upload an Artists biography (200 words), including year of birth, city of origin, awards, honors, shows, degrees. This will also appear in the catalog if accepted.\\n       $25 (USD) entry fee (PayPal). Make sure to note the applicants name in the payment.\\nOffers will be made through email, accompanied by an Art Loan Agreement and additional information by the week of November 17; artists must confirm by email no later than November 20.\\nPlease note that selected work must be shipped, transmitted, or dropped off to the gallery by November. CoCA insures work during exhibition, but shipping to/from, as well as shipping insurance remain the responsibility of the artist.\\nCOMPLETE EXHIBITION TIMELINE:\\nCall goes out: Sept. 20\\nDeadline for Artists: November 9 2025 Sunday at midnight\\nOnline review period: Nov. 10  15\\nArtist confirmations and loan agreements Nov. 16  20\\nShipping: Week of Nov. 17\\nDrop-off: Sunday Nov. 23, 12p  4p, or by arrangement\\nCatalog deadline for essay: Nov. 17\\nInstall: Nov. 24  Dec. 3\\nOpening reception(s): Thursday Dec. 4, Thursday Jan. 1 (TBD), Thursday Feb.5\\nExhibition Dates: Dec. 3  Feb. 21 CoCA\\nHoliday Closure: December 14  Dec. 31 De-install: week of Feb. 23 (exhibition is up for 2.5 months)\\nPlease note that selected work must be shipped to the gallery by November 24. CoCA insures work during exhibition, but shipping to/from, as well as shipping insurance remain the responsibility of the artist.  Email info@cocaseattle.org  for questions / more information.\\nShip to:\\nCenter on Contemporary Art\\n114 Third Ave. South\\nSeattle WA 9104\\nUSA"
    },
    {
        "title": "SCG Artist Residency  Local Call - Temporary, Artist Calls / Internships",
        "organization": "Blue Line Arts",
        "location": "Northern CA",
        "deadline": "10/05/2025",
        "url": "https://arts.ca.gov/collective/blue-line-arts-239-4-scg-artist-residency-local-call/",
        "description": "The SCG ART program brings established artists to Placer County for the purpose of teaching and sharing their artistic talents and experience to the greater community. The program was lovingly established at PCF in memory of a local artist, Susan Cooley Gilliom, by her family.  Both Susan and her mother took part in workshops from established and talented artists.  They appreciated the perspective and expertise it offered their own work and wanted similar opportunities afforded to local artists, art students, art educators and art enthusiasts in Susans hometown and county.\\nPlacer Community Foundation (PCF) is a nonprofit public benefit corporation which manages the Susan Cooley Gilliom Artist in Residence & Teaching Program (SCG ART Program).  In partnership with PCF the program is housed through Blue Line Arts in Roseville, CA.\\nTerms of Residency:\\nThe selected artist will be required to lead the following activities during the residency from April 10th  May 1st, 2026:\\nArtist Lecture Presentation (1 hour):Saturday, April 18th, 2026 from 4:00PM  5:00PM during a 3rd Saturday Reception at Blue Line Arts.\\nOpen Studio Hours: for up to two hours per day during gallery hours (Tuesday-Saturday from 11-5pm). Dates and times will be confirmed with the selected artist.\\nSchool Tours:At least 1-2 visits by local students, on-site at Blue Line Arts. Dates and times will be confirmed with the selected artist.\\nUp to 2 Workshops:Dates and times will be confirmed with the selected artist.\\nFor example, previous SCG ART recipients have taught 2 art workshops that are 2 or 3 days long for beginner, intermediate, advanced or all skill levels.  Topics can include but are not limited to: professional development for artists, art techniques and process in a variety of different visual art mediums such as painting, drawing, ceramics, printmaking, fiber arts, etc.\\nCompensation:\\nThe selected Artist will be awarded studio residence in the Broad Education Gallery at Blue Line Arts for three weeks from Friday, April 10th  May 1st, 2026\\nThe selected Artist shall receive an Honoraria of $10,000 that will be paid directly to the Artist as follows: 25% upon arrival and 75% upon departure\\nThe selected artist shall receive a total per diem (for food, etc) in the amount of $1,470\\nLearn more and apply\\nhere\\n."
    },
    {
        "title": "CALL FOR ART: GO FIGURE  ART OF THE HUMAN FORM - Temporary, Artist Calls",
        "organization": "O'Hanlon Center for the Arts",
        "location": "National",
        "deadline": "11/03/2025",
        "url": "https://arts.ca.gov/collective/ohanlon-center-for-the-arts-238-4-call-for-art-go-figure-art-of-the-human-form/",
        "description": "Call for Art: Go Figure  Art of the Human Form\\nAn Online Art Exhibition\\nOHanlon Center for the Arts\\nNovember 20, 2025  January 2026\\nJuried by\\nJen Tough\\n\\nOHanlon Center for the Arts invites you to submit work for our upcoming online exhibition: :\\nGo Figure  Art of the Human Form\\nWe welcome imaginative and creative interpretations of the human figure, whether abstract, representational, or experimental. All media except video are eligible.\\nKey Dates\\nDeadline to Submit on\\nCaFe\\n:\\nNovember 3, 2025 (11 pm PT)\\nNotifications Sent: November 12 (by 5 pm PT)\\nExhibition Dates: November 20, 2025  January 2026\\nZoom Roundtable with Juror: November 20 (4 pm PT)\\nEntry Fee\\n$30 general/ $25 OHCA members\\nUp to 3 works may be submitted\\nCaFE SUBMISSION\\nContemporary, expressionistic, abstract, exploratory, and/or experimental entries encouraged.\\nPoster art by: Heritage by Lawrence Buford (pencil)\\nDesign by: JT Design"
    },
    {
        "title": "Call for Composers - Freelance, Artist Calls",
        "organization": "California Symphony",
        "location": "Other",
        "deadline": "10/31/2025",
        "url": "https://arts.ca.gov/collective/california-symphony-242-5-call-for-composers/",
        "description": "California Symphonys Composer-In-Residence Program is designed to give early-career professional composers and/or graduate students in composition an opportunity to work with a professional orchestra and conductor for a three-year residency from August 1, 2026, through July 31, 2029.\\nThe residency provides a unique opportunity to compose, rehearse, premiere, and record multiple orchestral compositions for three consecutive years. Each season, there will be a recorded 30-minute reading workshop with the complete orchestra, from which study recordings will be provided. The composer, conductor, and orchestra become partners in the creative process, working together as the composition develops.\\nAPPLY HERE\\n: https://www.californiasymphony.org/composer-in-residence-application/\\nPrevious California Symphony composer alumni have won national & international awards, serve as faculty at universities across the country, and continue to compose and receive commissions.\\nAll rounds in the selection process are assessed in a blind review process, meaning your work will be considered anonymously and without prejudice.\\nWere eager to hear your work, and we invite you to apply for the unique opportunity to build a relationship with one of the premier regional orchestras in the United States.\\nThe resident composer will receive the following:\\nAn honorarium/commission fee for each work\\nThree world premieres to be performed during 2026-27, 2027-28, and 2028-29 seasons\\nThree recorded 30-minute reading workshops with the orchestra\\nAccommodation and airfare for two residency weeks each season\\nCollaboration with Artistic & Music Director Donato Cabrera and California Symphony musicians\\nEngagement with community members, California Symphony Board of Directors, donors, and staff\\nPublicity and marketing for each premiere\\nThe Composer will participate in the following activities:\\nOn-site visits to local schools\\nPre-concert lectures\\nSpecial receptions and/or cultivation events\\nAssist with the search for the next composer in residence\\nSupport concert promotion, including writing guest blogs, providing social media content, and interviews with the press\\nQualifications\\nEarly career professional composer and/or graduate student in composition\\nA citizen or a permanent resident of the United States"
    },
    {
        "title": "Affordable Live/Work studios for sale in Emeryville - Full Time, Artist Calls",
        "organization": "45th Street Artists' Cooperative, Inc.",
        "location": "SF Bay Area",
        "deadline": "10/26/2025",
        "url": "https://arts.ca.gov/collective/45th-street-artists-cooperative-inc-245-2-affordable-live-work-studios-for-sale-in-emeryville/",
        "description": "TWO AFFORDABLE LIVE/WORK STUDIOS FOR SALE\\nFounded in 1973, the 45th Street Artists Cooperative (Emeryville Artists Cooperative) is the City of Emeryvilles first established arts organization. Visual artists, musicians, choreographers, writers, designers and fine craftsmen, many of national and international stature, constitute their membership. Over the past four decades, the Cooperative has grown from a dozen studios in one converted warehouse building to nearly 60 studios in three buildings. Today, as a non-profit, limited-equity housing cooperative, it is a national model for affordable artist-owned housing.\\nStudio #38\\n:\\nSquare Footage Totals: 930.5 Sq Ft (Ground floor: 455 Sq Ft / Loft space above ground floor: 415 Sq Ft / loft space over common space: 60.5 Sq Ft)\\nBuy in cost: $81,300.00\\nMonthly assessment: $347.95 / Monthly average utilities: $116.82 Move in date: Thursday, January 1, 2026\\nDESCRIPTION: Studio #38 is an interior studio with one entrance from the hallway, close to the buildings front entrance and to the mailroom. The entryway into studio is a 13 x 9.5ft room with a doorway into the main studio. In the main room has a functional sink and cabinets/countertop, along with a gas connection for a stove. There is a loft area covering most of the studio with a stairway accessing the second level with lots of natural light provided by four skylights. Additionally, there is a small 10 x 5ft storage closet that has access through a common area hallway.The studio does not include a restroom, but there is a communal restroom and showers in the building.\\nFURTHER DETAILS:\\n All interior utilities, including water, gas, and electric  Staircase to lofted area\\n Natural sunlight provided by four skylights\\n Small storage closet\\n No bathroom. Communal bathrooms in the building.\\nSTUDIO 38 DOCUMENTATION:\\nPhotos & videos\\nAPPLICATION DEADLINE: Sunday, October 26, 2025, 11:59 PM PT.\\nApplication form available online at\\nhttp://bit.ly/454jnjE\\n.\\nSTUDIO VIEWING DATES: Saturday, October 4 & Sunday, October 5, 1  4 PM;  Saturday, October 11 & Sunday, October 12, 1  4 PM\\nINTERVIEWS: Evening of Monday, November 17 or Tuesday, November 18, 2025\\n(candidates must be available for one of these dates on Zoom)\\nIMPORTANT DATES FOR FINALIST:\\nCommunity Interview: Sunday, November 23, 2025 (Zoom).\\nApproval by Board of Directors Meeting: Wednesday, December 17, 2025, 6:30 PM (chosen finalist must be available for this meeting).\\nMove in date: Thursday, January 1, 2026\\nStudio #37\\n:\\n2,046 Square Feet (1,470 Square Feet ground floor, 576 lofted)\\nBuy in cost: $186,861.80\\nMonthly assessment: $687.66 / Monthly average utilities: $238.86 Move in date: Thursday, January 1, 2026\\nDESCRIPTION: Studio #37 is an interior studio with one entrance from the hallway, close to the buildings front entrance and to the mailroom. The studio includes a large ground floor area, one bathroom, a darkroom, a walk-in storage closet, and two lofted sleeping and working areas. Natural light in the space comes from the one skylight and sawtooth windows from above. The ground floor space includes an open living room/workspace, an open-concept kitchen with a sink and bar island, and an area underneath the bedroom loft. The two lofted areas have separate staircases and look down into the ground floor space. The bedroom loft is above the walk-in closet, and the second loft is above the darkroom and bathroom.\\nFURTHER DETAILS:\\n All interior utilities, including water, gas, and electric\\n One bathroom with a clawfoot tub and oak hardware floors (one step to get to toilet and tub)\\n Darkroom with storage and operable stainless steel sink\\n Walk-in storage closet\\n Staircase to lofted bedroom area\\n Staircase to an additional loft area over darkroom and bathroom areas\\n Sawtooth windows and one skyligh\\nSTUDIO 37 DOCUMENTATION:\\nphotos & video\\nAPPLICATION DEADLINE: Sunday, October 26, 2025, 11:59 PM PT\\nApplication form available online at\\nhttp://bit.ly/454jnjE\\n.\\nSTUDIO VIEWING DATES: Saturday, October 4 & Sunday, October 5, 1  4 PM; Saturday, October 11 & Sunday, October 12, 1  4 PM\\nINTERVIEWS: Evening of Tuesday, November 11 or Wednesday, November 12\\n(candidates must be available for one of these dates on Zoom)\\nIMPORTANT DATES FOR FINALIST:\\nCommunity Interview: Sunday, November 23, 2025 (Zoom).\\nApproval by Board of Directors Meeting: Wednesday, December 17, 2025, 6:30 PM (choosen finalist must be available for this meeting).\\nMove in date: Thursday, January 1, 2026\\nINCOME QUALIFICATIONS:\\nApplicants must not exceed the\\nModerate Income Level for the City of Emeryville\\n. Please do not apply if you exceed the income limits.\\n1 Person Household: $132,250 | 2 Persons: $153,400 | 3 persons: $172,600\\nLOAN RESOURCES:\\nCity of Emeryville:\\nFirst Time Home-buyer Loan Program\\nNote: You may only apply for one studio. No applications will be accepted sight unseen. No phone calls please. Visit our website for more information."
    },
    {
        "title": "Call for Artists and Creators for the I-House Davis World Tour: Roots & Routes  Encounters with Diaspora, Community, and Cultural Practice - Freelance, Artist Calls",
        "organization": "International House Davis",
        "location": "Sacramento",
        "deadline": "10/07/2025",
        "url": "https://arts.ca.gov/collective/international-house-davis-243-5-call-for-artists-and-creators-for-the-i-house-davis-world-tour-roots-routes-encounters-with-diaspora-community-and-cultural-practice/",
        "description": "I-House World Tour: Roots & Routes is a series of events that takes place during the 2nd weekend of every month from November 2025 to May 2026 at International House Davis, exploring migration, memory, and cultural practice through performances, conversations, and community gatherings. The series invites artists, musicians, storytellers, makers and thinkers rooted in diasporic experience and transnational identity to co-create a 2-4 hour event at I-House. We are looking for artists, makers and practitioners from any discipline to propose work connected to diaspora, identity, belonging, and community. I-House is offering an artist fee of $500-$1500, along with marketing, planning support, rehearsal time, and day-of event assistance. I-House provides a venue with seating for up to 100, equipped with a stage, sound, and projection.\\nCheck out the\\nwebsite\\nfor the guidelines and how to apply."
    },
    {
        "title": "Call for Art: Sky & Clouds  Juried Online Art Competition - Temporary, Artist Calls",
        "organization": "Ten Moir Gallery",
        "location": "International",
        "deadline": "10/31/2025",
        "url": "https://arts.ca.gov/collective/ten-moir-gallery-235-4-call-for-art-sky-clouds-juried-online-art-competition/",
        "description": "Call for Art: Sky & Clouds  Juried Online Art Competition\\nDeadline: October 31st, 2025\\nOrganized by: Ten Moir Gallery\\nLocation: Online Exhibition (Worldwide Entry)\\nEntry Fee: $24 for 3 images\\nTheme: Sky & Clouds\\nTen Moir Gallery invites artists worldwide to enter the Sky & Clouds art competition. Submit work inspired by the open skywhether its sunrise, stormy weather, surreal cloudscapes, or abstract interpretations of atmosphere and light. All mediums accepted including painting, photography, digital, sculpture, and mixed media.\\nAwards & Recognition:\\nBest in Show: Cash Prize, Featured on homepage + newsletter, interview, certificate\\nTop winners: Cash Prize for 1st place, Featured in the online exhibition + social media spotlight\\nHonorable Mentions: Recognized in the exhibition\\nAll selected artists will have their work published in the online show\\nEligibility:\\nOpen to artists 18+ worldwide\\nAll experience levels welcome\\nMust submit original work\\nSubmission Link:\\nhttps://tenmoirgallery.com/sky-clouds-art-competition-juried-artshow-online/"
    },
    {
        "title": "Orange Art Competition & Virtual Exhibition - Freelance, Artist Calls",
        "organization": "Ten Moir Gallery",
        "location": "International",
        "deadline": "11/01/2025",
        "url": "https://arts.ca.gov/collective/ten-moir-gallery-235-5-orange-art-competition-virtual-exhibition/",
        "description": "Orange Art Competition & Virtual Exhibition\\nDeadline: November 1st, 2025\\nEntry Fee: $24 for 3 images\\nApply here:\\nhttps://tenmoirgallery.com/orange-online-open-call/\\nAre you ready to capture the essence of vibrant creativity? We invite talented artists and photographers to participate in our Orange Art Online Competition & Virtual Exhibition. This is your chance to explore the myriad aspects and meanings of the color orange, from its bold and energetic hues to its cultural and personal significance, and present your unique interpretation.\\nWith the potential to win $700 in cash prizes, this is an opportunity not to be missed! The Best in Show award offers a $150 cash prize, a solo exhibition, and extensive promotion. Plus, entry automatically qualifies you for the Blu Sky Artist Award, with a chance to win $500!\\nWe welcome all styles and 2d or 3d mediums, from vibrant paintings and detailed drawings to evocative photographs and mixed media pieces."
    },
    {
        "title": "Call for Artists: the International Exhibition Text-ure 2026 - Temporary, Artist Calls",
        "organization": "CICA Museum",
        "location": "International",
        "deadline": "10/16/2025",
        "url": "https://arts.ca.gov/collective/cica-museum-235-4-call-for-artists-the-international-exhibition-text-ure-2026/",
        "description": "CICA Museum invites artists worldwide to participate in the International Exhibition, Text-ure 2026 We are open to photography, 2D digital art, video art, interactive art, drawings, paintings, prints, sculptures, and installation art dealing with subjects on text, context, texture, and tactility.\\n*Deadline: October 16, 2025\\n*The categories include:\\n-Painting, Drawing, and Print\\n-Sculpture & Installation Art\\n-Photograph & 2D Digital Art\\n-Video & Interactive Art\\n*Installation\\n-Photographs & 2D Digital Art\\nSelected works will be printed in 1015 inches, framed, and installed by our curators & assistants. If requested by the artist, works can be printed and framed in larger sizes. Additional fees may apply.\\n-Video & Interactive Art\\nWe will provide projectors and DVD/DIVX players for the show. Multiple single-channel works will be screened through a projector. If the work is required to be screened through a projector exclusively, or more than two projectors/monitors are needed, please indicate the special requirements in the submission email. Additional fees may apply.\\n-Painting, Sculpture, & Installation Art\\nThe artist is responsible for the shipment and delivery of his/her physical work to and from CICA Museum, as well as all related expenses. The two-dimensional work should be no larger than 39 inch (1 m) on the longest side, and the installation piece should be no larger than 39x39x79 inches (1 x 1 x 2 m, w x l x h). The work that needs to be mounted on the wall should not exceed 10 kg. Please indicate in the submission email if you are interested in exhibiting works exceeding the size/weight limit.\\n*Exhibition Dates: July 8  26, 2026\\n***The dates are subject to change.\\n*How to submit your work: Please visit our website for more information.\\nhttps://cicamuseum.com/call-for-artists-the-international-exhibition-text-ure/"
    },
    {
        "title": "Grey Art Competition - Temporary, Artist Calls",
        "organization": "Grey Cube Gallery",
        "location": "International",
        "deadline": "10/10/2025",
        "url": "https://arts.ca.gov/collective/grey-cube-gallery-235-4-grey-art-competition-2/",
        "description": "Grey Cube Gallery proudly presents the fourth Grey online art contest for the month of October 2025. Artists from around the world are welcome to submit. Entries must include the black and white or shades of gray as the primary focus. All visual art mediums (except video and sound) are allowed. Winning artwork (Best of Show) will be on the poster of the show. All winning artists will receive a digital award certificate. The deadline to submit entries is the October 09, 2025."
    },
    {
        "title": "Arte Natura 2026 - Temporary, Artist Calls",
        "organization": "Limner Gallery",
        "location": "Other",
        "deadline": "02/28/2026",
        "url": "https://arts.ca.gov/collective/limner-gallery-242-4-arte-natura-2026/",
        "description": "Arte Natura is a thematic exhibition based on art inspired by the world of nature and biology. The exhibition will be held at the Limner Gallery, May 14  June 6, 2026 and is open for entry to all artists working in any media. All interpretations of the theme are acceptable, including landscape, fruits, vegetables, flowers, fauna and human figuration as part of the natural environment. Deadline February 28, 2026. On-line entry form at http://www.slowart.com/prospectus/natura.htm"
    },
    {
        "title": "Neoteric Abstract XIV: Call for Entries - Temporary, Artist Calls",
        "organization": "Limner Gallery",
        "location": "Other",
        "deadline": "01/31/2026",
        "url": "https://arts.ca.gov/collective/limner-gallery-242-4-neoteric-abstract-xiv-call-for-entries/",
        "description": "Neoteric Abstract is an annual, thematic exhibition dedicated to abstract art that is open for entry to all artists working in any media. The exhibition will be held at the Limner Gallery, April 9   May 2, 2026 and is open to all forms of abstraction, from the geometric to the lyrical, from the precise to the raw. The entry deadline is January 31, 2026.\\nThe entry form is online at:  http://www.slowart.com/prospectus/abstract.htm"
    },
    {
        "title": "Handheld for the Holidays  Group Show at Blue Line Arts - Freelance, Artist Calls",
        "organization": "Blue Line Arts",
        "location": "Northern CA",
        "deadline": "10/18/2025",
        "url": "https://arts.ca.gov/collective/blue-line-arts-239-5-handheld-for-the-holidays-group-show-at-blue-line-arts/",
        "description": "Blue Line Arts in Roseville, CA invites artists to submit smaller-scale handmade items such as mugs, bowls, etc that make great gifts this holiday season. For this show, artworks will be sold directly off the wall/shelf and there may be opportunities to restock work with local artists during the exhibition. You will be able to submit up to 10 artworks to be considered.\\nWe are only going to accept artworks priced at or below $100. For this opportunity we are specifically searching for works that are smaller in size and giftable. Please no commercially printed items or pre-manufactured items. We are specifically looking for handmade items.\\nVisit this\\nlink\\nto learn more about the application requirements and to apply!"
    },
    {
        "title": "Solo Show Opportunity at Blue Line Arts - Freelance, Artist Calls",
        "organization": "Blue Line Arts",
        "location": "Northern CA",
        "deadline": "10/18/2025",
        "url": "https://arts.ca.gov/collective/blue-line-arts-239-5-solo-show-opportunity-at-blue-line-arts/",
        "description": "Blue Line Arts, in Roseville, CA, invites emerging artists to submit proposals for a solo exhibition in one of our gallery spaces. This opportunity is ideal for early-career artists seeking to showcase a medium-sized body of work. This show will be on display in our Westpark Gallery space.\\nArtists who can demonstrate a range of work sizes and price points are encouraged to apply, as this enhances accessibility and engagement for a broader collector and viewer base.\\nThe Westpark gallery space is best suited to medium-to-small artworks, such as paintings, drawings, prints, or sculptures smaller than 24. While we welcome applications from artists working in all mediums, please note that large sculptural works or installation pieces may be more challenging to accommodate. This opportunity is free for Blue Line Artist Level members to apply!\\nVisit the\\nlink\\nto learn more about the application requirements and apply!"
    },
    {
        "title": "Placer One Public Art  RFQ - Freelance, Artist Calls",
        "organization": "Blue Line Arts",
        "location": "California",
        "deadline": "10/15/2025",
        "url": "https://arts.ca.gov/collective/blue-line-arts-231-5-placer-one-public-art-rfq/",
        "description": "Placer One  the trailblazing 2,200-acre community Taylor Builders is developing in Placer County, California  is founded on innovation and is coming to life through a partnership with Placer County, Sacramento State University, and Sierra College. Its thoughtful design prioritizes the environment, well-being, recreation, learning, and art and cultural opportunities.\\nPlacer One is seeking to commission three new artworks for this new collection. These purchases will be made and the work will be installed in collaboration with client Placer One, project manager Blue Line Arts, and art consultant Via Partnership.\\nArt Opportunities:\\n-Community Garden Fence Design\\n-Basketball Court Painting\\n-Secret Gem Sculptures\\nApplication Deadline: Wednesday, October 15, 2025\\nPlease visit the link (bluelinearts.org/placer-one-call-2025) to learn more and apply."
    },
    {
        "title": "4th Koi Artist Award - Temporary, Artist Calls",
        "organization": "Blue Koi Gallery",
        "location": "Other",
        "deadline": "11/30/2025",
        "url": "https://arts.ca.gov/collective/blue-koi-gallery-242-4-4th-koi-artist-award/",
        "description": "The Koi Artist Award is now open for entries. An Open Theme (Artists Choice) call that gives you complete freedom of self-expression. This is your chance to showcase your vision without limits.\\nWe welcome artists and photographers from around the world, 18 years and older, working in every medium, style, and genre. Whether bold or subtle, abstract or representational, your work belongs here.\\nThe Winner will receive:\\n        $500 cash prize\\n        Solo exhibition feature\\n        Official certificate\\n        Media promotion\\n        Highlight in the KAA newsletter\\nShare your creativity with a global audience. Submit today and let your art speak for itself.\\nEntry Fee: $35 for up to 8 images"
    },
    {
        "title": "Applications Now Open: Startup Art Fair LA 2026 - Temporary, Artist Calls",
        "organization": "Startup Art",
        "location": "Los Angeles",
        "deadline": "11/01/2025",
        "url": "https://arts.ca.gov/collective/startup-art-236-4-applications-now-open-startup-art-fair-la-2026/",
        "description": "Startup Art Fair LA is back February 27  March 1, 2026 at the fun and colorful Kinney Hotel in Los Angeles, with easy access to Venice Beach, Santa Monica and Marina Del Rey. Startup LA takes place concurrently with Frieze LA, Post Fair, and Felix Art Fairs nearby. Participating artists will have a fantastic opportunity to expose new work to a myriad of collectors, curators, gallery owners, art consultants, and writers who will be coming to the city for a weekend of contemporary art.\\nIts a rolling application process through November. Once accepted, you will immediatley be able to select the room of your choice, so APPLY EARLY to get your preferred spot!\\nSimply fill out our brief application and upload a CV, bio, exhibition proposal, and 4-8 images. Most artists exhibit solo in their rooms, however, up to 3 artists may apply to exhibit together.\\nYour artwork will be reviewed by an impressive Selection Committee of art world professionals:\\nBridgette Mayer, Owner/Director, Bridgette Mayer Gallery, Philadephia\\nLiz Garvey, Director, Co-Founder/Director, Garvey|Simon, NYC\\nMax Presneill, Director/Chief Curator, Torrance Art Museum, CA\\nFor more information about room types and sizes, exhibitor fees, exhibitor expectations and our comprehensive Art Services, visit the Artist FAQ section on our website."
    },
    {
        "title": "Nature Art Competition - Temporary, Artist Calls",
        "organization": "Artist Space Gallery",
        "location": "International",
        "deadline": "10/09/2025",
        "url": "https://arts.ca.gov/collective/artist-space-gallery-235-4-nature-art-competition-2/",
        "description": "We are pleased to announce our fourth Nature online Art Competition for the month of October 2025. The Nature theme may include everything that is nature related (landscapes, seascapes, skies, world of flora and fauna, etc). A variety of interpretations can be submitted (representative, abstract, conceptual). All visual art mediums are allowed.\\nIn addition to the selected artists, the jury will select award winners in the following art categories: painting, photography, sculpture. All selected artists will receive a digital award certificate. An article about each artist will be displayed alongside the best of show and three winners. The best of show will be displayed on the poster of the exhibition. Judging the artwork will be based on the following criteria: creativity, originality and quality of art, overall design, demonstration of artistic ability, and usage of medium. The jury will not consider artworks with pornographic or satanic content. Entry fees are $20 for two pieces of artwork. You may submit more than two images; there is no limit to the number of images an artist may submit. The application deadline is October 08"
    },
    {
        "title": "YICCA 25/26  International Contest of Contemporary Art - Temporary, Artist Calls",
        "organization": "Moho Association",
        "location": "International",
        "deadline": "11/20/2025",
        "url": "https://arts.ca.gov/collective/moho-association-235-4-yicca-25-26-international-contest-of-contemporary-art/",
        "description": "The main goal of the YICCA competition is to promote participating artists, offering them the opportunity to actively engage in the international contemporary art scene. International exposure and networking are the key strengths of YICCA, making this competition an exceptional opportunity for growth and visibility for the selected artists.\\nParticipants will have the chance to:\\n1. Win cash prizes:\\n1st Prize:  3,000.00\\n2nd Prize:  1,000.00\\n2. Promote their art through multiple channels:\\n Exhibit selected artworks: Artists will have the opportunity to showcase their works in a prestigious exhibition in a dedicated space chosen by the competition.\\n Network with industry professionals: Finalists will be able to expand their network by connecting with critics, curators, gallerists, and representatives of public and private art institutions who will attend the exhibition.\\n Maximum media visibility: The competition will be accompanied by an extensive advertising campaign, ensuring broad exposure for the works and artists through various communication channels, both during and after the event.\\nYICCA thus serves not only as a prestigious platform but also as a springboard for artists wishing to gain recognition in the global contemporary art world, furthering their careers in a highly qualified international context.\\nDATES AND DEADLINES\\nNovember 20, 2025: Applications deadline\\nDecember 9, 2025: Notification of winning artworks\\nJurys final decision will lead to a selection of 18 artists that will participate in the final exhibition.\\nAll kinds of art works are accepted, including video, installations and performances.\\nAll works will be presented by a picture or a video that must be followed by a description of the work.\\nAll works must be available for the final exhibition and have to be artists property.\\nThe contest is open to all artists or groups of artists and professionals from any country. There are no special qualifications required for entry.\\nAll information about terms and conditions of subscription is published on the official website\\nwww.yicca.org www.contest.yicca.org\\nTo register please complete the registration form on the official website.\\nYICCA\\nInternational Contest of Contemporary Art www.yicca.org\\nwww.contest.yicca.org"
    },
    {
        "title": "Dreams and Fantasy | Juried Online Art Exhibition - Freelance, Artist Calls",
        "organization": "UPWARD gallery",
        "location": "International",
        "deadline": "10/16/2025",
        "url": "https://arts.ca.gov/collective/upward-gallery-235-5-dreams-and-fantasy-juried-online-art-exhibition/",
        "description": "UPWARD Gallery invites artists to submit artwork for our juried online art exhibition, Dreams and Fantasy.\\nThis exhibition explores how the subconscious and imagination are refracted through the prism of surrealism and magical realism, how dreams and fantasies reflect the conflict between fate and choice, transformation, personal fears, and desires.\\nWe welcome submissions from a variety of media, including but not limited to: painting, drawing, digital painting, sculpture, printmaking, photography, textiles, and mixed media.\\nAwards: Interviews and other publications are featured in the print edition of UPWARDs magazine and on the website, digital certificate, and personal artist page on the gallery website. The exhibition will be promoted online via our website and social media channels. All artists retain 100% of sales with inquiries directed to them.\\nFee: $15 for entry, $12 (2-4 entries), $10 (5 or more entries).\\nDeadline: October 16, 2025\\nVisit\\nhttps://upwardgallery.com/ad/competitions/119/dreams-and-fantasy\\nfor a full information.\\nThe UPWARD Gallery was founded in 2021. Our online platform is designed to share art with new audiences using modern technologies. We assist emerging artists in gaining recognition and established artists in expanding their influence."
    },
    {
        "title": "Color and Shape | Juried Online Art Exhibition - Freelance, Artist Calls",
        "organization": "UPWARD gallery",
        "location": "International",
        "deadline": "10/14/2025",
        "url": "https://arts.ca.gov/collective/upward-gallery-235-5-color-and-shape-juried-online-art-exhibition/",
        "description": "UPWARD Gallery invites artists to submit artwork for our juried online art exhibition, Color and Shape.\\nThe exhibition explores the harmonious or conflicting relationships between color and shape, as well as the use of color to express mood and identity.\\nWe welcome submissions from a variety of media, including but not limited to: painting, drawing, digital painting, sculpture, printmaking, photography, textiles, and mixed media.\\nAwards: Interviews and other publications are featured in the print edition of UPWARDs magazine and on the website, digital certificate, and personal artist page on the gallery website. The exhibition will be promoted online via our website and social media channels. All artists retain 100% of sales with inquiries directed to them.\\nFee: $15 for entry, $12 (2-4 entries), $10 (5 or more entries).\\nDeadline: October 14, 2025\\nVisit\\nhttps://upwardgallery.com/ad/competitions/118/color-and-shape\\nfor a full information.\\nThe UPWARD Gallery was founded in 2021. Our online platform is designed to share art with new audiences using modern technologies. We assist emerging artists in gaining recognition and established artists in expanding their influence."
    },
    {
        "title": "Animal Kingdom 2025 Art Competition - Temporary, Artist Calls",
        "organization": "Fusion Art",
        "location": "International",
        "deadline": "10/02/2025",
        "url": "https://arts.ca.gov/collective/fusion-art-235-4-animal-kingdom-2025-art-competition/",
        "description": "Fusion Art announces the Animal Kingdom 2025 Art Competition.\\nFor this competition, both 2D and 3D artists, worldwide, are invited to submit their best art and photography depicting animals, both domestic and wild. The artwork can include any animals that live on land, in the sea or in the air. All artists, regardless of location or experience, are invited to submit their best representational and/or abstract art and photography.\\nThis is the 10th annual Animal Kingdom art competition that gallery has held.\\nChoice of a cash prize or complimentary one-year membership to Fusion Arts Members Gallery for Best in Show winners. Winners and finalists are provided with extensive worldwide publicity and promotion.\\nEntry Fees: $25 for 1-2 images / $40 for up to 5 images\\nThe deadline to enter is October 1, 2025.\\nPlease visit https://www.fusionartps.com/calls-for-artists/ for full competition guidelines and to submit.\\nAbout Fusion Art\\nFounded by Award winning artist, Chris and Valerie Hoffman, Fusion Art was envisioned and formed out of a passion for art and the artists who create it. The website promotes and connects new, emerging and established artists with collectors and art enthusiasts, while offering the opportunity to participate in art competitions, exhibitions and experiences."
    },
    {
        "title": "OPEN CALL  Viewpoint: Ceramics 2026 - Temporary, Artist Calls",
        "organization": "Hyde Art Gallery",
        "location": "San Diego",
        "deadline": "10/25/2025",
        "url": "https://arts.ca.gov/collective/hyde-art-gallery-244-4-open-call-viewpoint-ceramics-2026/",
        "description": "The Hyde Art Gallery and the Grossmont College Ceramics Program proudly presents VIEWPOINT: Ceramics 2026, the latest chapter in a storied ceramics exhibition series that began in 1977. Returning for Spring 2026, this juried showcase reimagines the spirit of the seminal VIEWPOINT exhibitions, which brought together artists from across Southern California to explore diverse perspectives in contemporary ceramic practice. Building on the legacy of past iterations, in 77, 78, 79, 80, 81, 83, 98, 99, 04, & 06, VIEWPOINT: Ceramics 2026 celebrates the enduring relevance and creative range of ceramics as both a functional craft and a conceptual art form. From sculptural installations and experimental surfaces to refined vessel forms and narrative-driven works, this exhibition offers a vibrant snapshot of what it means to be a ceramic artist today.\\nIMPORTANT DATES:\\nSUBMISSION DEADLINE: October 24th, 2025\\nThere is no submission fee, however please note that artists will be responsible for all shipping costs.\\nARTIST NOTIFICATION: November 7th, 2025\\nAdditional information and documentation may be requested from selected artists.\\nPOSTMARK DEADLINE: December 12th, 2025\\nIN-PERSON ARTWORK DELIVERY: Jan 12th, 13th, 14th, 2026 between 10am-2pm each day\\nEXHIBITION DATES: February 2nd  March 4th, 2026\\nRECEPTION: Tuesday, February 10th, 2026 from 4-6pm\\nIN-PERSON ARTWORK RETRIEVAL: March 5th, 6th, & 9th, 2026 between 10am-2pm each day\\nArtists requesting return shipment of their artwork must provide prepaid shipping. Please note that all artwork will be repackaged using the original shipping materials whenever possible.\\nELIGIBILITY/GUIDELINES:\\n Open to all ceramic artists aged 18 and older who currently reside in the United States, its territories (such as Puerto Rico, Guam, the U.S. Virgin Islands, American Samoa, and the Northern Mariana Islands), or on U.S. military bases abroad.\\n All submitted work must be primarily ceramic in material and may include mixed media where ceramics is the dominant medium.\\n Work must be original, completed within the past three years, and not previously exhibited at the Hyde Art Gallery\\nArtists are invited to submit up to three entries for consideration.\\nIf you have any additional questions or concerns, please reach out to the Hyde Art Gallery Director, Alex DeCosta at alex.decosta@gcccd.edu or visit www.hydeartgallery.com"
    },
    {
        "title": "International Art Competition Animals - Temporary, Artist Calls",
        "organization": "Art Room Gallery",
        "location": "International",
        "deadline": "10/02/2025",
        "url": "https://arts.ca.gov/collective/art-room-gallery-235-4-international-art-competition-animals-4/",
        "description": "Contemporary Art Room Gallery is proud to announce their 9th Animals Online Art Competition for the month of October 2025. This is an international competition and artists from around the world are welcome to submit their work. Through this call artists and photographers are invited to present their best artworks related to the world of animals. A variety of interpretations of Animals theme can be submitted (representative, abstract, conceptional). All visual art mediums are acceptable (painting, photography, drawing, sculpture, digital, prints, fiber art, collage or installation art) except sound and video art. Winning artwork (First place) will be on the poster of the show. All selected artists will receive a digital award certificate. The deadline to apply to this art competition is October 02 2025."
    },
    {
        "title": "Joy In Small Things Small Works Group Show Call for Artists - Freelance, Artist Calls",
        "organization": "Studio 55 Martinez",
        "location": "SF Bay Area",
        "deadline": "11/01/2025",
        "url": "https://arts.ca.gov/collective/studio-55-martinez-245-5-joy-in-small-things-small-works-group-show-call-for-artists/",
        "description": "We at Studio 55 Martinez are excited to invite you to exhibit your small works in an upcoming exhibition titled, Joy In\\nSmall Things. This group show is an opportunity for you to display small works that may be purchased and given as cherished gifts for the holidays, with 3% of sales going to local org Stand Together Contra Costa.\\nEligibility\\n: This exhibition is open to all emerging and established artists.\\nMedium\\n: painting, drawing, printmaking, illustration, watercolor, oil, acrylic, collage, ink, pencil, mixed media, digital art, photography, fiber and textile art, and sculpture.\\nSubmission guidelines:\\na. Artist may submit up to 3 pieces of artwork in any medium\\nb. Submissions must be high-resolution JPEGs at 300dpi, with the longest side measuring 1200 pixels without the frame or mat.\\nc. Submissions must include a description.\\nDates & deadlines:\\na. submission deadline November 1\\nb. approval/decline notices will be sent out on November 15\\nc. Drop off on or before Sunday, November 23, during gallery hours.\\nd. Reception Saturday, December 6\\ne. Pick up January 10 & 11, 2026 during gallery hours.\\nFees & sales agreement:\\na. Non-refundable $10 per submission.\\nb. 25% commission upon sale of artwork.\\nc. 3% of art sales (from gallery commission) will be donated to Stand Together Contra Costa\\nWork must be installation ready, meaning:\\na. Work must be framed or gallery-wrapped and ready for hanging\\nb. Flat D-ring, hardware, and wire must not be visible.\\nc. Work must be ready to hang with a wire. No saw-tooth hangers or protruding screw eyes.\\nd. Work must be clean and the frames in good condition\\ne. Unframed canvas and panels will have gallery-wrapped sides with no staples visible."
    },
    {
        "title": "Call for Proposals Fractured Foundations: 250 Years of American History - Temporary, Artist Calls",
        "organization": "American Museum of Ceramic Art",
        "location": "Southern CA",
        "deadline": "10/13/2025",
        "url": "https://arts.ca.gov/collective/american-museum-of-ceramic-art-246-4-call-for-proposals-fractured-foundations-250-years-of-american-history/",
        "description": "The American Museum of Ceramic Art (AMOCA) is proud to announce\\nFractured Foundations: 250 Years of American History\\n. We invite ceramic artists to participate in this exhibition by proposing recently created or new work in response to the exhibitions prompt.\\nAMOCAs exhibition\\nFractured Foundations\\ncoincides with the 250th anniversary of the founding of the United States. Through this call for proposals, AMOCA invites ceramic artists to to reconsider a historical event through the lens of contemporary art, challenging historical narratives and offering a more accurate perspective on our country. We invite artists to propose work that demonstrates resilience, injustice, triumph, and the impact of federal, state, and/or local policies. Proposed work must also reflect upon or reference an event in US history.\\nThe exhibition will run from June 27 to November 29, 2026.\\nProposals for\\nFractured Foundations\\nwill be accepted through October 12, 2025.\\nELIGIBILITY\\n Open to artists aged 18 or older residing in the United States\\n Artwork must consist of at least 50% clay\\n Artwork must be about a historical event in Americas history; artists may choose an event from the spreadsheet provided or select their own\\n Work proposed for the exhibition must be currently in progress or have been created within the last 3 years\\nGUIDELINES for ACCEPTED ARTISTS\\n For shipped work, box dimensions must not exceed 24 in any direction\\n For hand-delivered work, artwork dimensions must not exceed 48 in any direction\\n Artwork should be exhibition-ready, with the artist responsible for providing any necessary mounting fixtures. AMOCA will provide pedestals\\n AMOCA reserves the right to decline any artwork that arrives damaged or does not match the application submission\\nApplication Information & Materials\\nThe\\nFractured Foundations\\napplication is available on Slideroom\\n. If you dont already have a free Slideroom account, youll be prompted to create one before you apply.\\nVisit AMOCAs\\nFractured Foundations\\nweb page\\nfor full details."
    },
    {
        "title": "Call For Photography: In the Nude - Temporary, Artist Calls",
        "organization": "TCG Gallery",
        "location": "Other",
        "deadline": "10/18/2025",
        "url": "https://arts.ca.gov/collective/tcg-gallery-242-4-call-for-photography-in-the-nude/",
        "description": "In the Nude is a photography exhibition that strips away pretense to confront the raw, unapologetic beauty of the human body. From the divine proportions of antiquity to the stark vulnerability of contemporary flesh, these works expose the nude not as an object to be idealized, but as a living canvas of desire, defiance, and truth.\\nIn the Nude is an international open call for photographers ages 18 and older. All forms of two-dimensional images, traditional and non-conventional media, and conventional or alternative photographic processes with a subjective analog or digital photographic base are welcome for submission."
    },
    {
        "title": "Call to Artists  Sculpture at Posy Park - Freelance, Artist Calls",
        "organization": "San Bruno Culture and Arts Commission",
        "location": "SF Bay Area",
        "deadline": "10/22/2025",
        "url": "https://arts.ca.gov/collective/san-bruno-culture-and-arts-commission-245-5-call-to-artists-sculpture-at-posy-park/",
        "description": "The City of San Bruno Culture and Arts Commission invites artists to submit proposals for a permanent outdoor sculpture to be installed at Posy Park. Located at the intersection of Huntington Avenue and San Mateo Avenue, Posy Park is a prominent public plaza situated just outside the San Bruno Caltrain station and is a gateway to downtown San Bruno. Additionally, the park features a tile mural commemorating the citys history, making it a key cultural landmark and potential community gathering place.\\nThe sculpture will serve as the focal point of a broader revitalization effort at Posy Park, which will include a repaired fountain, refreshed landscaping, new bicycle lockers, and restoration of the existing tile mural. This public art installation will enhance the visual appeal and community value of the park, helping to connect residents and visitors to San Brunos dynamic identity.\\nThe submission is open to all professional artists aged 18 and over. Proposals will be reviewed by an ad-hoc selection committee composed of members of the San Bruno Culture and Arts Commission. Public input with be gathered through a survey that invites community feedback based on the finalists proposals. The full Commission will consider the committees recommendation and survey results before forwarding a final recommendation to the San Bruno City Council for approval.\\nFor full details and to submit online application, visit sanbruno.ca.gov/sculpture."
    }
]